{
    "304851092": {
        "product_id": 304851092,
        "modelNbr": "PANSP22",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "FRONTLOAD ELECTRIC DRYER",
        "Type2": "OTHER",
        "Title": "Panda 3200 RPM Ultra Fast Portable Spin Dryer Stainless Steel, 110-Volt / Capacity 0.6 cu. ft., Silver",
        "Brand": "Panda",
        "ImageUrl": "https://images.homedepot-static.com/productImages/30ccac27-7a69-43ce-b2a9-307d2ba29f74/svn/stainless-steel-panda-electric-dryers-pansp22-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Panda-3200-RPM-Ultra-Fast-Portable-Spin-Dryer-Stainless-Steel-110-Volt-Capacity-0-6-cu-ft-PANSP22/304851092",
        "Description": "With a spin speed of 3200rpm this gravity drain spin dryer from Panda is designed to remove as much excess moisture as possible from your laundry, thereby reducing drying times and costs and helping to prolong the life of your laundered items by removing more harmful mineral deposits and detergents than your washing machine can alone. They are easy to move and small enough to operate in a restricted space. Our spin dryers remove excess moisture from your washing load in a speedy and efficient manner, leaving it with less residual water. It is very gentle on your clothes. Stainless steel drum to ensure long life. Completely Safe with Safety Locking Lid and Stabilizing rubber feet. Please acknowledge before purchasing: This is the spin dryer, not a heated dryer, it does not 100% dry the clothes. It does spin function which the spin speed is ultra fast, 3200rpm, it gets washing slightly damp and saves line time. THIS IS A LAUNDRY SPIN DRYER FOR HOUSEHOLD USE ONLY *This machine was designed to process normal household quantities only. Not suitable for continuous operation or commercial use. *It is for regular load only. Overloading will negatively impact wash performance. *We reserve the right to refuse any returns for objective reasons and retain the right to pursue its legal liability.",
        "depth": "13.25",
        "height": "33",
        "width": "13.25",
        "ratingValue": "4.3365",
        "reviewCount": "104",
        "price": 164.13,
        "priceValidUntil": "7/4/2021"
    }
}