{
    "300198835": {
        "product_id": 300198835,
        "modelNbr": "FFBF246SSLHD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. 11.35 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/a1d1d190-e774-446b-8460-2f1f7c5173b6/svn/stainless-steel-summit-appliance-bottom-freezer-refrigerators-ffbf246sslhd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-11-35-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF246SSLHD/300198835",
        "Description": "Summit's thin-line series of ENERGY STAR certified bottom freezer refrigerators conserves energy and space but adds quality and function with innovative features, convenient sizes, and energy efficient operation. Sized under 24 in. wide, the FFBF246SSLHD is perfect for space-challenged kitchens with full storage needs. The platinum cabinet and stainless steel doors bring luxurious style to the kitchen, with pro style handles to complete the look. This unit comes with a left-hand door swing. Full frost-free operation eliminates the need to manually defrost the interior, saving on user maintenance while maintaining the perfect conditions for storing groceries. Inside, the FFBF246SSLHD comes fully featured for maximum storage convenience. The refrigerator section includes adjustable shelves made from safety glass for durability and easy cleaning. Adjustable door racks offer additional storage options, while a large crisper drawer is ideal for keeping produce fresh. This unit includes a removable scalloped steel shelf to store wine and other bottles. An innovative touch control system lets you manage the refrigerator and freezer temperature with an intuitive digital thermostat. LED lighting offers an efficient and attractive view inside. The lower freezer compartment features three slide-out drawers with plastic fronts to help protect stored items when the door is opened.",
        "depth": "25",
        "height": "72.75",
        "width": "23.25",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 1478.57,
        "priceValidUntil": "6/21/2021"
    },
    "313875841": {
        "product_id": 313875841,
        "modelNbr": "MDRF376-1150",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Conserv 11.5 cu. ft. Bottom Freezer Refrigerator in Real Stainless with Wine Rack, Stainless less Steel",
        "Brand": "Conserv",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3338ea5f-996d-42d1-8c8b-02019191ecb9/svn/stainless-less-steel-conserv-bottom-freezer-refrigerators-mdrf376-1150-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Conserv-11-5-cu-ft-Bottom-Freezer-Refrigerator-in-Real-Stainless-with-Wine-Rack-MDRF376-1150/313875841",
        "Description": "This Bottom mounted Tall Slim Refrigerator MDRF376-1150 features a refrigerator capacity of 7.9 cubic feet and 3.6 cubic feet of freezer space. This free-standing real stainless refrigerator, measuring 74.1 x 23.4 x 25.1 inches (HxWxD), packs a powerful punch in features like a reversible door and closed back panel, which lets you place the unit flush against a wall to save space. The convenient frost-free feature takes away the worry of having to manually defrost the freezer. Modern LED lights offer a stylish look, while the spacious interior, with glass shelves, drawers, crisper and wine rack provides ample space for food and beverage storage. This space saving small footprint refrigerator is a must have for your contemporary kitchen. Color: Stainless less Steel.",
        "depth": "24.6 in",
        "height": "72.8",
        "width": "23.2 in",
        "ratingValue": "5.0",
        "reviewCount": "3",
        "price": 1163.99,
        "priceValidUntil": "6/21/2021"
    },
    "314849213": {
        "product_id": 314849213,
        "modelNbr": "GLE12HSPSS",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "11.9 cu. ft. Built-In Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/99d77867-1540-4208-875d-179b9477d5a8/svn/stainless-steel-ge-bottom-freezer-refrigerators-gle12hspss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-11-9-cu-ft-Built-In-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-GLE12HSPSS/314849213",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: Stainless Steel.",
        "depth": "26.5 in",
        "height": "69.875",
        "width": "23.5",
        "ratingValue": "4.7297",
        "reviewCount": "37",
        "price": 1574,
        "priceValidUntil": "06/22/2021"
    },
    "313910489": {
        "product_id": 313910489,
        "modelNbr": "LRBCC1204S",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FRZR W/ICEMKR",
        "Type2": "OTHER",
        "Title": "LG Electronics 12 cu. ft. Bottom Freezer Refrigerator in Printproof Stainless Steel with Multi-Air Flow and SmartDiagnosis",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4c6b2190-d1fd-4e95-8f83-89b6efe6fdc2/svn/printproof-stainless-steel-lg-electronics-bottom-freezer-refrigerators-lrbcc1204s-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-12-cu-ft-Bottom-Freezer-Refrigerator-in-Printproof-Stainless-Steel-with-Multi-Air-Flow-and-SmartDiagnosis-LRBCC1204S/313910489",
        "Description": "This 24 in. wide, 12 cu. ft. refrigerator with bottom freezer offers the style, space storage and freshness you need. Features you can count on-in a size that fits your compact kitchen. Its Multi-Air Flow Freshness System and Door Cooling+ helps keep foods fresher for longer. Color: PrintProof Stainless Steel.",
        "depth": "26.63 in",
        "height": "73.25",
        "width": "23.5 in",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1999,
        "priceValidUntil": "6/21/2021"
    },
    "312903023": {
        "product_id": 312903023,
        "modelNbr": "RB10FSR4ESR",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Samsung 24 in. 11.3 cu. ft. Bottom Freezer Refrigerator in Fingerprint-Resistant Stainless Steel, Fingerprint Resistant Stainless Steel",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/20192ae1-98ab-44e3-b2cb-3ac515b04693/svn/fingerprint-resistant-stainless-steel-samsung-bottom-freezer-refrigerators-rb10fsr4esr-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-24-in-11-3-cu-ft-Bottom-Freezer-Refrigerator-in-Fingerprint-Resistant-Stainless-Steel-RB10FSR4ESR/312903023",
        "Description": "Samsung's 11.3 cu. ft. capacity Bottom Mount Freezer Refrigerator is specifically designed specifically for smaller spaces. The clean lines and modern form blend beautifully into your kitchen, while the fingerprint resistant finish withstands everyday smudges. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "26.63 in",
        "height": "70.13",
        "width": "23.38 in",
        "ratingValue": "4.8148",
        "reviewCount": "54",
        "price": 1394,
        "priceValidUntil": "06/22/2021"
    },
    "300198839": {
        "product_id": 300198839,
        "modelNbr": "FFBF247SSIM",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. 11 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d07ef0bb-8a68-4d86-953a-f008d89f9cd0/svn/stainless-steel-summit-appliance-bottom-freezer-refrigerators-ffbf247ssim-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-11-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF247SSIM/300198839",
        "Description": "Summit's thin-line series of ENERGY STAR certified bottom freezer refrigerators conserves energy and space but adds quality and function with innovative features, convenient sizes, and energy efficient operation. Sized under 24 in. wide, the FFBF247SSIM is perfect for space-challenged kitchens with full storage needs. The platinum cabinet and reversible stainless steel doors bring luxurious style to the kitchen, with pro style handles to complete the look. Full frost-free operation eliminates the need to manually defrost the interior, saving on user maintenance while maintaining the perfect conditions for storing groceries. Inside, the FFBF247SSIM comes fully featured for maximum storage convenience. The refrigerator section includes adjustable shelves made from safety glass for durability and easy cleaning. Adjustable door racks offer additional storage options, while a large crisper drawer is ideal for keeping produce fresh. This unit includes a removable scalloped steel shelf to store wine and other bottles. An innovative touch control system lets you manage the refrigerator and freezer temperature with an intuitive digital thermostat. LED lighting offers an efficient and attractive view inside. The lower freezer compartment features 2 slide-out drawers with plastic fronts to help protect stored items when the door is opened. A factory installed icemaker offers added convenience.",
        "depth": "25",
        "height": "72.75",
        "width": "23.25",
        "ratingValue": "1.3333",
        "reviewCount": "3",
        "price": 1598.08,
        "priceValidUntil": "6/21/2021"
    },
    "302175597": {
        "product_id": 302175597,
        "modelNbr": "FFBF181ESBI",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. W 12.8 cu. ft. Built-In Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Platinum/ Stainless Steel",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0bc065eb-bd43-4f1e-b976-fa3dcc3bca1f/svn/platinum-stainless-steel-summit-appliance-bottom-freezer-refrigerators-ffbf181esbi-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-W-12-8-cu-ft-Built-In-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF181ESBI/302175597",
        "Description": "The FFBF181ESBI is a built-in bottom freezer refrigerator with a unique 24 in. W x 25-1/4 in. D footprint and generous 12.8 cu. ft. capacity. It comes in a platinum cabinet finish with stainless steel doors and designer handles. The exterior digital control panel lets you manage the refrigerator and freezer temperature without opening the door. The control panel includes an audible and visual high temperature and open door alarm to help protect stored contents. Inside, the FFBF181ESBI features a fully frost-free freezer compartment and an automatic defrost refrigerator section. The refrigerator section includes adjustable spill-proof glass shelves, as well as a scalloped shelf ideal for storing wine and other bottled beverages. The door features adjustable racks to accommodate a variety of sizes. This unit includes a ZeroZone deli drawer ideal for storing meats and cheeses at slightly colder temperatures than the rest of the refrigerator compartment. The large crisper drawer features humidity control for optimum storage of fruits and vegetables. This unit is equipped with adaptive intelligent technology that utilizes innovative sensors to automatically adjust to your habits. The lower frost-free freezer compartment is equipped with three slide-out drawers with plastic fronts to better protect stored items from ambient air when the door is opened. A freezer boost function on the control panel helps the unit to reach its coldest temperature faster. Color: Platinum/ Stainless Steel.",
        "depth": "25.25",
        "height": "79.25",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1674,
        "priceValidUntil": "6/21/2021"
    },
    "304807372": {
        "product_id": 304807372,
        "modelNbr": "B11CB50SSS",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Bosch 500 Series 24 in. 11 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "Bosch",
        "ImageUrl": "https://images.homedepot-static.com/productImages/58fb41ad-3ce4-4a0b-8ebd-467209bc12d2/svn/stainless-steel-bosch-bottom-freezer-refrigerators-b11cb50sss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Bosch-500-Series-24-in-11-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-B11CB50SSS/304807372",
        "Description": "Healthy living starts with consuming fresh ingredients, and our Bosch refrigerators are designed to keep foods at their optimal freshness, maintaining their intended nutrients and flavor. Bosch refrigerators feature VitaFresh to preserve your favorite foods, by keeping fruits and vegetables fresher, longer. Bosch refrigerators blend peacefully into any kitchen space and install as flush, counter or standard depths. Thoughtful features like premium tempered glass, hidden hinges and crisp LED lighting reveal a tangible level quality enjoyed with everyday use. Color: Stainless Steel.",
        "depth": "25.75",
        "height": "78.875",
        "width": "23.5",
        "ratingValue": "4.0741",
        "reviewCount": "27",
        "price": 2599,
        "priceValidUntil": "6/21/2021"
    },
    "304807450": {
        "product_id": 304807450,
        "modelNbr": "B11CB81SSS",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FRZR W/ICEMKR",
        "Type2": "OTHER",
        "Title": "Bosch 800 Series 24 in. 11 cu. ft. Bottom Freezer Refrigerator in Stainless Steel with Internal Ice Maker,Counter Depth, Silver",
        "Brand": "Bosch",
        "ImageUrl": "https://images.homedepot-static.com/productImages/67d7c974-d341-4624-9efb-88c3f4926439/svn/stainless-steel-bosch-bottom-freezer-refrigerators-b11cb81sss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Bosch-800-Series-24-in-11-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-with-Internal-Ice-Maker-Counter-Depth-B11CB81SSS/304807450",
        "Description": "Healthy living starts with consuming fresh ingredients, and our Bosch refrigerators are designed to keep foods at their optimal freshness, maintaining their intended nutrients and flavor. Bosch refrigerators feature VitaFresh to preserve your favorite foods, by keeping fruits and vegetables fresher, longer. Bosch refrigerators blend peacefully into any kitchen space and install as flush, counter or standard depths. Thoughtful features like premium tempered glass, hidden hinges and crisp LED lighting reveal a tangible level quality enjoyed with everyday use. Color: Stainless Steel.",
        "depth": "25.75",
        "height": "78.87",
        "width": "23.5",
        "ratingValue": "3.8571",
        "reviewCount": "14",
        "price": 2799,
        "priceValidUntil": "6/21/2021"
    },
    "302175663": {
        "product_id": 302175663,
        "modelNbr": "FFBF249SSIM",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. W 11.6 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Platinum/ Stainless Steel",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/dbd6747d-827b-43c3-91fc-372d042c6a1d/svn/platinum-stainless-steel-summit-appliance-bottom-freezer-refrigerators-ffbf249ssim-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-W-11-6-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF249SSIM/302175663",
        "Description": "The FFBF249SSIM is a bottom freezer refrigerator with a unique 24 in. W x 25-1/4 in. D footprint and generous 11.6 cu. ft. capacity. It comes in a platinum cabinet finish with stainless steel doors and designer handles. The exterior digital control panel lets you manage the refrigerator and freezer temperature without opening the door. The control panel includes an audible and visual high temperature and open door alarm to help protect stored contents. Inside, the FFBF249SSIM features a fully frost-free freezer compartment and an automatic defrost refrigerator section. The refrigerator section includes adjustable spill-proof glass shelves, as well as a scalloped shelf ideal for storing wine and other bottled beverages. The door features adjustable racks to accommodate a variety of sizes. This unit includes a ZeroZone deli drawer ideal for storing meats and cheeses at slightly colder temperatures than the rest of the refrigerator compartment. The large crisper drawer features humidity control for optimum storage of fruits and vegetables. This unit is equipped with adaptive intelligent technology that utilizes innovative sensors to automatically adjust to your habits. The lower frost-free freezer compartment is equipped with three slide-out drawers and a factory-installed icemaker. Color: Platinum/ Stainless Steel.",
        "depth": "25.25",
        "height": "74.38",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1653.75,
        "priceValidUntil": "6/21/2021"
    },
    "314320059": {
        "product_id": 314320059,
        "modelNbr": "GLR12BS2K16",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Galanz 24.4 in. W 12.4 cu. ft. Frost Free Bottom Freezer Refrigerator in Stainless Steel with Ice Maker, Silver",
        "Brand": "Galanz",
        "ImageUrl": "https://images.homedepot-static.com/productImages/39c2c303-8d2e-4c25-b49b-073546cb5c05/svn/stainless-steel-galanz-bottom-freezer-refrigerators-glr12bs2k16-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Galanz-24-4-in-W-12-4-cu-ft-Frost-Free-Bottom-Freezer-Refrigerator-in-Stainless-Steel-with-Ice-Maker-GLR12BS2K16/314320059",
        "Description": "This thoughtful refrigerator offers an adjustable mechanical thermostat control and installed ice maker to make your life easily. Featuring an electronic temperature control and crisper drawer with humidity control, this unit also has LED interior lighting. It is a fun and stylish addition to any kitchen, rec room or home office. Color: Stainless Steel.",
        "depth": "26.5 in",
        "height": "74.5",
        "width": "23.4",
        "ratingValue": "4.75",
        "reviewCount": "4",
        "price": 1299.99,
        "priceValidUntil": "6/21/2021"
    },
    "306942650": {
        "product_id": 306942650,
        "modelNbr": "FFBF181ESIMLHD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. W 12.8 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Stainless steel/platinum",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/69a0ed81-df94-4fc5-81b3-951268a146ed/svn/stainless-steel-platinum-summit-appliance-bottom-freezer-refrigerators-ffbf181esimlhd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-W-12-8-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF181ESIMLHD/306942650",
        "Description": "The FFBF181ESIMLHD is a bottom freezer refrigerator with a unique 24 in. W x 25-1/4 in. D footprint and generous 12.8 cu. ft. capacity. It comes in a platinum cabinet finish with stainless steel doors and designer handles. The exterior digital control panel lets you manage the refrigerator and freezer temperature without opening the door. The control panel includes an audible and visual high temperature and open-door alarm to help protect stored contents. Inside, the FFBF181ESIMLHD features a fully frost-free freezer compartment and an automatic defrost refrigerator section. The refrigerator section includes adjustable spill-proof glass shelves, as well as a scalloped shelf ideal for storing wine and other bottled beverages. The door features adjustable racks to accommodate a variety of sizes. This unit includes a ZeroZone deli drawer ideal for storing meats and cheeses at slightly colder temperatures than the rest of the refrigerator compartment. The large crisper drawer features humidity control for optimum storage of fruits and vegetables. This unit is equipped with adaptive intelligent technology that utilizes innovative sensors to automatically adjust to your habits. The lower frost-free freezer compartment is equipped with two slide-out drawers with plastic fronts and a factory installed icemaker. NOTE: This unit ships with a non-reversible left-hand door swing. For a right-hand version, see the FFBF181ESIM. Color: Stainless steel/platinum.",
        "depth": "25.25",
        "height": "79.25",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 2085.43,
        "priceValidUntil": "6/21/2021"
    },
    "314149104": {
        "product_id": 314149104,
        "modelNbr": "LRBNC1104S",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "LG Electronics 11 cu. ft. Built-in Bottom Freezer Refrigerator in PrintProof Stainless Steel with Multi-Air Flow",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6e24e098-73f0-40e2-839d-fdf9225d75e8/svn/printproof-stainless-steel-lg-electronics-bottom-freezer-refrigerators-lrbnc1104s-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-11-cu-ft-Built-in-Bottom-Freezer-Refrigerator-in-PrintProof-Stainless-Steel-with-Multi-Air-Flow-LRBNC1104S/314149104",
        "Description": "This 24 in. wide, 11 cu. ft. refrigerator with bottom freezer offers the style, space storage and freshness you need. And features you can count on-in a size that fits your compact kitchen. Its Door Cooling+ helps keep foods fresher for longer and built-in ice maker automatically makes ice cubes, so that you always have ice on hand. Color: PrintProof Stainless Steel.",
        "depth": "26.65 in",
        "height": "67.71",
        "width": "23.42 in",
        "ratingValue": "4.7",
        "reviewCount": "10",
        "price": 1499,
        "priceValidUntil": "6/21/2021"
    }
}