{
    "300859005": {
        "product_id": 300859005,
        "modelNbr": "HRB15N3BGS",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FRZ W/O ICEMAKER",
        "Type2": "OTHER",
        "Title": "Haier 15.0 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Fingerprint Resistant, Fingerprint Resistant Stainless Steel",
        "Brand": "Haier",
        "ImageUrl": "https://images.homedepot-static.com/productImages/b4c3bc0f-9a96-42b2-9bad-478e4920b3cb/svn/fingerprint-resistant-stainless-steel-haier-bottom-freezer-refrigerators-hrb15n3bgs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Haier-15-0-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Fingerprint-Resistant-HRB15N3BGS/300859005",
        "Description": "Your Haier 15.0 cu. ft. Bottom Freezer has recessed handles to offer a clean and concealed look. Adjustable shelves provide your family with flexible storage solutions. Haier Appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "26.625",
        "height": "67.875",
        "width": "27.63",
        "ratingValue": "4.4444",
        "reviewCount": "333",
        "price": 1199,
        "priceValidUntil": "6/21/2021"
    },
    "312899428": {
        "product_id": 312899428,
        "modelNbr": "FFBF279SSLHD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BOTTOM FREEZER",
        "Type2": "OTHER",
        "Title": "Summit Appliance 27 in. 14.8 cu. ft. Bottom Freezer Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5e275d3c-0f17-40e1-8ae6-d0c29908b289/svn/stainless-steel-summit-appliance-bottom-freezer-refrigerators-ffbf279sslhd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-27-in-14-8-cu-ft-Bottom-Freezer-Refrigerator-in-Stainless-Steel-Counter-Depth-FFBF279SSLHD/312899428",
        "Description": "The FFBF279SSLHD is conveniently sized at 27 5/8 inches wide and just under 27 inches deep, with a generous 14.8 cu.ft. capacity to meet a family's storage needs in minimum floor space. Stainless steel doors feature an attractive horizontal grain, with a textured platinum cabinet for a great look in any kitchen. This unit has side pocket handles and interior controls for a clean look. The sealed back offers added space savings and easier cleanup. This model has a left hand door swing. Inside, the FFBF279SSLHD utilizes frost-free operation for low maintenance use. The digital controls ensure easy temperature management. It also includes a holiday setting, which allows the refrigerator to run at warmer temperatures to help save energy when not in use during vacation or other extended periods of inactivity. The refrigerator section features automatic LED lighting for an attractive, energy efficient view. Adjustable glass shelves and a full-width crisper drawer ensure easy storage. The door includes three full shelves and two adjustable half racks to best accommodate bottles and other condiments. The large freezer section features two slide-out drawers in clear plastic, helping to protect your stored items from warmer temperature when the door is opened. This model is equipped with a twistable manual ice tray that lets you make miniature cubes and drop them into a removable small bucket.",
        "depth": "26.75",
        "height": "67.63",
        "width": "27.63",
        "ratingValue": "4.0",
        "reviewCount": "1",
        "price": 1690,
        "priceValidUntil": "6/21/2021"
    }
}