{
    "301475708": {
        "product_id": 301475708,
        "modelNbr": "NPGR3-S",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Norpole 78 in. W 53 cu. ft. 3 Glass Door Reach-In Commercial Refrigerator in White",
        "Brand": "Norpole",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5484ae81-c6ef-484f-8cca-890349ac16ef/svn/white-norpole-commercial-refrigerators-npgr3-s-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Norpole-78-in-W-53-cu-ft-3-Glass-Door-Reach-In-Commercial-Refrigerator-in-White-NPGR3-S/301475708",
        "Description": "The NORPOLE commercial triple sliding door reach-in refrigerator is manufactured to ensure optimal performance and design. The 53 cu. ft. 3-door refrigerator features insulating, anti-fog glass sliding doors with easy to remove door gaskets. The heavy-duty compressor is bottom mounted for easy cleaning and service. Digital temperature controls work to maintain the optimum interior temperature. Self-closing sliding doors help to reduce wasted energy and provide easy access when loading and unloading. Frost-free defrost provides lower energy consumption and colder product temperature. The shelves are removable and adjustable for easy cleaning and custom configurations. Color: White.",
        "depth": "30",
        "height": "76",
        "width": "78",
        "ratingValue": "3.0",
        "reviewCount": "1",
        "price": 3399,
        "priceValidUntil": "7/3/2021"
    },
    "203949631": {
        "product_id": 203949631,
        "modelNbr": "MXM2-48R",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Maxx Cold 48 Cu Ft, 2 Door, Glass Merchandiser Refrigerator, White Cabinet",
        "Brand": "Maxx Cold",
        "ImageUrl": "https://images.homedepot-static.com/productImages/82ac9df3-b114-45f9-b4d1-535d118ce460/svn/white-maxx-cold-commercial-refrigerators-mxm2-48r-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Maxx-Cold-48-Cu-Ft-2-Door-Glass-Merchandiser-Refrigerator-White-Cabinet-MXM2-48R/203949631",
        "Description": "Maxx Cold MXM2-48R, Glass Door Merchandisers Refrigerators provide 48 cubic feet of storage space and are designed to display product to preserve freshness and prolong shelf life. Simple-to-use, programmable solid-state digital controls deliver accurate temperature regulation. Double pane insulated glass doors enhance energy efficiency by preventing heat transfers and minimizing condensation. MXM248R Merchandiser is constructed of coated steel interior and white aluminum interior, LED lighting and include eight (8) heavy-duty PE (polyethylene) coated wire shelves. The exterior features, a lock and key set provide additional security, easy to read LED digital temperature display controls and illuminated panel for marketing message.",
        "depth": "32",
        "height": "74",
        "width": "54",
        "ratingValue": "4.3333",
        "reviewCount": "18",
        "price": 2799,
        "priceValidUntil": "7/3/2021"
    },
    "315879595": {
        "product_id": 315879595,
        "modelNbr": "ADA404REF",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Summit Appliance 3.32 cu. ft. Healthcare Undercounter Refrigerator without Freezer in White, ADA Compliant",
        "ImageUrl": "https://images.homedepot-static.com/productImages/26aba108-0e04-4684-a1e9-ee4f723ee09e/svn/white-summit-appliance-commercial-refrigerators-ada404ref-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-3-32-cu-ft-Healthcare-Undercounter-Refrigerator-without-Freezer-in-White-ADA-Compliant-ADA404REF/315879595",
        "Description": "Accucold by Summit Appliance offers cold storage solutions for a variety of institutional and healthcare applications. The ADA404REF is an all-refrigerator sized at 32 in. high for use under lower ADA compliant counters. The front-breathing system and fully finished cabinet allow built-in installation or freestanding use. The reversible door includes a lock conveniently located towards the top of the door for easier access. It is equipped with audible high or low and open-door alarms for added peace of mind with a hospital grade cord and green dot plug for added safety in high traffic areas. Inside, this automatic defrost refrigerator includes adjustable wire shelving and an internal fan for more even temperature distribution. This unit is designed to operate between 2ºC and 8ºC as recommended for a wide variety of pharmaceutical storage applications, with digital controls to ensure easy temperature use. A preinstalled probe hole or access port allows users to connect their own monitoring equipment. The ADA4040REF is ETL-S listed to NSF-7 commercial standards. Pair this unit with the matching -20ºC ADA305AF all-freezer. Color: White.",
        "depth": "22.5",
        "height": "32",
        "width": "19.75",
        "ratingValue": "1.0",
        "reviewCount": "1",
        "price": 573.75,
        "priceValidUntil": "7/3/2021"
    },
    "205803577": {
        "product_id": 205803577,
        "modelNbr": "MXX-23R",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Maxx Cold 23 cu. ft. Single Door Commercial Reach-In Refrigerator in White",
        "Brand": "Maxx Cold",
        "ImageUrl": "https://images.homedepot-static.com/productImages/241dd6f0-01d5-45a2-9e07-086de5d1b35e/svn/white-maxx-cold-commercial-refrigerators-mxx-23r-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Maxx-Cold-23-cu-ft-Single-Door-Commercial-Reach-In-Refrigerator-in-White-MXX-23R/205803577",
        "Description": "Maxx Cold's 23 cu. ft., 1 door reach-in refrigerator has 3 adjustable shelves, digital temperature control and automatic defrost. The digital temperature display is easily viewed from the exterior of the cabinet. Maxx Cold refrigerators are designed to meet the requirements of the most discriminating customer. Color: White.",
        "depth": "33",
        "height": "79.5",
        "width": "30.3",
        "ratingValue": "3.0",
        "reviewCount": "4",
        "price": 1749,
        "priceValidUntil": "7/3/2021"
    },
    "316312678": {
        "product_id": 316312678,
        "modelNbr": "LG1000",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Cooler Depot 48 in. W 35.3 cu. ft. 2-Glass Door Commercial Refrigerator Merchandiser in White Coated Steel",
        "Brand": "Cooler Depot",
        "ImageUrl": "https://images.homedepot-static.com/productImages/92669f20-af4b-472d-80dc-adfc3fef7d06/svn/white-cooler-depot-commercial-refrigerators-lg1000-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Cooler-Depot-48-in-W-35-3-cu-ft-2-Glass-Door-Commercial-Refrigerator-Merchandiser-in-White-Coated-Steel-LG1000/316312678",
        "Description": "Cooler Depot present to you, 48 in. W 35.3 cu. ft. Commercial Refrigerator Merchandiser with Two Glass Doors in White Coated Steel. The unit holds 33°F to 41°F, the ideal temperature for beverage cooling. It will come with casters for you to easily move around the unit. The Top panel comes with LED light for you to display anything you want like your own brand or advertisement.",
        "depth": "27.5 in",
        "height": "71",
        "width": "48 in",
        "ratingValue": "3.0",
        "reviewCount": "1",
        "price": 1989,
        "priceValidUntil": "7/3/2021"
    },
    "310623949": {
        "product_id": 310623949,
        "modelNbr": "CBM-815WS",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Whynter 24 in. 8.1 cu.ft. Freestanding Beverage Merchandiser Refrigerator with Superlit Door in White",
        "Brand": "Whynter",
        "ImageUrl": "https://images.homedepot-static.com/productImages/ecf269d8-5f2b-4cc2-8034-11543e769d4b/svn/white-whynter-commercial-refrigerators-cbm-815ws-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whynter-24-in-8-1-cu-ft-Freestanding-Beverage-Merchandiser-Refrigerator-with-Superlit-Door-in-White-CBM-815WS/310623949",
        "Description": "The Whynter CBM-815WS Freestanding 8.1 cu.ft. Stainless Steel Commercial Beverage Merchandiser Refrigerator is the perfect addition to any home or commercial establishment for cooling and storing your favorite beers and canned beverages. Effortlessly control the interior energy-efficient LED soft light and temperature settings of your beverage refrigerator using the digital control panel. While the see-through tempered double pane glass door displays your beverage collection, the Whynter CBM-815WS is also equipped with a superlit door lighting strip to make it easy to find exactly what you are looking for. Superlit LightingThis beverage refrigerator is equipped with superlit door lighting strip along the door frame that illuminates a bright interior light setup throughout the refrigerator cabinet and provides an attractively dramatic effect for your living room or entertainment area. Powerful Cooling AbilityKeep your drinks fresh with the intuitive touch screen temperature control, which allows for temperature ranging from 34°F - 43°F. The unit cools efficiently using an internal fan-forced circulation system that distributes air evenly throughout the cabinet. Color: White.",
        "depth": "23",
        "height": "48",
        "width": "24",
        "ratingValue": "4.3333",
        "reviewCount": "6",
        "price": 1099.99,
        "priceValidUntil": "7/3/2021"
    }
}