{
    "316085632": {
        "product_id": 316085632,
        "modelNbr": "RZ11T747441",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Samsung BESPOKE 11.4 cu. ft. Flex Column Freezerless Refrigerator with Customizable Colors and Flexible Design in Navy Glass",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/83e193f4-7004-4807-9300-4d2d80f54697/svn/navy-glass-samsung-freezerless-refrigerators-rz11t747441-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-BESPOKE-11-4-cu-ft-Flex-Column-Freezerless-Refrigerator-with-Customizable-Colors-and-Flexible-Design-in-Navy-Glass-RZ11T747441/316085632",
        "Description": "BESPOKE Flex Column refrigerator, which converts from fridge to freezer, can be used alone or combined with another BESPOKE Flex Column or Bottom Freezer refrigerator, to design the perfect refrigerator for your home. Plus, choose from three unique colors. With customizable color options, choose from three colors to create a space that fits your style. Color: Navy Glass.",
        "depth": "25.4 in",
        "height": "73",
        "width": "23.4 in",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 1168,
        "priceValidUntil": "07/14/2021"
    },
    "308037140": {
        "product_id": 308037140,
        "modelNbr": "DAR110A1BSLDD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Danby 24 in. W 11.0 cu. ft. Freezerless Refrigerator in Stainless Steel, Counter Depth, Stainless Look",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0af02d09-18e0-441a-9335-072515c21e94/svn/stainless-look-danby-freezerless-refrigerators-dar110a1bsldd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-24-in-W-11-0-cu-ft-Freezerless-Refrigerator-in-Stainless-Steel-Counter-Depth-DAR110A1BSLDD/308037140",
        "Description": "Sporting a depth of just over 26 in., this freezer-less refrigerator from Danby sits flush with most kitchen counters for a cohesive look. The white 11 cu. ft. fridge has abundant top-to-bottom storage space with five adjustable glass shelves and a lower pull-out vegetable crisper along with five built-in door shelves to keep your foods chilled. ENERGY STAR-certified, this efficient appliance uses a modest amount of electricity that on average will cost $2 - $3 per month to operate. The reversible door can be mounted on either side to open from the right or left, while the integrated handle contributes to the refrigerators sleek design. A built-in light gives you visibility into the depths of the unit and the adjustable mechanical thermostat lets you dial in a preferred temperature. Stash items large and small in this designer refrigerator, which comes with a worry-free 18-months warranty on parts and labor along with convenient in-home service. Color: Stainless Look.",
        "depth": "26.06",
        "height": "58.78",
        "width": "23.94",
        "ratingValue": "3.9677",
        "reviewCount": "31",
        "price": 670.15,
        "priceValidUntil": "7/4/2021"
    },
    "206891678": {
        "product_id": 206891678,
        "modelNbr": "WRR56X18FW",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Whirlpool 17.78 cu. ft. Freezerless Refrigerator in White",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/97d53633-c342-4923-8fcc-2d41d81732d5/svn/white-whirlpool-freezerless-refrigerators-wrr56x18fw-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-17-78-cu-ft-Freezerless-Refrigerator-in-White-WRR56X18FW/206891678",
        "Description": "You'll have plenty of room to store all your favorites inside this Whirlpool 18 cu. ft. ENERGY STAR certified all refrigerator. Choose the ideal temperature for whatever foods you're storing with convenient electronic temperature controls and humidity-controlled crispers. If you need more storage space, this is the refrigerator for you. Color: White.",
        "depth": "29.13",
        "height": "66.75",
        "width": "30.25",
        "ratingValue": "4.1283",
        "reviewCount": "561",
        "price": 1099,
        "priceValidUntil": "7/4/2021"
    },
    "312867621": {
        "product_id": 312867621,
        "modelNbr": "DAR170A3BSLDD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Danby Designer 30 in. W 17.0 cu. ft. Freezerless Refrigerator in Stainless Steel, Counter Depth, Stainless Look",
        "Brand": "Danby Designer",
        "ImageUrl": "https://images.homedepot-static.com/productImages/fb15a0cf-32d9-402a-bc57-a40dc2eb50c2/svn/stainless-look-danby-designer-freezerless-refrigerators-dar170a3bsldd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-Designer-30-in-W-17-0-cu-ft-Freezerless-Refrigerator-in-Stainless-Steel-Counter-Depth-DAR170A3BSLDD/312867621",
        "Description": "While this elegant and spacious refrigerator by Danby may be big enough to live in, we don't recommend it. What it is recommended for though is for people who are looking for a reliable and dependable refrigerator unit without freezer space. This all-refrigerator serves up 17 cu. ft. (480 l) of cool, frost-free storage area. Don't let its size scare you away though - premium rollers ensure the refrigerator can be moved with ease. The stylish appliance features a single door with an integrated handle and a clever reversible hinge which allows you to set it for right or left-handed opening. The neat and tidy interior is illuminated by a powerful LED lighting system which makes it easy to organize the two glass-covered vegetable crispers, the integrated door shelves, and the four adjustable glass shelves. An integrated audible alarm is also included should the door ever be left ajar. There's considerable room for large and tall bottle and this top-of-the-line unit comes with a worry-free 18-months warranty on parts and labor along with convenient in-home service. Color: Stainless Look.",
        "depth": "28.56",
        "height": "67.88",
        "width": "29.94",
        "ratingValue": "3.8511",
        "reviewCount": "47",
        "price": 941.88,
        "priceValidUntil": "7/4/2021"
    },
    "316536615": {
        "product_id": 316536615,
        "modelNbr": "S-47RR",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "SABA 54 in. W 47 cu. ft. Freezerless Commercial Refrigerator in Stainless Steel, Silver",
        "Brand": "SABA",
        "ImageUrl": "https://images.homedepot-static.com/productImages/7afae2b3-ddf0-4076-a1a8-d9a1c796a108/svn/stainless-steel-saba-freezerless-refrigerators-s-47rr-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/SABA-54-in-W-47-cu-ft-Freezerless-Commercial-Refrigerator-in-Stainless-Steel-S-47RR/316536615",
        "Description": "SABA solid door commercial refrigerator provides any market, kitchen or restaurant a product designed to provide years of trouble-free service in demanding commercial applications. This solid door refrigerator has a stainless steel interior and exterior. These refrigerators are perfect for the food service industry, giving your commercial kitchen a reliable beverage cooler and refrigeration for food storage.",
        "depth": "32.25 in",
        "height": "82.5",
        "width": "54 in",
        "ratingValue": "5.0",
        "reviewCount": "5",
        "price": 3149.05,
        "priceValidUntil": "7/4/2021"
    },
    "206908203": {
        "product_id": 206908203,
        "modelNbr": "AFR151SSRH",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Avallon 15 in. W 3.3 cu. ft. Freezerless Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "Avallon",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0ae8a335-b868-4aed-88df-8a8803b13f26/svn/stainless-steel-avallon-freezerless-refrigerators-afr151ssrh-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Avallon-15-in-W-3-3-cu-ft-Freezerless-Refrigerator-in-Stainless-Steel-Counter-Depth-AFR151SSRH/206908203",
        "Description": "With a slim design yet superior storage capacity, the Avallon AFR151SSRH Built-In Fridge creates an optimal storage environment for your food and beverages. A solid stainless steel door gives this fridge a clean look that makes it ideal either as an under counter built-in or free standing unit. The matching stainless steel front vent and solid handlebar are the finishing touches on this compact, professional looking fridge. The compact AFR151SSRH utilizes powerful circulation fans that work with the state- of-the-art compressor to provide even cooling throughout the unit. The digital touch panel allows you to monitor and control the temperature keeping its contents perfectly cooled. The upgraded compressor and anti-vibration gasket leave your food and beverages undisturbed while the included carbon filter blocks unwanted odors. Complete with 3 glass shelves and spacious door storage, the AFR151SSRH is the essence of function and form. Optional blue or white LED side and top mounted internal lights add to the deluxe look and feel of this unit. Finally, you can rest assured that your food and beverages will be safe with the included security lock.",
        "depth": "24.1",
        "height": "34.2",
        "width": "15",
        "ratingValue": "4.3846",
        "reviewCount": "13",
        "price": 789,
        "priceValidUntil": "7/4/2021"
    },
    "303841965": {
        "product_id": 303841965,
        "modelNbr": "GARF30FDGB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Gladiator 17.8 cu. ft. Rolling Freezerless Refrigerator in Black",
        "Brand": "Gladiator",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5cd18ff1-8d17-4541-b409-7424b4981334/svn/black-gladiator-freezerless-refrigerators-garf30fdgb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Gladiator-17-8-cu-ft-Rolling-Freezerless-Refrigerator-in-Black-GARF30FDGB/303841965",
        "Description": "The Industrys Only Step-to-Open All Refrigerator makes it easy to stock up when your hands are full of party trays or a case of beverages. Plus, its robust styling fits right in with other Gladiator products in the garage. Pair it with our Upright Freezer so you can also keep snacks and more properly frozen. Note: Refrigerator contents may freeze if room temperatures reach 32°F (0°C) or below. Monitor food and beverages frequently for freezing, freshness and taste when using the refrigerator in cold locations. Color: Black.",
        "depth": "29.88",
        "height": "72.75",
        "width": "30.88",
        "ratingValue": "4.0806",
        "reviewCount": "62",
        "price": 1199,
        "priceValidUntil": "7/4/2021"
    },
    "205471286": {
        "product_id": 205471286,
        "modelNbr": "DAR110A1WDD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Danby Designer 24 in. W 11.0 cu. ft. Freezerless Refrigerator in White, Counter Depth",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/8eae17cc-a09f-4b7a-80d8-ef6f59bcc2e1/svn/white-danby-freezerless-refrigerators-dar110a1wdd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-Designer-24-in-W-11-0-cu-ft-Freezerless-Refrigerator-in-White-Counter-Depth-DAR110A1WDD/205471286",
        "Description": "Sporting a depth of just over 26 in., this freezer-less refrigerator from Danby sits flush with most kitchen counters for a cohesive look. The white 11 cu. ft. fridge has abundant top-to-bottom storage space with five adjustable glass shelves and a lower pull-out vegetable crisper along with five built-in door shelves to keep your foods chilled. ENERGY STAR-certified, this efficient appliance uses a modest amount of electricity that on average will cost $2 - $3 per month to operate. The reversible door can be mounted on either side to open from the right or left, while the integrated handle contributes to the refrigerator's sleek design. A built-in light gives you visibility into the depths of the unit and the adjustable mechanical thermostat lets you dial in a preferred temperature. Stash items large and small in this designer refrigerator, which comes with a worry-free 18-months warranty on parts and labor along with convenient in-home service.",
        "depth": "26.06",
        "height": "58.78",
        "width": "23.94",
        "ratingValue": "4.3699",
        "reviewCount": "246",
        "price": 596.37,
        "priceValidUntil": "7/4/2021"
    },
    "205744994": {
        "product_id": 205744994,
        "modelNbr": "WSR57R18DM",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Whirlpool 17.7 cu. ft. SideKicks Freezerless Refrigerator in Monochromatic Stainless Steel",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4e9cb8db-edbe-4822-a3f8-0015a5f7d6bc/svn/monochromatic-stainless-steel-whirlpool-freezerless-refrigerators-wsr57r18dm-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-17-7-cu-ft-SideKicks-Freezerless-Refrigerator-in-Monochromatic-Stainless-Steel-WSR57R18DM/205744994",
        "Description": "This All-Refrigerator offers all the space you could ever ask for. Enjoy this 18 cu. ft. refrigerator as a stand-alone unit or pair it with its matching Sidekicks all-freezer (model# WSZ57L18DM) for the complete look and a total of 36 cu. ft. of storage. Customization of this refrigerator is simple and easy with three adjustable glass shelves and three adjustable door bins. If you are in need of more storage space, this is the refrigerator for you. Color: Monochromatic Stainless Steel.",
        "depth": "28.88",
        "height": "66.75",
        "width": "30.25",
        "ratingValue": "2.9789",
        "reviewCount": "190",
        "price": 1979,
        "priceValidUntil": "07/14/2021"
    },
    "315386472": {
        "product_id": 315386472,
        "modelNbr": "DAR110A3MDB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Danby 11 cu. ft. Freezerless Refrigerator in Black, Counter Depth",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d239a104-017f-41b0-933c-0e7574d23d14/svn/black-danby-freezerless-refrigerators-dar110a3mdb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-11-cu-ft-Freezerless-Refrigerator-in-Black-Counter-Depth-DAR110A3MDB/315386472",
        "Description": "Drawing inspiration from mid-century styling and simplicity, Danby's patented Contemporary Classic collection of refrigerators reimagine retro for the modern consumer. Featuring Danby's exclusive retro-inspired curved door design, black metallic door and chassis finish, rubber-grip ergonomic chrome handle and stylized chrome worktop, its exterior features are only outmatched by its signature black interior. Boasting 11 cu. ft. (311 l) of storage and cooling space, it features three chrome-trimmed tempered glass shelves and five integrated door shelves for maximum storage versatility. There's more than enough room for larger bottles and the spacious unit helps keep electricity bills in check with its ENERGY STAR rating and state-of-the-art mechanical thermostat. Maintenance and cleaning are as simple as can be with the automatic defrost system. It also includes an efficient and reliable interior white LED light. This model is built for convenience as the reversible door hinge allows you to adjust it for either left or right-handed opening.",
        "depth": "26.18",
        "height": "58.86",
        "width": "23.82",
        "ratingValue": "4.8333",
        "reviewCount": "6",
        "price": 799,
        "priceValidUntil": "7/4/2021"
    },
    "305475571": {
        "product_id": 305475571,
        "modelNbr": "SRVBC050R",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Silhouette 24 in. 5.0 cu. ft. Freezerless Built-In Refrigerator in Black",
        "Brand": "Silhouette",
        "ImageUrl": "https://images.homedepot-static.com/productImages/03b53d5d-ab24-42e1-be2e-f5ed0ed09528/svn/black-silhouette-freezerless-refrigerators-srvbc050r-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Silhouette-24-in-5-0-cu-ft-Freezerless-Built-In-Refrigerator-in-Black-SRVBC050R/305475571",
        "Description": "Store more than just beer and soda in the Silhouette Reserve All Fridge. This cooler boasts temperature ranges designed to safely store cheese and meat platters, seafood, and other assorted perishables. Whether you find yourself entertaining friends or needing more convenient refrigeration for your family, the Silhouette Reserves under-counter design delivers style and practicality like no other beverage center on the market. Color: Black.",
        "depth": "24",
        "height": "34.81",
        "width": "23.88",
        "ratingValue": "5.0",
        "reviewCount": "3",
        "price": 2599,
        "priceValidUntil": "7/4/2021"
    },
    "301277179": {
        "product_id": 301277179,
        "modelNbr": "AFR151SSLH",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Avallon 3.3 cu. ft. 15 in. Built-In Freezerless Refrigerator in Stainless Steel, Left Hinge, Silver",
        "Brand": "Avallon",
        "ImageUrl": "https://images.homedepot-static.com/productImages/24e6408a-2fc9-430b-9421-59c2851d88a3/svn/stainless-steel-avallon-freezerless-refrigerators-afr151sslh-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Avallon-3-3-cu-ft-15-in-Built-In-Freezerless-Refrigerator-in-Stainless-Steel-Left-Hinge-AFR151SSLH/301277179",
        "Description": "With a slim design yet superior storage capacity, the Avallon AFR151SSLH Built-In Fridge creates an optimal storage environment for your food and beverages. A solid stainless-steel door gives this fridge a clean look that makes it ideal either as an under counter built-in or free-standing unit. The matching stainless-steel front vent and solid handlebar are the finishing touches on this compact, professional looking fridge. The compact AFR151SSLH utilizes powerful circulation fans that work with the state- of-the-art compressor to provide even cooling throughout the unit. The digital touch panel allows you to monitor and control the temperature keeping its contents perfectly cooled. The upgraded compressor and anti-vibration gasket leave your food and beverages undisturbed while the included carbon filter blocks unwanted odors. Complete with 3 glass shelves and spacious door storage, the AFR151SSLH is the essence of function and form. Optional blue or white LED side and top mounted internal lights add to the deluxe look and feel of this unit. Finally, you can rest assured that your food and beverages will be safe with the included security lock. Color: Stainless Steel.",
        "depth": "24.1",
        "height": "34.2",
        "width": "15",
        "ratingValue": "4.75",
        "reviewCount": "4",
        "price": 789,
        "priceValidUntil": "7/4/2021"
    }
}