{
    "205471286": {
        "product_id": 205471286,
        "modelNbr": "DAR110A1WDD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "BUILT IN REFRIGERATION",
        "Type2": "OTHER",
        "Title": "Danby Designer 24 in. W 11.0 cu. ft. Freezerless Refrigerator in White, Counter Depth",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/8eae17cc-a09f-4b7a-80d8-ef6f59bcc2e1/svn/white-danby-freezerless-refrigerators-dar110a1wdd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-Designer-24-in-W-11-0-cu-ft-Freezerless-Refrigerator-in-White-Counter-Depth-DAR110A1WDD/205471286",
        "Description": "Sporting a depth of just over 26 in., this freezer-less refrigerator from Danby sits flush with most kitchen counters for a cohesive look. The white 11 cu. ft. fridge has abundant top-to-bottom storage space with five adjustable glass shelves and a lower pull-out vegetable crisper along with five built-in door shelves to keep your foods chilled. ENERGY STAR-certified, this efficient appliance uses a modest amount of electricity that on average will cost $2 - $3 per month to operate. The reversible door can be mounted on either side to open from the right or left, while the integrated handle contributes to the refrigerator's sleek design. A built-in light gives you visibility into the depths of the unit and the adjustable mechanical thermostat lets you dial in a preferred temperature. Stash items large and small in this designer refrigerator, which comes with a worry-free 18-months warranty on parts and labor along with convenient in-home service.",
        "depth": "26.06",
        "height": "58.78",
        "width": "23.94",
        "ratingValue": "4.3699",
        "reviewCount": "246",
        "price": 596.37,
        "priceValidUntil": "7/4/2021"
    },
    "312423329": {
        "product_id": 312423329,
        "modelNbr": "DAR170A3WDD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Danby Designer 30 in. W 17.0 cu. ft. Freezerless Refrigerator in White Counter Depth",
        "Brand": "Danby Designer",
        "ImageUrl": "https://images.homedepot-static.com/productImages/ffe756d0-a91a-4297-9a6f-8cefcf12cccc/svn/white-danby-designer-freezerless-refrigerators-dar170a3wdd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-Designer-30-in-W-17-0-cu-ft-Freezerless-Refrigerator-in-White-Counter-Depth-DAR170A3WDD/312423329",
        "Description": "While this elegant and spacious refrigerator by Danby may be big enough to live in, we don't recommend it. It is recommended for though is for people who are looking for a reliable and dependable refrigerator unit without freezer space. This all-refrigerator serves up 17 cu. ft. (480 l) of cool, frost-free storage area. Don't let its size scare you away though - premium rollers ensure the refrigerator can be moved with ease. The stylish appliance features a single door with an integrated handle and a clever reversible hinge which allows you to set it for right or left-handed opening. The neat and tidy interior is illuminated by a powerful LED lighting system which makes it easy to organize the two glass-covered vegetable crispers, the integrated door shelves, and the four adjustable glass shelves. An integrated audible alarm is also included should the door ever be left ajar. There's considerable room for large and tall bottle and this top-of-the-line unit comes with a worry-free 18-month warranty on parts and labor along with convenient in-home service. Color: White.",
        "depth": "28.56",
        "height": "67.88",
        "width": "29.94",
        "ratingValue": "3.8222",
        "reviewCount": "45",
        "price": 1241.9,
        "priceValidUntil": "7/4/2021"
    },
    "206891678": {
        "product_id": 206891678,
        "modelNbr": "WRR56X18FW",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Whirlpool 17.78 cu. ft. Freezerless Refrigerator in White",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/97d53633-c342-4923-8fcc-2d41d81732d5/svn/white-whirlpool-freezerless-refrigerators-wrr56x18fw-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-17-78-cu-ft-Freezerless-Refrigerator-in-White-WRR56X18FW/206891678",
        "Description": "You'll have plenty of room to store all your favorites inside this Whirlpool 18 cu. ft. ENERGY STAR certified all refrigerator. Choose the ideal temperature for whatever foods you're storing with convenient electronic temperature controls and humidity-controlled crispers. If you need more storage space, this is the refrigerator for you. Color: White.",
        "depth": "29.13",
        "height": "66.75",
        "width": "30.25",
        "ratingValue": "4.1283",
        "reviewCount": "561",
        "price": 1099,
        "priceValidUntil": "7/4/2021"
    },
    "316085766": {
        "product_id": 316085766,
        "modelNbr": "RZ11T747435",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Samsung BESPOKE 11.4 cu. ft. Flex Column Freezerless Refrigerator with Customizable Colors and Flexible Design in White Glass",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/299843c7-a0f1-40cc-a277-089cee01b1fc/svn/white-glass-samsung-freezerless-refrigerators-rz11t747435-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-BESPOKE-11-4-cu-ft-Flex-Column-Freezerless-Refrigerator-with-Customizable-Colors-and-Flexible-Design-in-White-Glass-RZ11T747435/316085766",
        "Description": "BESPOKE Flex Column refrigerator, which converts from fridge to freezer, can be used alone or combined with another BESPOKE Flex Column or Bottom Freezer refrigerator, to design the perfect refrigerator for your home. Plus, choose from three unique colors. With customizable color options, choose from three colors to create a space that fits your style. Color: White Glass.",
        "depth": "25.4 in",
        "height": "73",
        "width": "23.4 in",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 1168,
        "priceValidUntil": "07/14/2021"
    }
}