{
    "205744994": {
        "product_id": 205744994,
        "modelNbr": "WSR57R18DM",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "ALL REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Whirlpool 17.7 cu. ft. SideKicks Freezerless Refrigerator in Monochromatic Stainless Steel",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4e9cb8db-edbe-4822-a3f8-0015a5f7d6bc/svn/monochromatic-stainless-steel-whirlpool-freezerless-refrigerators-wsr57r18dm-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-17-7-cu-ft-SideKicks-Freezerless-Refrigerator-in-Monochromatic-Stainless-Steel-WSR57R18DM/205744994",
        "Description": "This All-Refrigerator offers all the space you could ever ask for. Enjoy this 18 cu. ft. refrigerator as a stand-alone unit or pair it with its matching Sidekicks all-freezer (model# WSZ57L18DM) for the complete look and a total of 36 cu. ft. of storage. Customization of this refrigerator is simple and easy with three adjustable glass shelves and three adjustable door bins. If you are in need of more storage space, this is the refrigerator for you. Color: Monochromatic Stainless Steel.",
        "depth": "28.88",
        "height": "66.75",
        "width": "30.25",
        "ratingValue": "2.9683",
        "reviewCount": "189",
        "price": 2199,
        "priceValidUntil": "6/21/2021"
    },
    "316536615": {
        "product_id": 316536615,
        "modelNbr": "S-47RR",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "SABA 54 in. W 47 cu. ft. Freezerless Commercial Refrigerator in Stainless Steel, Silver",
        "Brand": "SABA",
        "ImageUrl": "https://images.homedepot-static.com/productImages/7afae2b3-ddf0-4076-a1a8-d9a1c796a108/svn/stainless-steel-saba-freezerless-refrigerators-s-47rr-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/SABA-54-in-W-47-cu-ft-Freezerless-Commercial-Refrigerator-in-Stainless-Steel-S-47RR/316536615",
        "Description": "SABA solid door commercial refrigerator provides any market, kitchen or restaurant a product designed to provide years of trouble-free service in demanding commercial applications. This solid door refrigerator has a stainless steel interior and exterior. These refrigerators are perfect for the food service industry, giving your commercial kitchen a reliable beverage cooler and refrigeration for food storage.",
        "depth": "32.25 in",
        "height": "82.5",
        "width": "54 in",
        "ratingValue": "5.0",
        "reviewCount": "5",
        "price": 3149.05,
        "priceValidUntil": "6/21/2021"
    },
    "301277179": {
        "product_id": 301277179,
        "modelNbr": "AFR151SSLH",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Avallon 3.3 cu. ft. 15 in. Built-In Freezerless Refrigerator in Stainless Steel, Left Hinge, Silver",
        "Brand": "Avallon",
        "ImageUrl": "https://images.homedepot-static.com/productImages/24e6408a-2fc9-430b-9421-59c2851d88a3/svn/stainless-steel-avallon-freezerless-refrigerators-afr151sslh-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Avallon-3-3-cu-ft-15-in-Built-In-Freezerless-Refrigerator-in-Stainless-Steel-Left-Hinge-AFR151SSLH/301277179",
        "Description": "With a slim design yet superior storage capacity, the Avallon AFR151SSLH Built-In Fridge creates an optimal storage environment for your food and beverages. A solid stainless-steel door gives this fridge a clean look that makes it ideal either as an under counter built-in or free-standing unit. The matching stainless-steel front vent and solid handlebar are the finishing touches on this compact, professional looking fridge. The compact AFR151SSLH utilizes powerful circulation fans that work with the state- of-the-art compressor to provide even cooling throughout the unit. The digital touch panel allows you to monitor and control the temperature keeping its contents perfectly cooled. The upgraded compressor and anti-vibration gasket leave your food and beverages undisturbed while the included carbon filter blocks unwanted odors. Complete with 3 glass shelves and spacious door storage, the AFR151SSLH is the essence of function and form. Optional blue or white LED side and top mounted internal lights add to the deluxe look and feel of this unit. Finally, you can rest assured that your food and beverages will be safe with the included security lock. Color: Stainless Steel.",
        "depth": "24.1",
        "height": "34.2",
        "width": "15",
        "ratingValue": "4.75",
        "reviewCount": "4",
        "price": 789,
        "priceValidUntil": "6/21/2021"
    },
    "206908203": {
        "product_id": 206908203,
        "modelNbr": "AFR151SSRH",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Avallon 15 in. W 3.3 cu. ft. Freezerless Refrigerator in Stainless Steel, Counter Depth, Silver",
        "Brand": "Avallon",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0ae8a335-b868-4aed-88df-8a8803b13f26/svn/stainless-steel-avallon-freezerless-refrigerators-afr151ssrh-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Avallon-15-in-W-3-3-cu-ft-Freezerless-Refrigerator-in-Stainless-Steel-Counter-Depth-AFR151SSRH/206908203",
        "Description": "With a slim design yet superior storage capacity, the Avallon AFR151SSRH Built-In Fridge creates an optimal storage environment for your food and beverages. A solid stainless steel door gives this fridge a clean look that makes it ideal either as an under counter built-in or free standing unit. The matching stainless steel front vent and solid handlebar are the finishing touches on this compact, professional looking fridge. The compact AFR151SSRH utilizes powerful circulation fans that work with the state- of-the-art compressor to provide even cooling throughout the unit. The digital touch panel allows you to monitor and control the temperature keeping its contents perfectly cooled. The upgraded compressor and anti-vibration gasket leave your food and beverages undisturbed while the included carbon filter blocks unwanted odors. Complete with 3 glass shelves and spacious door storage, the AFR151SSRH is the essence of function and form. Optional blue or white LED side and top mounted internal lights add to the deluxe look and feel of this unit. Finally, you can rest assured that your food and beverages will be safe with the included security lock.",
        "depth": "24.1",
        "height": "34.2",
        "width": "15",
        "ratingValue": "4.3846",
        "reviewCount": "13",
        "price": 789,
        "priceValidUntil": "6/21/2021"
    }
}