{
    "315386472": {
        "product_id": 315386472,
        "modelNbr": "DAR110A3MDB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Danby 11 cu. ft. Freezerless Refrigerator in Black, Counter Depth",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d239a104-017f-41b0-933c-0e7574d23d14/svn/black-danby-freezerless-refrigerators-dar110a3mdb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-11-cu-ft-Freezerless-Refrigerator-in-Black-Counter-Depth-DAR110A3MDB/315386472",
        "Description": "Drawing inspiration from mid-century styling and simplicity, Danby's patented Contemporary Classic collection of refrigerators reimagine retro for the modern consumer. Featuring Danby's exclusive retro-inspired curved door design, black metallic door and chassis finish, rubber-grip ergonomic chrome handle and stylized chrome worktop, its exterior features are only outmatched by its signature black interior. Boasting 11 cu. ft. (311 l) of storage and cooling space, it features three chrome-trimmed tempered glass shelves and five integrated door shelves for maximum storage versatility. There's more than enough room for larger bottles and the spacious unit helps keep electricity bills in check with its ENERGY STAR rating and state-of-the-art mechanical thermostat. Maintenance and cleaning are as simple as can be with the automatic defrost system. It also includes an efficient and reliable interior white LED light. This model is built for convenience as the reversible door hinge allows you to adjust it for either left or right-handed opening.",
        "depth": "26.18",
        "height": "58.86",
        "width": "23.82",
        "ratingValue": "4.8333",
        "reviewCount": "6",
        "price": 799,
        "priceValidUntil": "7/4/2021"
    },
    "303841965": {
        "product_id": 303841965,
        "modelNbr": "GARF30FDGB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "UPRIGHT FREEZER",
        "Type2": "OTHER",
        "Title": "Gladiator 17.8 cu. ft. Rolling Freezerless Refrigerator in Black",
        "Brand": "Gladiator",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5cd18ff1-8d17-4541-b409-7424b4981334/svn/black-gladiator-freezerless-refrigerators-garf30fdgb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Gladiator-17-8-cu-ft-Rolling-Freezerless-Refrigerator-in-Black-GARF30FDGB/303841965",
        "Description": "The Industrys Only Step-to-Open All Refrigerator makes it easy to stock up when your hands are full of party trays or a case of beverages. Plus, its robust styling fits right in with other Gladiator products in the garage. Pair it with our Upright Freezer so you can also keep snacks and more properly frozen. Note: Refrigerator contents may freeze if room temperatures reach 32°F (0°C) or below. Monitor food and beverages frequently for freezing, freshness and taste when using the refrigerator in cold locations. Color: Black.",
        "depth": "29.88",
        "height": "72.75",
        "width": "30.88",
        "ratingValue": "4.0806",
        "reviewCount": "62",
        "price": 1199,
        "priceValidUntil": "7/4/2021"
    },
    "305475571": {
        "product_id": 305475571,
        "modelNbr": "SRVBC050R",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Silhouette 24 in. 5.0 cu. ft. Freezerless Built-In Refrigerator in Black",
        "Brand": "Silhouette",
        "ImageUrl": "https://images.homedepot-static.com/productImages/03b53d5d-ab24-42e1-be2e-f5ed0ed09528/svn/black-silhouette-freezerless-refrigerators-srvbc050r-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Silhouette-24-in-5-0-cu-ft-Freezerless-Built-In-Refrigerator-in-Black-SRVBC050R/305475571",
        "Description": "Store more than just beer and soda in the Silhouette Reserve All Fridge. This cooler boasts temperature ranges designed to safely store cheese and meat platters, seafood, and other assorted perishables. Whether you find yourself entertaining friends or needing more convenient refrigeration for your family, the Silhouette Reserves under-counter design delivers style and practicality like no other beverage center on the market. Color: Black.",
        "depth": "24",
        "height": "34.81",
        "width": "23.88",
        "ratingValue": "5.0",
        "reviewCount": "3",
        "price": 2599,
        "priceValidUntil": "7/4/2021"
    }
}