{
    "313254287": {
        "product_id": 313254287,
        "modelNbr": "CT661WBISSHVADALHD",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 5.1 cu. ft. Mini Refrigerator with Freezer in Stainless Steel, ADA Compliant, Stainless steel wrapped door/white cabinet",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/01d74296-1802-4bd8-9b82-4a42c57b2ec4/svn/stainless-steel-wrapped-door-white-cabinet-summit-appliance-mini-fridges-ct661wbisshvadalhd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-5-1-cu-ft-Mini-Refrigerator-with-Freezer-in-Stainless-Steel-ADA-Compliant-CT661WBISSHVADALHD/313254287",
        "Description": "Summit brings quality and value under the counter with the industry's largest collection of ADA compliant built-in refrigeration. The CT661BIWADA Series features residential refrigerator-freezers made in Europe and designed for reliable cold storage under lower ADA counters. Sized with a 24 in. footprint, the CT661WBISSHVADALHD refrigerator-freezer offers a generous 5.1 cu. ft. storage capacity, larger than many units in this size class. The 32 in. H and front-breathing design makes it ideal for installation under lower counters complying with ADA guidelines for height restriction. The fully finished cabinet also enables freestanding use. This unit comes with a white cabinet and stainless steel wrapped door with a left hand door swing. A sleek stainless steel handle completes the professional look. Inside, the CT661WBISSHVADALHD features a dual evaporator to allow separated cooling of the fresh and frozen food sections. The refrigerated compartment utilizes low maintenance automatic defrost, while the interior freezer compartment is manual defrost to achieve lower storage temperatures ideal for ice cream and other frozen food. The deluxe interior includes adjustable glass shelves for spill-proof storage and easier cleaning, as well as a scalloped wine shelf to hold wine and champagne bottles safely in place. Door racks offer additional convenience for tall bottles and condiments and a clear crisper drawer ensures your produce is stored under the ideal conditions. Color: Stainless steel wrapped door/white cabinet.",
        "depth": "23",
        "height": "32.38",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1411,
        "priceValidUntil": "6/21/2021"
    },
    "310700103": {
        "product_id": 310700103,
        "modelNbr": "MCDR740BE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 7.4 cu. ft. 2 Door Mini Fridge in Black",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/df2816e0-79bc-4f37-b1b1-c9db22cc2d56/svn/black-magic-chef-mini-fridges-mcdr740be-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-7-4-cu-ft-2-Door-Mini-Fridge-in-Black-MCDR740BE/310700103",
        "Description": "The Magic Chef 7.4 cu. ft. Top Freezer Refrigerator is the perfect in-between, or extra fridge; more spacious than a mini but more compact than a standard household unit. It is a suitable appliance for smaller kitchens, break rooms, office kitchenettes or anywhere with space constraints. It occupies a small footprint but offers numerous cold-storage options for foods and beverages, including a glass-covered crisper to keep produce fresh. It's equipped with two adjustable-height glass shelves in the refrigerator and one wire shelf in the freezer, with several other storage options built into the reversible doors. Color: Black.",
        "depth": "22.8",
        "height": "55.3",
        "width": "21.7",
        "ratingValue": "4.3584",
        "reviewCount": "851",
        "price": 199.99,
        "priceValidUntil": "06/23/2021"
    },
    "313244839": {
        "product_id": 313244839,
        "modelNbr": "CT663BKBISSTB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 5.1 cu. ft. Mini Refrigerator with Freezer in Stainless Steel, Stainless steel wrapped door and black cabinet",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/321614d1-3dea-40aa-95a1-202c63e6288f/svn/stainless-steel-wrapped-door-and-black-cabinet-summit-appliance-mini-fridges-ct663bkbisstb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-5-1-cu-ft-Mini-Refrigerator-with-Freezer-in-Stainless-Steel-CT663BKBISSTB/313244839",
        "Description": "Summit brings quality and value under the counter with the industry's largest collection of built-in refrigeration. The CT663BKBI Series features residential refrigerator-freezers made in Europe and designed for reliable cold storage in any home kitchen. Sized with a 24 in. footprint, CT663BKBISSTB refrigerator-freezer offers a generous 5.1 cu. ft. storage capacity, a larger interior than many units in this size class. The front-breathing design allows built-in installation under counters, while the fully finished cabinet also enables freestanding use. This unit comes with a black cabinet and stainless steel wrapped door. A curved towel bar style handle in brushed stainless steel completes the professional look. Inside, the CT663BKBISSTB features a dual evaporator to allow separated cooling of the fresh and frozen food sections. The refrigerated compartment utilizes low maintenance automatic defrost, while the interior freezer compartment is manual defrost to achieve lower storage temperatures ideal for ice cream and other frozen food. The deluxe interior includes adjustable glass shelves for spill-proof storage and easier cleaning, as well as a scalloped wine shelf to hold wine and champagne bottles safely in place. Door racks offer additional convenience for tall bottles and condiments and a clear crisper drawer ensures your produce is stored under the ideal conditions. This model includes automatic interior lighting and an adjustable dial thermostat. Color: Stainless steel wrapped door and black cabinet.",
        "depth": "23",
        "height": "32.63",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1125,
        "priceValidUntil": "6/21/2021"
    },
    "310218838": {
        "product_id": 310218838,
        "modelNbr": "CDE06RP4NW2",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Cafe 5.7 cu. ft. Built-in Undercounter Dual Drawer Refrigerator in Matte White, Fingerprint Resistant, Fingerprint Resistant Matte White",
        "Brand": "Cafe",
        "ImageUrl": "https://images.homedepot-static.com/productImages/8f1bdf60-0a73-4e05-8688-f0f2c120f7fc/svn/fingerprint-resistant-matte-white-cafe-mini-fridges-cde06rp4nw2-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Cafe-5-7-cu-ft-Built-in-Undercounter-Dual-Drawer-Refrigerator-in-Matte-White-Fingerprint-Resistant-CDE06RP4NW2/310218838",
        "Description": "One look at the Cafe kitchen and youll feel as if you've been transported behind the scenes of your favorite casual dining experience. Each appliance has been meticulously designed to create an atmosphere where people like to gather and love to cook. Tough stainless steel and powerful elements complement their robust appearance. Color: Fingerprint Resistant Matte White.",
        "depth": "23.75",
        "height": "33.88",
        "width": "23.88",
        "ratingValue": "4.4167",
        "reviewCount": "48",
        "price": 2789,
        "priceValidUntil": "06/22/2021"
    },
    "205508808": {
        "product_id": 205508808,
        "modelNbr": "GCE06GSHSB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "5.6 cu. ft. Mini Fridge in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/df5b838e-2858-4c3c-ad32-58f56df790ba/svn/stainless-steel-ge-mini-fridges-gce06gshsb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-5-6-cu-ft-Mini-Fridge-in-Stainless-Steel-GCE06GSHSB/205508808",
        "Description": "Your 5.6 cu. ft. Mini Refrigerator in Stainless Steel is Built-in or freestanding capability and allows for flexible installation undercounter. Two glass shelves and in door storage with can rack helps to keep your food organized. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical.",
        "depth": "23.25",
        "height": "34.125",
        "width": "23.63",
        "ratingValue": "4.394",
        "reviewCount": "703",
        "price": 467,
        "priceValidUntil": "06/22/2021"
    },
    "305627610": {
        "product_id": 305627610,
        "modelNbr": "EFR180",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Frigidaire 1.6 cu. ft. Mini Fridge in Stainless Steel, Stainless Steel/Black",
        "Brand": "Frigidaire",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e737e52c-c805-4a6f-8b32-347672ce8001/svn/stainless-steel-black-frigidaire-mini-fridges-efr180-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Frigidaire-1-6-cu-ft-Mini-Fridge-in-Stainless-Steel-EFR180/305627610",
        "Description": "The Frigidaire 1.6 cu. ft. Mini Refrigerator has enough room for your groceries, yet is compact enough to fit almost anywhere. The mini refrigerator features an ice cube chamber freezer with a small freezing compartment, an ice cube tray and an integrated tall bottle holder. The slide-out shelf helps keep your items organized, and the reversible door design makes it easy to place in cramped spaces. A sleek, stylish stainless steel finish, invisible door handle and clean lines blend nicely with any decor, and the efficient compressor cooling system ensures low energy consumption and is free from CFC. Size: 18.3 In. Color: Stainless Steel/Black.",
        "depth": "18.3",
        "height": "19.6",
        "width": "17.51",
        "ratingValue": "4.2632",
        "reviewCount": "38",
        "price": 149.99,
        "priceValidUntil": "6/21/2021"
    },
    "205887412": {
        "product_id": 205887412,
        "modelNbr": "DAR055D1BSSPRO",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Silhouette Professional 5.5 cu. ft. Outdoor Rated Mini Fridge in Stainless Steel, Silver",
        "Brand": "Silhouette",
        "ImageUrl": "https://images.homedepot-static.com/productImages/daf3f150-413a-4cc8-ae8c-fe256c801e3d/svn/stainless-steel-silhouette-mini-fridges-dar055d1bsspro-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Silhouette-Professional-5-5-cu-ft-Outdoor-Rated-Mini-Fridge-in-Stainless-Steel-DAR055D1BSSPRO/205887412",
        "Description": "This 5.5 cu. ft. sleek outdoor refrigerator makes the great outdoors even more refreshing. Smudge-resistant stainless steel and alarmed equipped. This unit is made for durability in exterior conditions and functionality in entertaining atmospheres.",
        "depth": "24.11",
        "height": "36.38",
        "width": "23.82",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1549,
        "priceValidUntil": "6/21/2021"
    },
    "306192312": {
        "product_id": 306192312,
        "modelNbr": "MCAR240SE2",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 2.4 cu. ft. Mini Fridge in Stainless Steel Freezerless, Silver",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/1329ca4d-5347-4ca3-8fd3-42a1241e6ae2/svn/stainless-steel-magic-chef-mini-fridges-mcar240se2-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-2-4-cu-ft-Mini-Fridge-in-Stainless-Steel-Freezerless-MCAR240SE2/306192312",
        "Description": "Store your favorite beverages and more with this Magic Chef's 2.4 cu. ft. compact refrigerator. It is designed without a freezer, giving you ample room for water, sports drinks, canned beverages, food and snacks. It features full-range temperature control so you can customize your cooling options. The ENERGY STAR-rated unit includes two durable wire food shelves to keep fresh foods organized, and it's perfect for offices and dorm rooms. Its smooth design facilitates easy installation. The flat, black exterior and reversible door complement a range of styles. The compact fridge comes with adjustable legs for stability on uneven surfaces. Color: Stainless Steel.",
        "depth": "17.7",
        "height": "24.9",
        "width": "18.5",
        "ratingValue": "4.071",
        "reviewCount": "155",
        "price": 143.3,
        "priceValidUntil": "6/21/2021"
    }
}