{
    "305026416": {
        "product_id": 305026416,
        "modelNbr": "HMAR170BE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 1.7 cu. ft. Freezerless Mini Fridge in Black",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/bf89e659-2baa-4880-8c1c-89a0464c706e/svn/black-magic-chef-mini-fridges-hmar170be-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-1-7-cu-ft-Freezerless-Mini-Fridge-in-Black-HMAR170BE/305026416",
        "Description": "Magic Chef's Energy Star rated 1.7 cu. ft. compact freezer-less refrigerator, in classic black provides ample storage for your favorite beverages such as water and sports drinks. Its All-refrigerator design provides desired usable capacity. The wire shelf helps keep your fresh foods organized, so you can quickly grab a late-night snack in your dorm room or find your lunch at the office. The compact 1.7 cu. ft. refrigerator with reversible door and flat back exterior fits well in multiple environments.",
        "depth": "18.9",
        "height": "19.5",
        "width": "17.3",
        "ratingValue": "4.5594",
        "reviewCount": "960",
        "price": 89,
        "priceValidUntil": "7/3/2021"
    },
    "206943561": {
        "product_id": 206943561,
        "modelNbr": "GME04GGKBB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "4.4 cu. ft. Mini Refrigerator in Black",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/647e6bbd-928c-4a87-9c60-a5fc10612d46/svn/black-ge-mini-fridges-gme04ggkbb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-4-4-cu-ft-Mini-Refrigerator-in-Black-GME04GGKBB/206943561",
        "Description": "Your GE 4.4 cu. ft. Mini Refrigerator has an in-the-door can rack for easy use. Freezer features include a mini ice tray and a chiller feature along with a defrost pan. Rounded doors with recessed handles gives you that clean modern look. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical. Color: Black.",
        "depth": "21.25",
        "height": "34.125",
        "width": "19.75",
        "ratingValue": "4.3375",
        "reviewCount": "80",
        "price": 268,
        "priceValidUntil": "07/14/2021"
    },
    "311920196": {
        "product_id": 311920196,
        "modelNbr": "DAR044A4WDD-6",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Danby 4.4 cu. ft. Mini Refrigerator in White without Freezer",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/04c2134c-9191-4542-9b78-c1783bfbae03/svn/white-danby-mini-fridges-dar044a4wdd-6-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-4-4-cu-ft-Mini-Refrigerator-in-White-without-Freezer-DAR044A4WDD-6/311920196",
        "Description": "Standing just under 33 in. tall, this 4.4 cu. ft. Mini Refrigerator from Danby slides under most standard countertops to give you extra cold storage. Whether its a game room, office, workshop, kitchen or any space that could use an extra chilling machine, this freezer-less unit is an affordable option for keeping ice-cold beverages and food close at hand. Coldness is controlled with the adjustable thermostat, which even on its lowest setting efficiently regulates this compact white fridge, earning ENERGY STAR distinction for its modest use of electricity. A CanStor beverage dispenser inside the reversible door keeps 12 oz. refreshments at-the-ready, while space for tall bottles also exists for larger containers. Adjustable-height shelves supply an abundance of storage options inside the unit, which comes with a generous 18-month warranty on parts and labor with in-home service.",
        "depth": "20.87",
        "height": "33.22",
        "width": "20.71",
        "ratingValue": "4.2115",
        "reviewCount": "208",
        "price": 225.6,
        "priceValidUntil": "7/3/2021"
    },
    "307781453": {
        "product_id": 307781453,
        "modelNbr": "GLR46TBKER",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Galanz 4.6 cu. ft. Retro Mini Fridge with Dual Door True Freezer in Black",
        "Brand": "Galanz",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5dc416dc-bf52-4c1d-9375-378492ec7581/svn/black-galanz-mini-fridges-glr46tbker-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Galanz-4-6-cu-ft-Retro-Mini-Fridge-with-Dual-Door-True-Freezer-in-Black-GLR46TBKER/307781453",
        "Description": "Galanz 4.6 cu. ft. Retro style top freezer refrigerator can store and keep cool snacks, beverages and more. Best of all, this refrigerator-freezer has the look and feel of the fabulous old days, but has the appeal of a modern appliance. Featuring an adjustable thermostat, separate freezer compartment, bright interior lighting and spacious, clear fruit and vegetable crisper, the unit also has removable shelves and door shelves. It is a fun and stylish addition to any kitchen, rec room or home office!. Color: Black.",
        "depth": "21.75",
        "height": "50",
        "width": "19.17",
        "ratingValue": "4.4369",
        "reviewCount": "103",
        "price": 334.99,
        "priceValidUntil": "7/3/2021"
    },
    "311459236": {
        "product_id": 311459236,
        "modelNbr": "I10L2W",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "COOLULI Infinity 0.35 cu. ft. Retro Mini Fridge in White without Freezer",
        "Brand": "Cooluli",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0f8d0c86-be49-495a-9192-22c1147b1a74/svn/white-cooluli-mini-fridges-i10l2w-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/COOLULI-Infinity-0-35-cu-ft-Retro-Mini-Fridge-in-White-without-Freezer-I10L2W/311459236",
        "Description": "The Infinity-10L Cooler/Warmer Mini Fridge by COOLULI boasts efficiency and durability in one stylish compact unit. The all-purpose, thermo-electric Infinity goes from cooling to warming with one quick switch. The Infinity is perfect anywhere you need to store food, snacks, drinks, breast milk, insulin, skincare, personal care and beauty products, and medications. Its compact design features a 10-liter capacity, tempered glass front, and the molded foldaway top handle makes transport a breeze. Use it everywhere the Infinity's stylish construction matches any decor, making it the perfect addition to your home, countertop, business/office, dorm, hotel room, car/motor vehicle, or on your next road trip or tailgate. Exclusive EcoMax Technology features COOLULI's unique cooling system it's ultra-powerful yet incredibly quiet and efficient. The Infinity is 100% environmentally friendly and uses no refrigerants or Freons. Cools down to: 30° to 35° below ambient temperature Warms up to: 149° on internal thermostat. All COOLULI products are backed by a one-year limited warranty and COOLULI's unparalleled customer service. Color: White.",
        "depth": "11.4",
        "height": "3",
        "width": "9.4",
        "ratingValue": "4.5312",
        "reviewCount": "32",
        "price": 79.99,
        "priceValidUntil": "7/3/2021"
    },
    "206943543": {
        "product_id": 206943543,
        "modelNbr": "GDE03GGKBB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "3.1 cu. ft. Double-Door Mini Fridge in Black",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e24a4d42-51b7-4973-aeba-c0af181371f0/svn/black-ge-mini-fridges-gde03ggkbb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-3-1-cu-ft-Double-Door-Mini-Fridge-in-Black-GDE03GGKBB/206943543",
        "Description": "Your GE 3.1 cu. ft. ENERGY STAR double-door Mini Refrigerator offers plenty of storage space for frozen and fresh foods in separate compartments. Glass shelves make for a contemporary look and easy cleaning. Multiple storage places such as door shelves, can rack and clear crisper drawer makes room for a wide variety of foods and beverages. Rounded doors with recessed handles gives you that clean modern look. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical. Color: Black.",
        "depth": "19.5",
        "height": "33.375",
        "width": "18.75",
        "ratingValue": "4.5625",
        "reviewCount": "96",
        "price": 278,
        "priceValidUntil": "07/14/2021"
    },
    "307790894": {
        "product_id": 307790894,
        "modelNbr": "GLR76TBKER",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Galanz 7.6 cu.ft. Retro Mini Refrigerator with Dual Door and True Freezer in Black",
        "Brand": "Galanz",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e247366e-ed74-40a5-85c5-eb652b37681e/svn/black-galanz-mini-fridges-glr76tbker-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Galanz-7-6-cu-ft-Retro-Mini-Refrigerator-with-Dual-Door-and-True-Freezer-in-Black-GLR76TBKER/307790894",
        "Description": "Adjustable mechanical thermostat control. Color: Black.",
        "depth": "21.75",
        "height": "58",
        "width": "21.73",
        "ratingValue": "4.4921",
        "reviewCount": "2351",
        "price": 387.99,
        "priceValidUntil": "7/3/2021"
    },
    "205429696": {
        "product_id": 205429696,
        "modelNbr": "HMDR310SE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 3.1 cu. ft. Mini Fridge in Stainless Look",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d7610faf-7c10-4b4b-8ac2-53b38fd89009/svn/stainless-look-magic-chef-mini-fridges-hmdr310se-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-3-1-cu-ft-Mini-Fridge-in-Stainless-Look-HMDR310SE/205429696",
        "Description": "Whether you're college-bound or simply want a little extra refrigerator space in your home, this Magic Chef 3.1 cu. ft. Mini Refrigerator has the storage options you're looking for. A can dispenser conveniently keeps soda in the door while additional door shelves provide space for frequently used items. Glass refrigerator shelves are easy to clean. Color: Stainless look.",
        "depth": "20.3",
        "height": "33.5",
        "width": "18.7",
        "ratingValue": "4.4952",
        "reviewCount": "1153",
        "price": 179,
        "priceValidUntil": "7/3/2021"
    },
    "315257942": {
        "product_id": 315257942,
        "modelNbr": "ALR47B",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 20 in. 3.53 cu. ft. Mini Refrigerator in Black without Freezer, ADA Compliant",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4c5af335-913f-4ba0-a37f-2e49baf74868/svn/black-summit-appliance-mini-fridges-alr47b-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-20-in-3-53-cu-ft-Mini-Refrigerator-in-Black-without-Freezer-ADA-Compliant-ALR47B/315257942",
        "Description": "The ALR47B is sized at 32 in. high to fit under lower counters complying with ADA guidelines for accessibility. The fully finished textured black cabinet allows freestanding use, while the front-breathing system means this unit can be built-in with minimum clearance. The user-reversible door is 3 in. thick for efficient insulation, with a handle included for added convenience. This unit comes with a right angle cord to allow for easier placement without added depth. A digital thermostat, located in the kickplate, makes for easy temperature management with a readout in Fahrenheit or Celsius. Inside, the ALR47B features an all-white interior for easy cleaning and viewing of contents. An LED light located toward the front of the unit attractively illuminates the interior when the door opens. Automatic defrost operation ensures minimal user maintenance, with an internal fan to help ensure even cooling throughout the 3.53 cu. ft. interior. Three adjustable glass shelves offer optimal storage options for large and small items, while a pull-out crisper drawer provides storage for fruits and vegetables. Three removable door racks accommodate additional storage as needed. The user-set high and low-temperature alarms provide added security should the temperature go beyond the setpoint, while the open door alarm sounds if the door is ajar over one minute for added peace-of-mind. These alarms can be disabled depending on your needs.",
        "depth": "22.5 in",
        "height": "32",
        "width": "19.75 in",
        "ratingValue": "4.0",
        "reviewCount": "2",
        "price": 760,
        "priceValidUntil": "7/3/2021"
    },
    "308654097": {
        "product_id": 308654097,
        "modelNbr": "EFR840-RED-COM",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Frigidaire 3.2 cu. ft. 2 Door Retro Mini Fridge in Red",
        "Brand": "Frigidaire",
        "ImageUrl": "https://images.homedepot-static.com/productImages/69ce7658-6046-4404-ab5a-15ff184ff2db/svn/red-frigidaire-mini-fridges-efr840-red-com-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Frigidaire-3-2-cu-ft-2-Door-Retro-Mini-Fridge-in-Red-EFR840-RED-COM/308654097",
        "Description": "This 3.2 cu. ft. retro mini refrigerator will definitely make a statement with its timeless design and modern functionality. It is roomy enough to fit all of your favorite beverages, frozen and fresh snacks yet compact enough to fit virtually anywhere. It is the perfect size for your she shed, man cave, dorm room, workshop or office. Color: Red.",
        "depth": "19.4",
        "height": "33.1",
        "width": "18.9",
        "ratingValue": "4.2717",
        "reviewCount": "173",
        "price": 239.99,
        "priceValidUntil": "7/3/2021"
    },
    "311459057": {
        "product_id": 311459057,
        "modelNbr": "CL4LBK",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "COOLULI Classic 0.14 cu. ft. Retro Mini Fridge in Black without Freezer",
        "Brand": "Cooluli",
        "ImageUrl": "https://images.homedepot-static.com/productImages/11ec03ac-3621-4ee5-a2a3-a52a556ac916/svn/black-cooluli-mini-fridges-cl4lbk-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/COOLULI-Classic-0-14-cu-ft-Retro-Mini-Fridge-in-Black-without-Freezer-CL4LBK/311459057",
        "Description": "The COOLULI Classic 4-liter Thermo-Electric Cooler/Warmer Mini Fridge is durable, efficient and stylishly compact. The Classic is easy to use and goes from cooling to warming with one quick switch. It's perfect anywhere you need to store food, snacks, drinks, breast milk, insulin, skincare and beauty products, medications and other essentials. The Classics lightweight profile has a 4-liter capacity and a molded inset top handle, making it a breeze to carry. The Classic-4L mini refrigerator is perfect in your home, countertop, business/office, dorm, hotel room, car/motor vehicle, or on your next road trip or tailgate party. Along with the AC/DC power cords, your Classic-4L also includes a USB cord for the ultimate flexibility it can be powered with a minimum 2 Amp power bank (USB power bank not included). You can also easily shift from cooling mode to warming mode with a simple flip of a switch. Exclusive EcoMax Technology features COOLULI's unique cooling system, making it powerful yet incredibly quiet and cost-effective. The Classic-4L is 100% environmentally friendly and uses no refrigerants or Freons. The Classic 4L is built to North American voltage specifications. Warranty is void if unit is plugged into a 220-Volt to 230-Volt outlet. Please refer to User Manual before use. Cools down to: 35°F to 40°F (20°C to 22°C) below ambient temperature Warms up to: 149°F (65°C) on internal thermostat. Color: Black.",
        "depth": "10.25",
        "height": "3",
        "width": "7.25",
        "ratingValue": "4.5957",
        "reviewCount": "94",
        "price": 49.99,
        "priceValidUntil": "7/3/2021"
    },
    "305971707": {
        "product_id": 305971707,
        "modelNbr": "HMCR320WE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef Retro 3.2 Cu. Ft. 2 Door Mini Fridge in White",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/1f90f66b-c787-426b-bc51-2886b7593d1c/svn/white-magic-chef-mini-fridges-hmcr320we-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-Retro-3-2-Cu-Ft-2-Door-Mini-Fridge-in-White-HMCR320WE/305971707",
        "Description": "Classic yet contemporary, the Magic Chef retro-style 2 door compact refrigerator will make its statement in your home, office, or dorm room. Its 3.2 cu. ft. total capacity allows you to store plenty of your favorite beverages and frozen snacks. The glass shelves are adjustable for easy organization and clean-up. The crisper drawer provides storage for fruits or vegetables. Can holder on the door lets you grab your beverages easily. Color: White.",
        "depth": "19.9",
        "height": "33.5",
        "width": "19.1",
        "ratingValue": "4.5049",
        "reviewCount": "1127",
        "price": 179.99,
        "priceValidUntil": "07/07/2021"
    },
    "203532988": {
        "product_id": 203532988,
        "modelNbr": "HMBR265BE1",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 2.6 cu. ft. Mini Fridge in Black, ENERGY STAR",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4473bd0c-6bbe-456e-a46b-41fe03d6d76e/svn/black-magic-chef-mini-fridges-hmbr265be1-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-2-6-cu-ft-Mini-Fridge-in-Black-ENERGY-STAR-HMBR265BE1/203532988",
        "Description": "Whether you're college-bound or simply want a little extra refrigerator space in your home, this Magic Chef 2.6 cu. ft. Mini Refrigerator has the storage options you're looking for. A can dispenser conveniently keeps soda in the door while additional door shelves provide space for frequently used items. Glass refrigerator shelves are easy to clean. Color: Black.",
        "depth": "19.3",
        "height": "25",
        "width": "17.5",
        "ratingValue": "4.4217",
        "reviewCount": "1169",
        "price": 129,
        "priceValidUntil": "7/3/2021"
    },
    "304812028": {
        "product_id": 304812028,
        "modelNbr": "HME03GGMBB",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Hotpoint 2.7 cu. ft. Mini Fridge in Black",
        "Brand": "Hotpoint",
        "ImageUrl": "https://images.homedepot-static.com/productImages/34458c6b-1b91-403f-b6e8-13526cb130a8/svn/black-hotpoint-mini-fridges-hme03ggmbb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hotpoint-2-7-cu-ft-Mini-Fridge-in-Black-HME03GGMBB/304812028",
        "Description": "Your Hotpoint 2.7 cu. ft. Mini Refrigerator has 2-liter bottle storage in the door to easily store tall bottles. Easy adjustable thermostat ensures accurate storage temperatures. Rounded doors with recessed handles gives you that clean modern look. Color: Black.",
        "depth": "17.75",
        "height": "27.875",
        "width": "19",
        "ratingValue": "4.5714",
        "reviewCount": "35",
        "price": 178,
        "priceValidUntil": "07/14/2021"
    },
    "313653304": {
        "product_id": 313653304,
        "modelNbr": "FF63BKBI",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 24 in. W 5.5 cu. ft. Mini Refrigerator in Black without Freezer",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/fd27badc-6aa1-4cd0-ba46-a1f563f15c08/svn/black-summit-appliance-mini-fridges-ff63bkbi-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-24-in-W-5-5-cu-ft-Mini-Refrigerator-in-Black-without-Freezer-FF63BKBI/313653304",
        "Description": "Summit offers the industry's largest selection of built-in undercounter refrigeration, with a range of choices to best suit any kitchen. The FF63BKBI Series includes European made all-refrigerators designed for built-in installation in residential settings. Sized with a 24 in. footprint, the FF63BKBI is front-breathing for built-in use. The fully finished cabinet also allows freestanding use for added versatility. This model has a black exterior finish. The reversible door includes a professional style handle in stainless steel. The FF63BKBI refrigerator utilizes automatic defrost operation to ensure minimum user maintenance. The 5.5 cu. ft. interior offers more storage space than most models in this size class. Adjustable glass shelves ensure spill-proof storage, while a large crisper drawer is ideal for keeping produce at its best. A removable wine shelf lets you keep bottles securely in place. The door includes three storage racks for condiments and tall bottles. The seamless interior also features a dial thermostat and automatic light. Designed and constructed in Europe, the FF63BKBI refrigerator offers reliable cold storage for any home looking to install a quality all-refrigerator under the counter.",
        "depth": "23",
        "height": "32.63",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 1060,
        "priceValidUntil": "7/3/2021"
    },
    "311459430": {
        "product_id": 311459430,
        "modelNbr": "I15L2BK",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "COOLULI Infinity 0.53 cu. ft. Retro Mini Fridge in Black without Freezer",
        "Brand": "Cooluli",
        "ImageUrl": "https://images.homedepot-static.com/productImages/45197f81-8303-4a44-91b6-18e20538e3ec/svn/black-cooluli-mini-fridges-i15l2bk-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/COOLULI-Infinity-0-53-cu-ft-Retro-Mini-Fridge-in-Black-without-Freezer-I15L2BK/311459430",
        "Description": "The Infinity-15L Thermo-Electric Cooler/Warmer Mini Fridge by COOLULI boasts efficiency and durability in one stylish, compact unit. The all-purpose, thermo-electric Infinity goes from cooling to warming with one quick switch. The Infinity is perfect anywhere you need to store food, snacks, drinks, breast milk, insulin, skincare and beauty products, and medications. Its compact design features a roomy 15-liter capacity, tempered glass front, and the molded foldaway top handle makes transporting the Infinity a breeze. Use it everywhere the Infinity's sleek construction matches any decor, making it the perfect addition to your home, countertop, business/office, dorm, hotel room, car/motor vehicle, or on your next road trip or tailgate. Exclusive EcoMax Technology features COOLULI's unique cooling system it's ultra-powerful yet incredibly quiet and efficient. The Infinity is 100% environmentally friendly and uses no refrigerants or Freons. Cools down to: 30° to 35° below ambient temperature Warms up to:149° on internal thermostat. All COOLULI products are backed by a one-year limited warranty and COOLULI's unparalleled customer service. Color: Black.",
        "depth": "13.75",
        "height": "2.5",
        "width": "11.25",
        "ratingValue": "3.9286",
        "reviewCount": "14",
        "price": 99.99,
        "priceValidUntil": "7/3/2021"
    },
    "313240434": {
        "product_id": 313240434,
        "modelNbr": "CT663BKADA",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 5.1 cu. ft. Mini Refrigerator with Freezer in Black, ADA Compliant",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/5de9fed7-68f5-457c-be47-70fa24c05824/svn/black-summit-appliance-mini-fridges-ct663bkada-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-5-1-cu-ft-Mini-Refrigerator-with-Freezer-in-Black-ADA-Compliant-CT663BKADA/313240434",
        "Description": "Summit brings quality and value to counter height refrigeration with the industry's largest selection of 32 in. high appliances. The CT663BKADA Series features residential refrigerator-freezers made in Europe and designed for freestanding use in any ADA compliant setting. Sized with a 24 in. footprint, the CT663BKADA refrigerator-freezer offer a generous 5.1 cu. ft. storage capacity, larger than many units in this size class. The 32 in. H allows use in settings complying with ADA guidelines for lower counter height. This unit is designed for freestanding use. It comes in a black exterior finish. The reversible door includes a stainless steel handle. Inside, the CT663BKADA features a dual evaporator to allow separated cooling of the fresh and frozen food sections. The refrigerated compartment utilizes low maintenance automatic defrost, while the interior freezer compartment is manual defrost to achieve lower storage temperatures ideal for ice cream and other frozen food. The deluxe interior includes adjustable glass shelves for spill-proof storage and easier cleaning, as well as a scalloped wine shelf to hold wine and champagne bottles safely in place. Door racks offer additional convenience for tall bottles and condiments and a clear crisper drawer ensures your produce is stored under the ideal conditions.",
        "depth": "23",
        "height": "32.63",
        "width": "23.63",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 819,
        "priceValidUntil": "7/3/2021"
    },
    "311459473": {
        "product_id": 311459473,
        "modelNbr": "C20LDXW",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "COOLULI Concord 0.7 cu. ft. Retro Mini Fridge in White without Freezer",
        "Brand": "Cooluli",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3e48196b-5ffb-4748-88b9-cfa331b18032/svn/white-cooluli-mini-fridges-c20ldxw-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/COOLULI-Concord-0-7-cu-ft-Retro-Mini-Fridge-in-White-without-Freezer-C20LDXW/311459473",
        "Description": "The Concord-20LDX Thermo-Electric Cooler/Warmer Mini Fridge by COOLULI is the epitome of efficiency and style. Easily switch from cooling to warming with the touch of a button the Concords digital thermostat and easy-to-read display allows you to set your desired temperature for the ultimate in climate control. Once desired temperature is reached, your Concord goes into ECO mode, using just about half the power saving you energy (and money). The Concord is perfect anywhere you need to store wine, food, beer, snacks, drinks, breast milk, insulin, skincare, personal care, and beauty products, medicine and other essentials at a specific temperature. Its modern design features a compact yet spacious, 20-liter capacity and a tempered glass front. A molded inset carry handle on each side makes transport easy and convenient. Use it everywhere the Concords sleek, stylish construction matches any decor; it's the perfect addition to your home, countertop, business/office, dorm, hotel room, car/motor vehicle, or on your next road trip or tailgate party. Exclusive EcoMax Technology features COOLULI's unique cooling system, utilizing an advanced dual-core design; its ultra-powerful yet incredibly quiet and efficient. The Concord is 100% environmentally friendly and uses no refrigerants or Freons. Cools down to: 40° below ambient temperature. Warms up to: 149° on internal thermostat. All COOLULI products are backed by a one-year limited warranty and COOLULI's unparalleled customer service. Color: White.",
        "depth": "13.75",
        "height": "4",
        "width": "11.25",
        "ratingValue": "4.2222",
        "reviewCount": "18",
        "price": 149.99,
        "priceValidUntil": "7/3/2021"
    },
    "206792799": {
        "product_id": 206792799,
        "modelNbr": "FF1843BIF",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 18 in. 3 cu. ft. Mini Fridge with Panel-Ready Door, Black cabinet/stainless steel door frame for custom panels",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/79a646fd-b73e-4b37-9834-9836d0bf764b/svn/black-cabinet-stainless-steel-door-frame-for-custom-panels-summit-appliance-mini-fridges-ff1843bif-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-18-in-3-cu-ft-Mini-Fridge-with-Panel-Ready-Door-FF1843BIF/206792799",
        "Description": "SUMMIT's selection of built-in undercounter refrigeration includes one of the industry's only complete 18 in. wide lines for use in the home. Sized just under 18 in. wide, the FF1843BIF is the perfect all-refrigerator for space-challenged kitchens. It comes with a black cabinet. The door features an integrated stainless steel door frame designed to accept full overlay panels for a custom look. This unit can be used built-in or freestanding. Users provide their own handle. Inside, the FF1843BIF utilizes automatic defrost operation for low maintenance use. 4 adjustable chrome shelves accommodate a variety of sizes and LED lighting offers an efficient interior view. This unit includes a digital thermostat for optimum temperature management. Color: Black cabinet/stainless steel door frame for custom panels.",
        "depth": "24",
        "height": "34.25",
        "width": "17.75",
        "ratingValue": "1.0",
        "reviewCount": "1",
        "price": 1030.43,
        "priceValidUntil": "7/3/2021"
    },
    "311962332": {
        "product_id": 311962332,
        "modelNbr": "RF6RRBK",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Nostalgia 0.2 cu. ft. Mini Personal Fridge in Black without Freezer",
        "Brand": "Nostalgia",
        "ImageUrl": "https://images.homedepot-static.com/productImages/85ce4439-6bc8-403b-a836-3e95f7abbe43/svn/black-nostalgia-mini-fridges-rf6rrbk-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Nostalgia-0-2-cu-ft-Mini-Personal-Fridge-in-Black-without-Freezer-RF6RRBK/311962332",
        "Description": "Whether warm or cold, this personal refrigerator keeps beverages and foods at the temperature you need. Flip the switch to cool to keep cold up to six 12 oz. cans at a time, or flip the switch to warm to keep your lunch hot. Equipped with thermoelectric technology, this refrigerator also includes power cords for both AC and DC outlets, so it works in your kitchen, car, boat, dorm room and more. Retro details, like a see-through window and chrome door latch, give this unit a cool blast of 50's style wherever it's needed. Best of all, the dry erase refrigerator door is perfect for writing notes, reminders and doodles. Color: Black.",
        "depth": "16",
        "height": "6",
        "width": "7.09",
        "ratingValue": "3.2",
        "reviewCount": "5",
        "price": 42.98,
        "priceValidUntil": "7/3/2021"
    },
    "305506876": {
        "product_id": 305506876,
        "modelNbr": "DFG17A1B",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Danby 1.7 cu. ft. Herb Grower with 16-Watt LED Bloom Boss Lighting, Black",
        "Brand": "Danby",
        "ImageUrl": "https://images.homedepot-static.com/productImages/afe38f28-cd96-4f8c-b69d-f79121868c36/svn/black-danby-mini-fridges-dfg17a1b-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Danby-1-7-cu-ft-Herb-Grower-with-16-Watt-LED-Bloom-Boss-Lighting-DFG17A1B/305506876",
        "Description": "Bring your garden inside this winter with Danby Fresh. Grow fresh herbs, vegetables, fruits and flowers all-year round in a turnkey product that is easy to use and maintain. Designed to fit your decor, Danby Fresh comes in a black-steel finish resembling most contemporary wine refrigerators and beverage centres. You'll know exactly where your food comes from and how it was grown so you can rest assured you'll be serving your family healthy, fresh, organic greens every time. Danby Fresh also takes the guesswork out of gardening by delivering the correct amount of humidity, light, temperature and fresh air circulation at the flick of a switch. And fitted with the industry's most efficient LED grow lights, powered by BloomBoss, you won't have to worry about high energy bills. Available in 1.7 cu. ft. and 2.6 cu. ft.",
        "depth": "18.94",
        "height": "20.25",
        "width": "17.5",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 263.94,
        "priceValidUntil": "7/3/2021"
    },
    "305026420": {
        "product_id": 305026420,
        "modelNbr": "HMR440BE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 4.4 cu. ft. Mini Fridge in Black",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/8c74c487-b85b-4799-a278-5c92a2999407/svn/black-magic-chef-mini-fridges-hmr440be-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-4-4-cu-ft-Mini-Fridge-in-Black-HMR440BE/305026420",
        "Description": "Whether you're college-bound or simply want a little extra refrigerator space in your home, or office this Magic Chef 4.4 cu. ft. Mini Refrigerator has the storage options you're looking for. A can dispenser /rack conveniently houses beverages in the door while door shelves provide extra space for other frequently craved refreshments. Glass refrigerator shelves are easy to clean and allow visibility to all corners of the unit. A full-width interior mini freezer/chiller allows you to keep already frozen and soft frozen treats in stock. Color: Black.",
        "depth": "22.7",
        "height": "32.9",
        "width": "19.1",
        "ratingValue": "4.4648",
        "reviewCount": "2089",
        "price": 179,
        "priceValidUntil": "7/3/2021"
    },
    "310499293": {
        "product_id": 310499293,
        "modelNbr": "MCAR320PSE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 3.2 cu. ft. Mini Fridge without Freezer in Platinum Steel",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c0d123e0-b258-4029-9d49-b31a9e427a65/svn/platinum-steel-magic-chef-mini-fridges-mcar320pse-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-3-2-cu-ft-Mini-Fridge-without-Freezer-in-Platinum-Steel-MCAR320PSE/310499293",
        "Description": "The Magic Chef 3.2 cu. ft. mini refrigerator without the interior freezer has the storage options you're looking for whether you're college-bound or simply want a little extra refrigerator space in your home, or office. It offers plenty of additional refrigerator fresh food space for storing your favorite beverages and cold snacks, more usable capacity without the freezer. Removable glass shelves in the refrigerator help you keep food items organized. Its door storage options, including a can dispenser help you save space and keep frequently used beverages and snacks accessible. The door is reversible for easy placement options. Color: Platinum Steel.",
        "depth": "17.5",
        "height": "33.4",
        "width": "18.7",
        "ratingValue": "4.5455",
        "reviewCount": "231",
        "price": 189.68,
        "priceValidUntil": "7/3/2021"
    },
    "305026419": {
        "product_id": 305026419,
        "modelNbr": "HMR330WE",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Magic Chef 3.3 cu. ft. Mini Fridge in White",
        "Brand": "Magic Chef",
        "ImageUrl": "https://images.homedepot-static.com/productImages/ddac5bc9-bd91-4c3b-9417-ccbabc8b08aa/svn/white-magic-chef-mini-fridges-hmr330we-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Magic-Chef-3-3-cu-ft-Mini-Fridge-in-White-HMR330WE/305026419",
        "Description": "Whether you're college-bound or simply want a little extra refrigerator space in your home or office, the Magic Chef 3.3 cu. ft. Mini Refrigerator has the storage options you're looking for. The sleek appearance is matched by its well-designed interior, which includes a can rack to conveniently keep beverage cans in the door. Additional door shelves provide space for other frequently used items. Its three glass shelves are easy to clean. ENERGY STAR qualified design helps save on energy costs without sacrificing performance. Color: White.",
        "depth": "17.7",
        "height": "32.9",
        "width": "19.1",
        "ratingValue": "4.3979",
        "reviewCount": "2639",
        "price": 149,
        "priceValidUntil": "7/3/2021"
    },
    "313267167": {
        "product_id": 313267167,
        "modelNbr": "CZ04",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Coca-Cola 0.14 cu. ft. Zero Portable Mini Fridge in Black without Freezer",
        "Brand": "Coca-Cola",
        "ImageUrl": "https://images.homedepot-static.com/productImages/ea82b23e-ab21-40f2-8463-aeca1213aa23/svn/black-coca-cola-mini-fridges-cz04-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Coca-Cola-0-14-cu-ft-Zero-Portable-Mini-Fridge-in-Black-without-Freezer-CZ04/313267167",
        "Description": "This sleek black mini fridge features the modern Coca-Cola® Zero™ logo. Debuted in 2005, Coke Zero™ is one of the most advertised beverages of the last 20 years, making this portable mini fridge a must-have for fans and collectors.",
        "depth": "7.25",
        "height": "10.5",
        "width": "9.25",
        "ratingValue": "4.5",
        "reviewCount": "4",
        "price": 59.95,
        "priceValidUntil": "7/3/2021"
    },
    "313781229": {
        "product_id": 313781229,
        "modelNbr": "KRT04-B",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "COMPACT REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Koolatron 0.14 cu. ft. Retro Portable Mini Fridge Cooler in Black without Freezer",
        "Brand": "Koolatron",
        "ImageUrl": "https://images.homedepot-static.com/productImages/cc2f60be-6f1a-4749-8de2-4a949a02566b/svn/black-koolatron-mini-fridges-krt04-b-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Koolatron-0-14-cu-ft-Retro-Portable-Mini-Fridge-Cooler-in-Black-without-Freezer-KRT04-B/313781229",
        "Description": "This lightweight 4 L/2.3 quart compact mini fridge is the ideal personal cooler. Efficient, reliable thermoelectric cooling technology with no CFCs makes this the perfect desktop accessory for your home, office, or dorm room. It is 110 volt DC and 12 volt AC capable so you can plug it into any standard household outlet or use it in your car, boat or RV. Color: Black.",
        "depth": "6.8 in",
        "height": "10",
        "width": "7 in",
        "ratingValue": "4.0",
        "reviewCount": "5",
        "price": 42.87,
        "priceValidUntil": "7/3/2021"
    }
}