{
    "304766315": {
        "product_id": 304766315,
        "modelNbr": "FFRF3070BIF",
        "Category": "APPLIANCES",
        "ApplType": "REFRIGERATION",
        "Type1": "PREM INST REFRIGERATOR",
        "Type2": "OTHER",
        "Title": "Summit Appliance 30 in. 5.4 cu. ft. Built-In Side by Side Refrigerator in Black, Counter Depth, Black/ Panel-Ready",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/860f4e29-5ad3-4fa7-be9f-c5d8c12ea26a/svn/black-panel-ready-summit-appliance-side-by-side-refrigerators-ffrf3070bif-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-30-in-5-4-cu-ft-Built-In-Side-by-Side-Refrigerator-in-Black-Counter-Depth-FFRF3070BIF/304766315",
        "Description": "Sized at 30\" wide, the FFRF3070BIF is an all-in-one side-by-side refrigerator-freezer. The front breathing design allows built-in installation under counters, while the fully finished black cabinet also enables freestanding use. The French swing doors feature an integrated stainless steel frame that lets users install their own overlay panels for a custom look (panel size: 30\" H x 14 5/8\" W). Users install their own handles. The sealed back ensures easier cleanup with added space savings. Inside, the FFRF3070BIF features a 2.4 cu.ft. frost-free freezer compartment on the left and a 3 cu.ft. frost-free refrigerator compartment on the right. The refrigerator includes a digital thermostat that can be readable in Celsius or Fahrenheit. Adjustable glass shelves offer cleaner spill-proof storage for fresh food items, while fixed door shelves are perfect for condiments and tall bottles. The freezer compartment includes adjustable wire shelves to ensure proper cold air circulation. Both sides feature LED lighting to provide an attractive, energy efficient presentation, as well as internal fans. The slotted floor design is ideal for keeping bottles safely in place. Additional features include an open door alarm, high temperature alarm, and Sabbath mode setting that allows you to disable certain functions during religious observance. Color: Black/ Panel-Ready.",
        "depth": "24.13",
        "height": "34",
        "width": "29.5",
        "ratingValue": "1.0",
        "reviewCount": "1",
        "price": 1931.33,
        "priceValidUntil": "7/3/2021"
    }
}