{
    "308088720": {
        "product_id": 308088720,
        "modelNbr": "WFW9620HC",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "FL WASHERS W/OUT HOSES",
        "Type2": "OTHER",
        "Title": "Whirlpool 5.0 cu. ft. High Efficiency Smart Chrome Shadow Stackable Front Load Washing Machine with Load and Go XL Plus Dispenser",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/ba4ae329-9bb4-43be-a827-e1d18ecdbfb5/svn/chrome-shadow-whirlpool-front-load-washers-wfw9620hc-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-0-cu-ft-High-Efficiency-Smart-Chrome-Shadow-Stackable-Front-Load-Washing-Machine-with-Load-and-Go-XL-Plus-Dispenser-WFW9620HC/308088720",
        "Description": "Stay in control and connected from anywhere with a smart front load washer and the Whirlpool® app. Fill the Load & Go™ XL Plus dispenser with detergent and fabric softener once every 40 loads and get notifications when you're running low. And when you need help removing everyday stains, use the front load washing machine’s SteamClean option. Color: Chrome Shadow.",
        "depth": "56.5",
        "height": "0",
        "width": "0",
        "ratingValue": "4.4103",
        "reviewCount": "78",
        "price": 1394,
        "priceValidUntil": "07/14/2021"
    },
    "314754195": {
        "product_id": 314754195,
        "modelNbr": "WKGX201HWA",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "WASHTOWER GAS",
        "Type2": "OTHER",
        "Title": "LG Electronics 27 in. White WashTower Laundry Center with 4.5 cu. ft. Washer and 7.4 cu. ft. Gas Dryer",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/69026f51-7f62-4667-b246-39b3b89cdfa7/svn/white-lg-electronics-electric-dryers-wkgx201hwa-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-27-in-White-WashTower-Laundry-Center-with-4-5-cu-ft-Washer-and-7-4-cu-ft-Gas-Dryer-WKGX201HWA/314754195",
        "Description": "Full-size and fully featured, with the washer on the bottom and dryer on top, the sleek single unit LG WashTower takes up half the space, giving you room to add a sink, a folding table or whatever you like. But unlike conventional stacked pairs, LG's exclusive Center Control panel is perfectly positioned with both washer and dryer controls at just the right height. Built-in intelligence makes laundry less of a chore by taking out the guesswork, while top-of-the-line innovations put advanced cleaning power within reach. Color: White.",
        "depth": "55",
        "height": "16.06",
        "width": "16.06",
        "ratingValue": "4.629",
        "reviewCount": "752",
        "price": 1798,
        "priceValidUntil": "07/14/2021"
    },
    "307665203": {
        "product_id": 307665203,
        "modelNbr": "DC 4400 N / B",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "COMBO WASHER/DRYER ELECT",
        "Type2": "OTHER",
        "Title": "DECO 1.57 cu. ft. Black High -Efficiency Vented / Ventless Electric All-in-One Washer Dryer Combo",
        "Brand": "DECO",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c59eb07c-2645-4ed4-a9cd-8b8f662d5455/svn/black-deco-front-load-washers-dc-4400-n-b-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/DECO-1-57-cu-ft-Black-High-Efficiency-Vented-Ventless-Electric-All-in-One-Washer-Dryer-Combo-DC-4400-N-B/307665203",
        "Description": "This Super Combo Washer-Dryer 4400CV offers you the future of environmental sustainability wrapped in smart, minimalist style. Innovative and chic, the 4400CV has won the TechBrilliance, Twice VIP Award and the Global Innovation Award (GIA). It is the slimmest model available in North America, making it perfect for tight spaces. With a load capacity of 13 lbs., and a size of only 33.5 in. H x 23.5 in. W x 22 in. D, it coordinates well into any home design and is available in white, black or merlot. It features an automatic water level sensor, delay start time, one-button convertible venting/condensing options, a sensor dry feature, a wrinkle guard, and even an optional booster fan. Its 14 programmable wash/dry functions allow you to protect any fabric type, plus it offers Wash Only/Dry Only options. With the spectacular attention to detail, it has an LED display, an angled 45 door handle reducing back strain and pain associated with bending and a child lock. The 4400CV holds 15 patents, and meets the strict energy standards of 2018, ensuring competitive energy efficiency for-years to come. This Super Combo brings exciting ingenuity to your daily drudgery. Less laundry. More life.",
        "depth": "38",
        "height": "33.5",
        "width": "26",
        "ratingValue": "4.2632",
        "reviewCount": "19",
        "price": 1199,
        "priceValidUntil": "7/3/2021"
    },
    "309579510": {
        "product_id": 309579510,
        "modelNbr": "WD100CB",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "PED WASHERS W/OUT HOSES",
        "Type2": "OTHER",
        "Title": "LG Electronics 27 in. 1.0 cu. ft. SideKick Pedestal Washer with TWINWash System Compatibility and NeveRust Drum in Black Steel",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/64a0ac82-28c5-4a06-ba53-4a0c913fe59f/svn/black-steel-lg-electronics-front-load-washers-wd100cb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-27-in-1-0-cu-ft-SideKick-Pedestal-Washer-with-TWINWash-System-Compatibility-and-NeveRust-Drum-in-Black-Steel-WD100CB/309579510",
        "Description": "Meet your newest laundry ally -- LG's ingenious SideKick washer. Disguised as an everyday pedestal, this 27 in. W mini LG washer pairs with almost any LG front load unit so you can wash two loads at the same time. The main tub is the workhorse, taking on your biggest, bulkiest family-size loads like towels and bedding, while the SideKick gives delicates, hand washables and workout wear the special care they deserve. With this LG pedestal washer on your side, you can divide and conquer your laundry -- and the rest of your day -- like never before. Color: Black Steel.",
        "depth": "50.5",
        "height": "15",
        "width": "15",
        "ratingValue": "4.5129",
        "reviewCount": "503",
        "price": 548,
        "priceValidUntil": "07/14/2021"
    },
    "312304273": {
        "product_id": 312304273,
        "modelNbr": "4400 N/B+PDL",
        "Category": "APPLIANCES",
        "ApplType": "LAUNDRY",
        "Type1": "COMBO WASHER/DRYER ELECT",
        "Type2": "OTHER",
        "Title": "EQUATOR ADVANCED Appliances 1.57 cu. ft. 23.5 in. High -Efficiency Vented/Ventless Electric All-in-One Washer Dryer Combo with Pedestal in Black",
        "Brand": "EQUATOR ADVANCED Appliances",
        "ImageUrl": "https://images.homedepot-static.com/productImages/9c07b7d0-e059-4938-8391-c3534971674f/svn/black-equator-advanced-appliances-front-load-washers-4400-n-b-pdl-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/EQUATOR-ADVANCED-Appliances-1-57-cu-ft-23-5-in-High-Efficiency-Vented-Ventless-Electric-All-in-One-Washer-Dryer-Combo-with-Pedestal-in-Black-4400-N-B-PDL/312304273",
        "Description": "The Super Combo Washer-Dryer 4400N future of environmental sustainability wrapped in smart, minimalist style. Innovative and chic, this has won the TechBrilliance, Twice VIP Award and the Global Innovation Award (gia). It is the slimmest model available in North America, making it perfect for tight spaces. With a load capacity of 13-lbs., and a sizis an upgraded version of the 4400CV which offers you thee of only 33.5 in. high x 23.5 in. wide x 22 in. deep, it coordinates well into any home design. It features an automatic water level sensor, delay start time, one-button convertible venting/condensing options, a sensor dry feature, a wrinkle guard, and even an optional booster fan. Its 14 programmable wash/dry functions allow you to protect any fabric type, plus it offers Wash Only/Dry Only options. The 4400N has additional features such as Quiet Function, Winterize Option, Dual Fan for faster drying and easy to use control panel. It holds 15 patents, and meets the strict energy standards of 2018, ensuring competitive energy efficiency for years to come. The 11.5 in. High Pedestal with Storage drawer provides a handy storage area for laundry supplies. Designed to ease the back strain of bending over, this 11.5 in. high pedestal raises your laundry machine to a comfortable height. This back-saving accessory comes with leveling legs and a water drain. The updated design includes a leak overflow system and a drain hose and is available to blend seamlessly in your space. Color: Black.",
        "depth": "22",
        "height": "33.5",
        "width": "38",
        "ratingValue": "3.0",
        "reviewCount": "3",
        "price": 1299,
        "priceValidUntil": "7/3/2021"
    }
}