{
    "312751446": {
        "product_id": 312751446,
        "modelNbr": "NX58R5601SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 30 in. 5.8 cu. ft. Gas Range with Self-Cleaning and Fan Convection Oven in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c8597e1f-73ec-4056-9487-c3514f6cdb13/svn/stainless-steel-samsung-single-oven-gas-ranges-nx58r5601ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-5-8-cu-ft-Gas-Range-with-Self-Cleaning-and-Fan-Convection-Oven-in-Stainless-Steel-NX58R5601SS/312751446",
        "Description": "Cooking capacity, convenience and effectiveness come together in this stainless steel range. With a generous 5.8 cu. ft. of gas oven space, it features fan convection for faster, more even cooking. The stove offers five specialized burners in multiple shapes and sizes for the ultimate in flexibility plus a stovetop griddle customized to fit the center oval burner.",
        "depth": "25",
        "height": "20",
        "width": "25",
        "ratingValue": "4.4444",
        "reviewCount": "3348",
        "price": 898,
        "priceValidUntil": "06/22/2021"
    },
    "301349267": {
        "product_id": 301349267,
        "modelNbr": "NX58M6850SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 30 in. 5.8 cu. ft. Dual Door Gas Range Double Oven with Self-Cleaning and Dual Convection Oven in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4d9dd89a-4761-4a08-9689-63f8536776a2/svn/stainless-steel-samsung-double-oven-gas-ranges-nx58m6850ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-5-8-cu-ft-Dual-Door-Gas-Range-Double-Oven-with-Self-Cleaning-and-Dual-Convection-Oven-in-Stainless-Steel-NX58M6850SS/301349267",
        "Description": "The Samsung 5.8 cu. ft. Flex Duo Freestanding Range with Dual Door gives you flexible oven capacity by splitting 1 oven into 2. The removable Smart Divider creates 2 independent ovens and temperature controls to cook multiple dishes simultaneously, with little to no transfer of heat or aroma. A hinged door gives you access to just the top compartment or the full oven. Dual Fan Convection distributes heat throughout the oven for faster and more even cooking. The powerful flexible cooktop has 5 burners with 16K BTU and 15K BTU power burners that can handle multiple dishes, in different sized pans, simultaneously. Color: Stainless Steel.",
        "depth": "25",
        "height": "21.125",
        "width": "25",
        "ratingValue": "4.1656",
        "reviewCount": "151",
        "price": 1398,
        "priceValidUntil": "06/22/2021"
    },
    "205079331": {
        "product_id": 205079331,
        "modelNbr": "WFG505M0BS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Whirlpool 5.1 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6d72b40c-cbad-4daa-8182-eb1a54fc8e67/svn/stainless-steel-whirlpool-single-oven-gas-ranges-wfg505m0bs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-1-cu-ft-Gas-Range-in-Stainless-Steel-WFG505M0BS/205079331",
        "Description": "Enjoy the flexibility and efficiency you need to prepare holiday meals and everything in between with this 5.1 cu. ft. capacity freestanding gas range. Multiple Power burners make high heat tasks like searing and frying easy, while an 8,000-BTU middle burner offers added flexibility and room to cook all of your favorite dishes. Plus, it's easy to move heavy pots and pans across the continuous, satin-finish cast-iron grates to the optimal cooking location. The large oven window lets you monitor cooking progress without opening the door and disturbing the oven temperature. And when you need to toast a large batch of garlic bread or melt cheese on burgers for the whole family, the full-width under-oven broiler provides enough space to broil an entire rack of food. Color: Stainless Steel.",
        "depth": "45.21",
        "height": "18.38",
        "width": "19",
        "ratingValue": "4.4633",
        "reviewCount": "3283",
        "price": 849,
        "priceValidUntil": "6/21/2021"
    },
    "312460413": {
        "product_id": 312460413,
        "modelNbr": "LRGL5825F",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "LG",
        "Title": "LG Electronics 5.8 cu. ft. Smart Wi-Fi Enabled True Convection InstaView Gas Range Oven with Air Fry in Printproof Stainless Steel",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/9b83884f-f38a-4fd5-b9d9-a5055149a7c0/svn/printproof-stainless-steel-lg-electronics-single-oven-gas-ranges-lrgl5825f-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-5-8-cu-ft-Smart-Wi-Fi-Enabled-True-Convection-InstaView-Gas-Range-Oven-with-Air-Fry-in-Printproof-Stainless-Steel-LRGL5825F/312460413",
        "Description": "Taking a page from LG's wildly popular InstaView refrigerator, this range lets you check cooking progress without opening the door or reaching over a hot cooktop to flip a switch. Just knock twice on the window to turn on the oven light. Air Fry delivers crispy flavor fast with no preheating and makes enough to feed a crowd-no need to buy yet another gadget that takes up counter space. From zucchini fries to hot wings, see what you can do with this all-in-one range. Color: PrintProof Stainless Steel.",
        "depth": "48.5",
        "height": "21.38",
        "width": "24.88",
        "ratingValue": "4.5674",
        "reviewCount": "423",
        "price": 1199,
        "priceValidUntil": "6/21/2021"
    },
    "312107684": {
        "product_id": 312107684,
        "modelNbr": "GCRG3038AF",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "FRIGIDAIRE",
        "Title": "FRIGIDAIRE GALLERY 30 in. 5 cu. ft. Gas Range with Steam Clean Quick Bake Convection in Smudge-Proof Stainless Steel",
        "Brand": "FRIGIDAIRE GALLERY",
        "ImageUrl": "https://images.homedepot-static.com/productImages/2db0e98a-8789-45fc-9a54-d66df7b32300/svn/smudge-proof-stainless-steel-frigidaire-gallery-single-oven-gas-ranges-gcrg3038af-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/FRIGIDAIRE-GALLERY-30-in-5-cu-ft-Gas-Range-with-Steam-Clean-Quick-Bake-Convection-in-Smudge-Proof-Stainless-Steel-GCRG3038AF/312107684",
        "Description": "The Frigidaire Gallery 30 in. Smudge-Proof Black Stainless Steel Freestanding Gas Range with Self-Cleaning QuickBake Convection lets you cook more at once with a 5.0 cu. ft. capacity oven. The versatile cooktop features five gas sealed burners, including a 17,000 BTU quick boil burner that boils water fast, a center 9,500 BTU burner and a low-simmer burner, so you can have precise temperature control with high and low heat. The extra-large window and bright lighting allow you to easily check on the progress of your recipe without opening the door. Color: Smudge-Proof Stainless Steel.",
        "depth": "46.625",
        "height": "18.625",
        "width": "24.38",
        "ratingValue": "4.7296",
        "reviewCount": "477",
        "price": 944,
        "priceValidUntil": "06/22/2021"
    },
    "205998253": {
        "product_id": 205998253,
        "modelNbr": "KFGD500ESS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "KITCHENAID",
        "Title": "KitchenAid 6.0 cu. ft. Double Oven Gas Range with Self-Cleaning Convection Oven in Stainless Steel, Silver",
        "Brand": "KitchenAid",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6c779b8a-4dfa-490e-a391-8a358297e49c/svn/stainless-steel-kitchenaid-double-oven-gas-ranges-kfgd500ess-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/KitchenAid-6-0-cu-ft-Double-Oven-Gas-Range-with-Self-Cleaning-Convection-Oven-in-Stainless-Steel-KFGD500ESS/205998253",
        "Description": "This beautiful gas double oven range produces flawless cooking results with Even-Heat True Convection. The unique bow-tie design and convection fan ensure the inside of the entire oven is heated to and stays at, the perfect temperature. The oven is a combined 6.0 cu. ft., providing a large capacity that's perfect for preparing multiple dishes at once. The cooktop has 5 burners ranging from 5,000 to 17,000 BTU, letting you go from a rolling boil to a delicate simmer. Color: Stainless Steel.",
        "depth": "45.5",
        "height": "14.88",
        "width": "25",
        "ratingValue": "4.5246",
        "reviewCount": "997",
        "price": 2299,
        "priceValidUntil": "6/21/2021"
    },
    "304518031": {
        "product_id": 304518031,
        "modelNbr": "HGR30BZWTLP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 30 in. 3.0 cu. ft. Single Oven Italian Gas Range with True Convection, 5 Burners, LP Gas, Bronze Trim in White",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0e9fd364-6a12-4ec7-82ee-8986d3aa95c0/svn/white-hallman-single-oven-gas-ranges-hgr30bzwtlp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-30-in-3-0-cu-ft-Single-Oven-Italian-Gas-Range-with-True-Convection-5-Burners-LP-Gas-Bronze-Trim-in-White-HGR30BZWTLP/304518031",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The five sealed Italian brass burners provide a perfect blend of power and precision, with infinite heat setting capability ranging from a searing 15,500 BTU, down to simmering 1260 BTU. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie hardware and triple-pane glass window for added safety that can easily be removed for cleaning. Beneath the oven there is a full-width drawer designed to keep dishes warm between 125 - 200 before serving. Traditional manual controls and durable components minimize costly service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to suit your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy, our classic European design will create an elegant focal point to every kitchen they adorn. Color: White.",
        "depth": "37",
        "height": "14",
        "width": "21.2598",
        "ratingValue": "2.5",
        "reviewCount": "2",
        "price": 3499,
        "priceValidUntil": "6/21/2021"
    },
    "207104548": {
        "product_id": 207104548,
        "modelNbr": "WGG745S0FS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Whirlpool 6.0 cu. ft. Double Oven Gas Range with Center Oval Burner in Stainless Steel, Silver",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/918e68fd-c619-47d6-bdb0-37c52f9507da/svn/stainless-steel-whirlpool-double-oven-gas-ranges-wgg745s0fs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-6-0-cu-ft-Double-Oven-Gas-Range-with-Center-Oval-Burner-in-Stainless-Steel-WGG745S0FS/207104548",
        "Description": "Get dinner on the table quickly with this gas double oven kitchen range. True convection cooking lets you cook food faster. Convection Conversion will do the math for you to adjust cooking times and temperatures. Skip preheating this oven range for frozen favorites like pizza, lasagna, chicken nuggets, fries or pies, thanks to Frozen Bake technology. Large griddles and other longer cookware heat evenly on the range stove with the center oval burner. And if you make a mess, EZ-2-Lift hinged cast-iron grates provide quick access to wipe up spills on the kitchen range's cooktop. Color: Stainless Steel.",
        "depth": "46",
        "height": "14.68",
        "width": "25",
        "ratingValue": "4.496",
        "reviewCount": "742",
        "price": 1699,
        "priceValidUntil": "6/21/2021"
    },
    "304524255": {
        "product_id": 304524255,
        "modelNbr": "HGR36CMSSLP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 36 in. 3.55 cu. ft. Single Oven Italian Gas Range True Convection,5 Burners, LP Gas, Chrome Trim/Stainless Steel, Silver",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/a1408add-48ed-434e-abba-ef91275e60d9/svn/stainless-steel-hallman-single-oven-gas-ranges-hgr36cmsslp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-36-in-3-55-cu-ft-Single-Oven-Italian-Gas-Range-True-Convection-5-Burners-LP-Gas-Chrome-Trim-Stainless-Steel-HGR36CMSSLP/304524255",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The sealed Italian brass burners provide a perfect blend of power and precision, with output ranging from 15,500 BTU, down to 1260 BTU. The removable stainless steel griddle features an oversized brass oval burner with 10,500 BTU. A grate is also provided to place over the oval burner, creating flexible functionality. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3.55 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie and 3-pane glass window for safety that can be removed for cleaning. Beneath the oven there is a drawer designed to keep dishes warm between 125-200 before serving. Manual controls and durable components minimize service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy.",
        "depth": "37",
        "height": "14",
        "width": "25.1969",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 3599,
        "priceValidUntil": "6/21/2021"
    },
    "314906951": {
        "product_id": 314906951,
        "modelNbr": "RGS-BM-30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "ZLINE Kitchen and Bath ZLINE 30 in. 4.0 cu. ft. Range with Gas Stove and Gas Oven in DuraSnow Stainless Steel and Blue Matte Door (RGS-BM-30), DuraSnow® Stainless Steel with Blue Matte door",
        "Brand": "ZLINE Kitchen and Bath",
        "ImageUrl": "https://images.homedepot-static.com/productImages/7cc7ec00-3d87-4a94-a114-3e16cda8c9ca/svn/durasnow-stainless-steel-with-blue-matte-door-zline-kitchen-and-bath-single-oven-gas-ranges-rgs-bm-30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/ZLINE-Kitchen-and-Bath-ZLINE-30-in-4-0-cu-ft-Range-with-Gas-Stove-and-Gas-Oven-in-DuraSnow-Stainless-Steel-and-Blue-Matte-Door-RGS-BM-30-RGS-BM-30/314906951",
        "Description": "Experience Attainable Luxury with the ZLINE DuraSnow All Gas Professional Range. Combining both professional aesthetics and functionality, this range provides the ultimate luxury experience for a fraction of the cost. Achieve optimal results with cooktop cooking power from 4,200 up to 18,000 BTUs provided with sealed burners. Ignite your culinary experience with an all gas oven, allowing for a faster, more efficient heat and moisture distribution. Enjoy an ultra-deep oven capacity with a three-layered insulated glass oven for even, precise cooking every use. With upgraded premium features such as Smooth Slide ball-bearing oven racks, dual lighting, and adjustable legs, this range is certain to wow both the chef and guests alike. Assembled with the highest quality materials on the market, this range offers a durable, scratch-resistant porcelain cooktop and ZLINE's exclusive single piece cast iron grate. Cook with ease with StayPut Italian hinges, providing a safe baking environment to enjoy for years to come. ZLINE stands by the longevity and durability of their professional ranges, while ensuring further protection and peace of mind with a worry-free warranty. The ZLINE All Gas Range ships next business day when in stock. Color: DuraSnow® Stainless Steel with Blue Matte door.",
        "depth": "39.5",
        "height": "14",
        "width": "26.5",
        "ratingValue": "4.8",
        "reviewCount": "30",
        "price": 2799.95,
        "priceValidUntil": "6/21/2021"
    },
    "314138086": {
        "product_id": 314138086,
        "modelNbr": "PGB935BPTS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "Profile 30 in. 5.6 cu. ft. Gas Range with Self-Cleaning Convection Oven and Air Fry in Black Stainless Steel, Fingerprint Resistant Black Stainless Steel",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/873ad0b0-2ded-4e5d-bea7-b4e59dd1de9e/svn/fingerprint-resistant-black-stainless-steel-ge-single-oven-gas-ranges-pgb935bpts-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-Profile-30-in-5-6-cu-ft-Gas-Range-with-Self-Cleaning-Convection-Oven-and-Air-Fry-in-Black-Stainless-Steel-PGB935BPTS/314138086",
        "Description": "GE Profile Appliances are built on the belief that modern life needs modern solutions. GE Profile Appliances are designed to make daily life simpler by incorporating Smart Home technology and cutting-edge features in every appliance. GE Profile's sleek design and quality engineering will give your kitchen the most up-to-date look and the best innovative performance you've been looking for. Color: Fingerprint Resistant Black Stainless Steel.",
        "depth": "47.1875",
        "height": "19",
        "width": "24",
        "ratingValue": "4.6786",
        "reviewCount": "308",
        "price": 1394,
        "priceValidUntil": "06/22/2021"
    },
    "207189390": {
        "product_id": 207189390,
        "modelNbr": "P24B3202PS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Premier ProSeries 24 in. 2.97 cu. ft. Battery Spark Ignition Gas Range in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/787d2834-9399-4779-813b-b9639ce7a421/svn/stainless-steel-premier-single-oven-gas-ranges-p24b3202ps-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-ProSeries-24-in-2-97-cu-ft-Battery-Spark-Ignition-Gas-Range-in-Stainless-Steel-P24B3202PS/207189390",
        "Description": "The Premier 24 in. Freestanding Battery Spark Ignition Gas Range brings you the features you need while accommodating a smaller kitchen space, and requires NO electricity to operate. Equipped with removable (dishwasher safe) grates and removable oven bottom, this range is a cinch to keep clean. Our Fully Insulated Oven contains a Baffled Oven Burner that disperses heat uniformly for even baking temperatures. Color: Stainless Steel.",
        "depth": "43",
        "height": "15",
        "width": "19",
        "ratingValue": "3.0",
        "reviewCount": "2",
        "price": 1449,
        "priceValidUntil": "6/21/2021"
    },
    "312775983": {
        "product_id": 312775983,
        "modelNbr": "LRGL5821S",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "LG",
        "Title": "LG Electronics 5.8 cu.ft. Smart Single Oven Gas Range with EasyClean, Wi-Fi Enabled in Stainless Steel, Silver",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f4331c65-c658-42dc-a2b4-0347e0753a34/svn/stainless-steel-lg-electronics-single-oven-gas-ranges-lrgl5821s-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-5-8-cu-ft-Smart-Single-Oven-Gas-Range-with-EasyClean-Wi-Fi-Enabled-in-Stainless-Steel-LRGL5821S/312775983",
        "Description": "Cooking for a crowd? No problem! This large capacity gas single oven range lets you cook bigger meals without cramping the oven and its premium wide grates support all 5 burners at once with pans of all shapes and sizes. ThinQ(R) technology lets you control the oven remotely and Proactive Customer Care sends maintence tips and alerts. And skip the post-dinner cleanup argument; a three-step, 10-minute EasyClean option gets everyone off the hook. Color: Stainless Steel.",
        "depth": "48.03",
        "height": "47.31",
        "width": "24.88",
        "ratingValue": "4.4429",
        "reviewCount": "70",
        "price": 799,
        "priceValidUntil": "6/21/2021"
    },
    "311372703": {
        "product_id": 311372703,
        "modelNbr": "WFG525S0JZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "WHIRLPOOL",
        "Title": "Whirlpool 5.0 cu. ft. Gas Range with Self Cleaning and Center Oval Burner in Fingerprint Resistant Stainless Steel",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/fae65a51-457f-4b5d-bb36-9dd4c3ce9f20/svn/fingerprint-resistant-stainless-steel-whirlpool-single-oven-gas-ranges-wfg525s0jz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-0-cu-ft-Gas-Range-with-Self-Cleaning-and-Center-Oval-Burner-in-Fingerprint-Resistant-Stainless-Steel-WFG525S0JZ/311372703",
        "Description": "This Whirlpool self cleaning oven with a Speed Heat burner allows you to sear and boil quickly. Heat long cookware on the center oval burner. Prevent cooked food from getting cold with the Keep Warm setting. Plus, its easy to keep the range clean thanks to dishwasher-safe cast-iron grates. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "46.56",
        "height": "18.88",
        "width": "24.5",
        "ratingValue": "4.4465",
        "reviewCount": "439",
        "price": 944,
        "priceValidUntil": "06/22/2021"
    },
    "206007525": {
        "product_id": 206007525,
        "modelNbr": "KFDD500ESS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "DUAL FUEL RANGES",
        "Type2": "DUAL FUEL RANGES",
        "Title": "KitchenAid 6.7 cu. ft. Double Oven Dual Fuel Gas Range with Self-Cleaning Convection Oven in Stainless Steel, Silver",
        "Brand": "KitchenAid",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c84cd77c-d083-4330-b284-c01ddf86c845/svn/stainless-steel-kitchenaid-double-oven-gas-ranges-kfdd500ess-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/KitchenAid-6-7-cu-ft-Double-Oven-Dual-Fuel-Gas-Range-with-Self-Cleaning-Convection-Oven-in-Stainless-Steel-KFDD500ESS/206007525",
        "Description": "This powerful Dual Fuel double oven range by KitchenAid can satisfy the culinary needs of the most demanding cooks. It combines the precise control of gas with an electric oven. It features a Steam Rack that offers the ability to add moisture to the oven, enhancing cooking results. It also produces flawless cooking results with Even-Heat True Convection. The unique bow-tie design and convection fan ensure the inside of the entire oven is heated to and stays at, the perfect temperature. Color: Stainless Steel.",
        "depth": "45",
        "height": "16",
        "width": "25",
        "ratingValue": "4.3455",
        "reviewCount": "356",
        "price": 2799,
        "priceValidUntil": "6/21/2021"
    },
    "304517563": {
        "product_id": 304517563,
        "modelNbr": "HGR30BSBU",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 30 in. 3.0 cu. ft. Single Oven Italian Gas Range with True Convection, 5 Burners, Brass Trim in Blue",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/df7f94b2-7812-4531-9082-29638e2172cd/svn/blue-hallman-single-oven-gas-ranges-hgr30bsbu-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-30-in-3-0-cu-ft-Single-Oven-Italian-Gas-Range-with-True-Convection-5-Burners-Brass-Trim-in-Blue-HGR30BSBU/304517563",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The five sealed Italian brass burners provide a perfect blend of power and precision, with infinite heat setting capability ranging from a searing 15,500 BTU, down to simmering 1260 BTU. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie hardware and triple-pane glass window for added safety that can easily be removed for cleaning. Beneath the oven there is a full-width drawer designed to keep dishes warm between 125 - 200 before serving. Traditional manual controls and durable components minimize costly service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to suit your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy, our classic European design will create an elegant focal point to every kitchen they adorn. Color: Blue.",
        "depth": "37",
        "height": "14",
        "width": "21.2598",
        "ratingValue": "3.5",
        "reviewCount": "6",
        "price": 3299,
        "priceValidUntil": "6/21/2021"
    },
    "313903663": {
        "product_id": 313903663,
        "modelNbr": "KNG301/LP-W",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Pro-Style 30 in. 4.2 cu. ft. Propane Gas Range with Sealed Burners and Convection Oven in White Oven Door",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f1b86a4d-f64d-4f92-afa6-4e9f247c5cd1/svn/white-kucht-single-oven-gas-ranges-kng301-lp-w-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Pro-Style-30-in-4-2-cu-ft-Propane-Gas-Range-with-Sealed-Burners-and-Convection-Oven-in-White-Oven-Door-KNG301-LP-W/313903663",
        "Description": "Fitting into most standard kitchens, this impressive 30 in. range boasts a 22,000 BTU convection oven, with a 10,000 BTU tube burner broiler. Enjoy cooking with your new Pro-Style range features two 15,000 BTU and two 9,000 BTU burners. The main feature of this series is the ability to the change the look of your kitchen in less than 2-minutes by changing the color of the oven door and the kickplate. You can get a new color set (oven door and kickplate) for really a low price and change it whenever you like. The currently available colors are: Red, Blue, White, Green, Black and Silver. Add a set of color knobs and get the most of it by mixing and matching. Your kitchen decor will be ready in 2-minutes.",
        "depth": "44",
        "height": "15",
        "width": "24",
        "ratingValue": "4.6471",
        "reviewCount": "17",
        "price": 2037.34,
        "priceValidUntil": "6/21/2021"
    },
    "301061491": {
        "product_id": 301061491,
        "modelNbr": "MGR6600FZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Maytag 5.0 cu. ft. Gas Range with 5th Oval Burner in Fingerprint Resistant Stainless Steel",
        "Brand": "Maytag",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f00dd279-c908-4cde-8ac4-f01e7c18a0cd/svn/fingerprint-resistant-stainless-steel-maytag-single-oven-gas-ranges-mgr6600fz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Maytag-5-0-cu-ft-Gas-Range-with-5th-Oval-Burner-in-Fingerprint-Resistant-Stainless-Steel-MGR6600FZ/301061491",
        "Description": "With Better Built components and powerful cooking features, this single oven gas range is built tough for the long haul. Available in easy-to-clean fingerprint resistant stainless steel that protects against smudges, this freestanding range features an 8,000-BTU oval burner that helps ensure even heating when you're cooking with oversized pots and pans. And with a 10-year limited parts warranty and the fact that this 5.0 cu. ft. freestanding range is designed, engineered and assembled in the U.S.A. with genuine American Pride, you can count on cooking up favorites for years to come.",
        "depth": "46.56",
        "height": "18.88",
        "width": "24.5",
        "ratingValue": "4.4726",
        "reviewCount": "603",
        "price": 949,
        "priceValidUntil": "6/21/2021"
    },
    "313032725": {
        "product_id": 313032725,
        "modelNbr": "NK3055LP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "NXR Entree 30 in. 4.5 cu. ft. Professional Style Liquid Propane Range with Convection Oven in Stainless Steel and Black",
        "Brand": "NXR",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c087e3f4-8d56-4e49-9de7-2a914b787aa4/svn/stainless-steel-and-black-nxr-single-oven-gas-ranges-nk3055lp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/NXR-Entree-30-in-4-5-cu-ft-Professional-Style-Liquid-Propane-Range-with-Convection-Oven-in-Stainless-Steel-and-Black-NK3055LP/313032725",
        "Description": "Experience the NXR Entree, the all stainless steel professional style gas range designed to be the centerpiece of your kitchen. The NXR Entrees sleek design brings the look and feel of a commercial restaurant-style range into your home. The heart and soul of a range is the burner and the NXR Entree features world-class single-stack burners manufactured in Germany by Isphording. The NXR Entree offers the ultimate versatility and each burner has a purpose.The re-ignition system is all about safety and will protect against gas buildup. The cook-top drip pan is made with black porcelain so spills can easily be cleaned up. Underneath it all, the NXR Entree is made up of globally sourced parts selected specifically to perform. The ovens broiler burner will allow you to show off your cooking abilities exposing your food directly to high heat, searing and sealing in flavor, perfect for quickly cooking thin cuts of meat. The convection fan will circulate air to promote even cooking, instantly boosting your baking repertoire. Whether you cook all the time or only on special occasions, fall in love with the cooking experience of the NXR Entree. Color: Stainless Steel and Black.",
        "depth": "44.25",
        "height": "16",
        "width": "24.5",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 2149,
        "priceValidUntil": "6/21/2021"
    },
    "304523959": {
        "product_id": 304523959,
        "modelNbr": "HGR36CMBU",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 36 in. 3.55 cu. ft. Single Oven Italian Gas Range with True Convection, 5 Burners, Griddle, Chrome Trim in Blue",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/2022d625-adc2-48ab-a070-b5b682053c0c/svn/blue-hallman-single-oven-gas-ranges-hgr36cmbu-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-36-in-3-55-cu-ft-Single-Oven-Italian-Gas-Range-with-True-Convection-5-Burners-Griddle-Chrome-Trim-in-Blue-HGR36CMBU/304523959",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The sealed Italian brass burners provide a perfect blend of power and precision, with output ranging from 15,500 BTU, down to 1260 BTU. The removable stainless steel griddle features an oversized brass oval burner with 10,500 BTU. A grate is also provided to place over the oval burner, creating flexible functionality. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3.55 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie and 3-pane glass window for safety that can be removed for cleaning. Beneath the oven there is a drawer designed to keep dishes warm between 125-200 before serving. Manual controls and durable components minimize service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy. Color: Blue.",
        "depth": "37",
        "height": "14",
        "width": "25.1969",
        "ratingValue": "4.5",
        "reviewCount": "2",
        "price": 3599,
        "priceValidUntil": "6/21/2021"
    },
    "315493076": {
        "product_id": 315493076,
        "modelNbr": "NX60A6511SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 6.0 cu. ft. Smart Freestanding Gas Range with Air Fry and Convection in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/96f5ca4e-147a-4352-a1f3-ce98889d6705/svn/stainless-steel-samsung-single-oven-gas-ranges-nx60a6511ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-6-0-cu-ft-Smart-Freestanding-Gas-Range-with-Air-Fry-and-Convection-in-Stainless-Steel-NX60A6511SS/315493076",
        "Description": "Elevate the look of your kitchen with Samsung's new Smart Freestanding Gas Range. This large 6.0 cu. ft. oven can fit multiple dishes at one time, and can easily accommodate big casserole dishes and large roasting pans. Upgraded technology makes cooking simple and fun. Color: Stainless Steel.",
        "depth": "48",
        "height": "21.6",
        "width": "24.8",
        "ratingValue": "4.6",
        "reviewCount": "5",
        "price": 939,
        "priceValidUntil": "06/22/2021"
    },
    "314137966": {
        "product_id": 314137966,
        "modelNbr": "JGB660YPFS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 5.0 cu. ft. Gas Range with Self-Cleaning Oven in Fingerprint Resistant Stainless Steel",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/0c0d3330-f41d-460c-b754-8107436db3c4/svn/fingerprint-resistant-stainless-steel-ge-single-oven-gas-ranges-jgb660ypfs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-5-0-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Fingerprint-Resistant-Stainless-Steel-JGB660YPFS/314137966",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "46.25",
        "height": "19",
        "width": "24",
        "ratingValue": "4.6585",
        "reviewCount": "3283",
        "price": 944,
        "priceValidUntil": "06/22/2021"
    },
    "206943226": {
        "product_id": 206943226,
        "modelNbr": "JGB645SEKSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "5.0 cu. ft. Gas Range with Self-Cleaning Oven in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d9d497aa-0a15-4807-a6ac-534f4e313e4a/svn/stainless-steel-ge-single-oven-gas-ranges-jgb645sekss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-5-0-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Stainless-Steel-JGB645SEKSS/206943226",
        "Description": "Your GE 30 in. 5.0 cu. ft. Gas Range with Self-Cleaning oven in White has a Precise Simmer burner to allow cooking of delicate foods with low, even heat. This 4 burner range with Storage Drawer gives you not only enough room to cook an entire meal at once, but to store your kitchen items. Sealed Cooktop Burners contain spills and make cleaning quick and easy. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical. Color: Stainless Steel.",
        "depth": "46.25",
        "height": "19",
        "width": "24",
        "ratingValue": "4.4932",
        "reviewCount": "367",
        "price": 854,
        "priceValidUntil": "06/22/2021"
    },
    "312994316": {
        "product_id": 312994316,
        "modelNbr": "FFSGS6275-30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Forno Lseo 30 in. 4.23 cu. ft. Gas Range with Fan Convection Oven in Stainless Steel, Silver",
        "Brand": "Forno",
        "ImageUrl": "https://images.homedepot-static.com/productImages/b35ea8a7-51d5-4865-a27d-50f4c110b9ba/svn/stainless-steel-forno-single-oven-gas-ranges-ffsgs6275-30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Forno-Lseo-30-in-4-23-cu-ft-Gas-Range-with-Fan-Convection-Oven-in-Stainless-Steel-FFSGS6275-30/312994316",
        "Description": "The 30 in. Gas Range by Forno offers a durable, high-quality stainless steel design. The range features 5 Italian Defendi Burner with Cast Iron Grates. 4.23 cu. ft. Oven 30 in. features convection and broiler. All Forno products are backed by an iron clad 2-year warranty for your satisfaction. Skip the high price tags without sacrificing quality and performance. Lower the cost of living with Forno.",
        "depth": "25",
        "height": "18",
        "width": "25",
        "ratingValue": "4.45",
        "reviewCount": "60",
        "price": 1399,
        "priceValidUntil": "6/21/2021"
    },
    "302556060": {
        "product_id": 302556060,
        "modelNbr": "FFGF3054TD",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MABE",
        "Title": "Frigidaire 30 in. 5.0 cu. ft. Gas Range with Self-Cleaning Oven in Black Stainless Steel",
        "Brand": "Frigidaire",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6822a4cf-9f6a-47de-94f5-cb6c54171218/svn/black-stainless-steel-frigidaire-single-oven-gas-ranges-ffgf3054td-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Frigidaire-30-in-5-0-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Black-Stainless-Steel-FFGF3054TD/302556060",
        "Description": "The Frigidaire 30 in. Freestanding Gas Range gives you more cooking flexibility with a 5.0 cu. ft. capacity oven and Broil and Serve Drawer. The cooktop features four sealed gas burners including a 17,000 BTU quick boil burner and a low-simmer burner, so you can have precise temperature control with high and low heat. Ready-select control knobs allow you to easily select options and cooking temperatures. Even Baking technology ensures that food comes out evenly, while the pre-heat, delay cook and delay clean options let you do things on your schedule. Color: Black Stainless Steel.",
        "depth": "46.625",
        "height": "18.625",
        "width": "24.38",
        "ratingValue": "4.6477",
        "reviewCount": "3457",
        "price": 854,
        "priceValidUntil": "06/22/2021"
    },
    "308825013": {
        "product_id": 308825013,
        "modelNbr": "COS-GRP304",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Cosmo Commercial-Style 30 in. 3.9 cu. ft. Gas Range with 4 Italian Burners and Heavy Duty Cast Iron Grates in Stainless Steel, Silver",
        "Brand": "Cosmo",
        "ImageUrl": "https://images.homedepot-static.com/productImages/266c54b8-6ee5-43f9-8017-f6c95f39d64d/svn/silver-cosmo-single-oven-gas-ranges-cos-grp304-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Cosmo-Commercial-Style-30-in-3-9-cu-ft-Gas-Range-with-4-Italian-Burners-and-Heavy-Duty-Cast-Iron-Grates-in-Stainless-Steel-COS-GRP304/308825013",
        "Description": "Transform the way you cook- Cosmo's COS-GRP304 3.9 cubic foot 30 inch gas range is made with convenience in mind. 4 sealed burners give you the precision to cook a variety of different foods and sauces: 18,000 BTU, 12,500 BTU, 10,000 BTU and 4,500 BTU. Powerful dual fans circulate air in the oven cavity for perfect, evenly cooked meals, and four oven functions give you cooking options to suit any need. Designed for durability, this range is constructed with industrial grade stainless steel, built to last for years to come. A removable backsplash allows this range to be versatile, able to install in both freestanding and slide- in applications. Cosmo kitchen appliances deliver professional quality into your home at factory direct prices. Color: Silver.",
        "depth": "35",
        "height": "12",
        "width": "27.25",
        "ratingValue": "4.3095",
        "reviewCount": "42",
        "price": 2199.99,
        "priceValidUntil": "6/21/2021"
    },
    "309169356": {
        "product_id": 309169356,
        "modelNbr": "NK3055",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "NXR Entree 30 in. 4.5 cu. ft. Professional Style Gas Range with Convection Oven in Stainless Steel and Black",
        "Brand": "NXR",
        "ImageUrl": "https://images.homedepot-static.com/productImages/a4b2ed62-515b-40e9-b755-4dab6cfe816f/svn/stainless-steel-and-black-nxr-single-oven-gas-ranges-nk3055-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/NXR-Entree-30-in-4-5-cu-ft-Professional-Style-Gas-Range-with-Convection-Oven-in-Stainless-Steel-and-Black-NK3055/309169356",
        "Description": "Experience the NXR Entree, the all stainless steel professional style gas range designed to be the centerpiece of your kitchen. The NXR Entrees sleek design brings the look and feel of a commercial restaurant-style range into your home. The heart and soul of a range is the burner and the NXR Entree features world-class single-stack burners manufactured in Germany by Isphording. The NXR Entree offers the ultimate versatility and each burner has a purpose.The re-ignition system is all about safety and will protect against gas buildup. The cook-top drip pan is made with black porcelain so spills can easily be cleaned up. Underneath it all, the NXR Entree is made up of globally sourced parts selected specifically to perform. The ovens broiler burner will allow you to show off your cooking abilities exposing your food directly to high heat, searing and sealing in flavor, perfect for quickly cooking thin cuts of meat. The convection fan will circulate air to promote even cooking, instantly boosting your baking repertoire. Whether you cook all the time or only on special occasions, fall in love with the cooking experience of the NXR Entree. Color: Stainless Steel and Black.",
        "depth": "44.25",
        "height": "16",
        "width": "24.5",
        "ratingValue": "3.0",
        "reviewCount": "2",
        "price": 1999,
        "priceValidUntil": "6/21/2021"
    },
    "312776015": {
        "product_id": 312776015,
        "modelNbr": "LRGL5823D",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "LG",
        "Title": "LG Electronics 5.8 cu. ft. Smart Fan Convection Gas Single Oven Range with Air Fry and EasyClean in Printproof Black Stainless Steel",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/cd24f9b7-9acd-44b5-bff8-9ea3eb2baeeb/svn/printproof-black-stainless-steel-lg-electronics-single-oven-gas-ranges-lrgl5823d-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-5-8-cu-ft-Smart-Fan-Convection-Gas-Single-Oven-Range-with-Air-Fry-and-EasyClean-in-Printproof-Black-Stainless-Steel-LRGL5823D/312776015",
        "Description": "Why buy yet another gadget that takes up counter space? This LG range with built-in Air Fry delivers crispy flavor fast with no preheating and makes enough to feed a crowd-from zucchini fries to hot wings. Main dishes also shine, thanks to fan convection that distributes heat to all areas of the oven for more precise baking and roasting. When cooking is done, cleanup is quick and easy, with the 10-minute EasyClean cycle that helps keep your oven looking like new. Color: PrintProof Black Stainless Steel.",
        "depth": "48.03",
        "height": "21.38",
        "width": "24.88",
        "ratingValue": "4.5616",
        "reviewCount": "333",
        "price": 1099,
        "priceValidUntil": "6/21/2021"
    },
    "310575941": {
        "product_id": 310575941,
        "modelNbr": "FCRG3052AS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "FRIGIDAIRE",
        "Title": "Frigidaire 30 in. 5.0 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "Frigidaire",
        "ImageUrl": "https://images.homedepot-static.com/productImages/429d6a3d-9b2f-4cf7-9fa8-9fac01cfa9e5/svn/stainless-steel-frigidaire-single-oven-gas-ranges-fcrg3052as-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Frigidaire-30-in-5-0-cu-ft-Gas-Range-in-Stainless-Steel-FCRG3052AS/310575941",
        "Description": "The Frigidaire 30 in. Gas Range gives you more cooking flexibility with a 5.0 cu. ft. capacity oven and storage drawer. The cooktop features 5 Sealed Gas Burners, including a 16,000 BTU Quick Boil Burner, 10,000 BTU Oval Burner, and a Low-Simmer Burner, so you can have precise temperature control with high and low heat. Stainless Steel exterior is durable and creates a premium look in your kitchen.",
        "depth": "46.625",
        "height": "18.625",
        "width": "24.88",
        "ratingValue": "4.4566",
        "reviewCount": "990",
        "price": 674,
        "priceValidUntil": "06/22/2021"
    },
    "314013046": {
        "product_id": 314013046,
        "modelNbr": "COS-EPGR304",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Cosmo 30 in. 4.55 cu. ft. Commercial Gas Range with Convection Oven in Stainless Steel with Storage Drawer, Silver",
        "Brand": "Cosmo",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c20f79d5-50b0-4123-9d34-ab3bf43a2e3c/svn/stainless-steel-cosmo-single-oven-gas-ranges-cos-epgr304-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Cosmo-30-in-4-55-cu-ft-Commercial-Gas-Range-with-Convection-Oven-in-Stainless-Steel-with-Storage-Drawer-COS-EPGR304/314013046",
        "Description": "Cosmo's COS-EPGR304 30 in. gas range brings professional styling and quality into your home kitchen. The large 4.5 cu. ft. oven capacity lets you bake for a crowd and the gas cooktop with 5 sealed burners can handle all your pots and pans with ease. The cooktop is equipped with a variety of different burners to suit needs from the largest pots and pans down to the most delicate sauces: 18,000 BTU, 9,000 BTU, 8,000 BTU, 6,000 BTU and 4,000 BTU. In the convection oven, powerful fans circulate air for fast, perfectly cooked meals every time. Our special oven functions give you the precision to create everything from juicy roasts to delicate desserts. Designed for durability, this 30 in. gas range is constructed with industrial, corrosion-resistant stainless steel. A removable backsplash means this range is suitable for either freestanding or slide-in installation. A 36 in. model (COS-EPGR366) is available for larger spaces.",
        "depth": "43",
        "height": "17",
        "width": "24",
        "ratingValue": "4.0",
        "reviewCount": "8",
        "price": 1799.99,
        "priceValidUntil": "6/21/2021"
    },
    "205977147": {
        "product_id": 205977147,
        "modelNbr": "KFGG500ESS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "KITCHENAID",
        "Title": "KitchenAid 5.8 cu. ft. Gas Range with Self-Cleaning Oven in Stainless Steel, Silver",
        "Brand": "KitchenAid",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3035b066-975a-41b7-86ef-59435de0a0ee/svn/stainless-steel-kitchenaid-single-oven-gas-ranges-kfgg500ess-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/KitchenAid-5-8-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Stainless-Steel-KFGG500ESS/205977147",
        "Description": "This beautiful gas freestanding range produces flawless cooking results with Even-Heat True Convection. The unique bow-tie design and convection fan ensure the inside of the entire oven is heated to, and stays at, the perfect temperature. The oven is 5.8 cu ft., providing a large capacity that's perfect for preparing multiple dishes at once. The cooktop has 5 burners ranging from 5,000 to 18,000 BTU, letting you go from a rolling boil to a delicate simmer. Color: Stainless Steel.",
        "depth": "47.88",
        "height": "20",
        "width": "24.13",
        "ratingValue": "4.4978",
        "reviewCount": "894",
        "price": 1399,
        "priceValidUntil": "6/21/2021"
    },
    "313928660": {
        "product_id": 313928660,
        "modelNbr": "NX58T7511SG",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 30 in. 5.9 cu. ft. Single Oven Gas Range with Air Fry, True Convection in Black Stainless Steel",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/cafac9ba-e8d8-49a7-9d15-be84e116ea1d/svn/black-stainless-steel-samsung-single-oven-gas-ranges-nx58t7511sg-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-5-9-cu-ft-Single-Oven-Gas-Range-with-Air-Fry-True-Convection-in-Black-Stainless-Steel-NX58T7511SG/313928660",
        "Description": "The Samsung 5.8 cu. ft. Freestanding Gas Range offers a powerful, flexible cooktop that cooks faster with 5 specialized elements. Air Fry technology with rack included right in the oven for healthier and delicious meals. True Convection distributes heat throughout the oven faster and more evenly, saving more time than traditional ovens. Color: Black Stainless Steel.",
        "depth": "23.5",
        "height": "18.94",
        "width": "25",
        "ratingValue": "4.5971",
        "reviewCount": "139",
        "price": 1168,
        "priceValidUntil": "06/22/2021"
    },
    "314610597": {
        "product_id": 314610597,
        "modelNbr": "NK3055EHBD",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "NXR Entree Bundle 30 in. 4.5 cu. ft. Pro-Style Gas Range with Convection Oven and Range Hood in Stainless Steel and Black",
        "Brand": "NXR",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4b24b641-65fe-405d-a7c0-170c1cb9037d/svn/stainless-steel-and-black-nxr-single-oven-gas-ranges-nk3055ehbd-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/NXR-Entree-Bundle-30-in-4-5-cu-ft-Pro-Style-Gas-Range-with-Convection-Oven-and-Range-Hood-in-Stainless-Steel-and-Black-NK3055EHBD/314610597",
        "Description": "Experience the NXR Entree, the all stainless steel professional style gas range designed to be the centerpiece of your kitchen. The NXR Entrees sleek design brings the look and feel of a commercial restaurant-style range into your home. The heart and soul of a range is the burner and the NXR Entree features world-class single-stack burners manufactured in Germany by Isphording. The NXR Entree offers the ultimate versatility and each burner has a purpose. The re-ignition system is all about safety and will protect against gas buildup. The cook-top drip pan is made with black porcelain so spills can easily be cleaned up. Underneath it all, the NXR Entree is made up of globally sourced parts selected specifically to perform. The ovens broiler burner will allow you to show off your cooking abilities exposing your food directly to high heat, searing and sealing in flavor, perfect for quickly cooking thin cuts of meat. The convection fan will circulate air to promote even cooking, instantly boosting your baking repertoire. The all stainless steel professional style NXR Range hood is constructed to match the high powered BTU of professional style ranges. The key is our squirrel caged ultra-quiet motor that allows super high powered 800 CFM. The hood comes with a 4 speed electronic button control panel, with auto shut-off. Additionally, there are high powered lights to light up your cooking experience. Our stainless steel baffle filters are all dishwasher safe. Color: Stainless Steel and Black.",
        "depth": "44.25",
        "height": "16",
        "width": "24.5",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 2348,
        "priceValidUntil": "6/21/2021"
    },
    "207189393": {
        "product_id": 207189393,
        "modelNbr": "P24S3202PS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Premier ProSeries 24 in. 2.97 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6a8dfef2-1c40-4269-9c7f-a6d5a71e865c/svn/stainless-steel-premier-single-oven-gas-ranges-p24s3202ps-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-ProSeries-24-in-2-97-cu-ft-Gas-Range-in-Stainless-Steel-P24S3202PS/207189393",
        "Description": "The Premier 24 in. Freestanding Electronic Spark Ignition Gas Range brings you the features you need while accommodating a smaller kitchen space. Equipped with removable (dishwasher safe) grates and removable oven bottom, this range is a cinch to keep clean. Our Fully Insulated Oven contains a Baffled Oven Burner that disperses heat uniformly and contains 2 Heavy-Duty Oven Racks with 4 Adjustable Positions. Color: Stainless Steel.",
        "depth": "43",
        "height": "15",
        "width": "19",
        "ratingValue": "3.0",
        "reviewCount": "2",
        "price": 1423,
        "priceValidUntil": "6/21/2021"
    },
    "312994349": {
        "product_id": 312994349,
        "modelNbr": "FFSGS6260-30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Forno Capriasca 30 in. 4.32 cu. ft. Gas Range with 5 Gas Burners Oven in Stainless Steel, Silver",
        "Brand": "Forno",
        "ImageUrl": "https://images.homedepot-static.com/productImages/9826ddac-cb53-462a-8145-ff5ffa38f6e6/svn/stainless-steel-forno-single-oven-gas-ranges-ffsgs6260-30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Forno-Capriasca-30-in-4-32-cu-ft-Gas-Range-with-5-Gas-Burners-Oven-in-Stainless-Steel-FFSGS6260-30/312994349",
        "Description": "Forno ALTA QUALITA 4.32 cu. ft. Pro Style freestanding gas range offers large capacity and a powerful and flexible cook-top that cooks faster with five High Quality Italian 20K BTU burners. Cooking capacity and convenience come together in this stainless steel range. The All Forno products are backed by an iron clad 2-year warranty for your satisfaction. Skip the high price tags without sacrificing quality and performance. Lower the cost of living with Forno.",
        "depth": "49",
        "height": "16",
        "width": "24.9",
        "ratingValue": "5.0",
        "reviewCount": "1",
        "price": 2999,
        "priceValidUntil": "06/22/2021"
    },
    "205068602": {
        "product_id": 205068602,
        "modelNbr": "WFG320M0BS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "WHIRLPOOL",
        "Title": "Whirlpool 5.1 cu. ft. Gas Range with Under-Oven Broiler in Stainless Steel, Silver",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6f5cca55-36c4-4a82-a93d-4c960a894796/svn/stainless-steel-whirlpool-single-oven-gas-ranges-wfg320m0bs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-1-cu-ft-Gas-Range-with-Under-Oven-Broiler-in-Stainless-Steel-WFG320M0BS/205068602",
        "Description": "Enjoy the flexibility and efficiency you need to prepare holiday meals and everything in between with this Whirlpool 5.1 cu. ft. capacity freestanding gas range. Toasting a large batch of garlic bread or melting cheese on burgers for the whole family is easy with the full-width under-oven broiler, with space to broil an entire rack of food. 15000-BTU Power Burners are perfect for high heat tasks like searing and frying. The continuous, satin-finish, cast-iron grates let you slide heavy pots and pans on the cooktop with ease. The upswept, SpillGuard cooktop contains spills for quick cleanup. Plus, thanks to the large oven window, you can monitor cooking progress without opening the door and disturbing the oven temperatures. Color: Stainless Steel.",
        "depth": "45.25",
        "height": "18.38",
        "width": "19",
        "ratingValue": "4.4138",
        "reviewCount": "4171",
        "price": 799,
        "priceValidUntil": "6/21/2021"
    },
    "309338893": {
        "product_id": 309338893,
        "modelNbr": "NX58R4311SG",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 30 in. 5.8 cu. ft. Gas Range with Self-Cleaning Oven in Fingerprint Resistant Black Stainless, Fingerprint Resistant Black Stainless Steel",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/52167728-2e1e-4bba-b690-63c70c17fce3/svn/fingerprint-resistant-black-stainless-steel-samsung-single-oven-gas-ranges-nx58r4311sg-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-5-8-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Fingerprint-Resistant-Black-Stainless-NX58R4311SG/309338893",
        "Description": "The Samsung 5.8 cu. ft. Freestanding Gas Range offers large capacity and a powerful and flexible cooktop that cooks faster with 5 specialized burners including a 17K BTU Power Burner and a 5K simmer burner. Cooking capacity, convenience, and effectiveness come together in this stainless steel range. Color: Fingerprint Resistant Black Stainless Steel.",
        "depth": "25",
        "height": "20",
        "width": "25",
        "ratingValue": "4.5971",
        "reviewCount": "1256",
        "price": 898,
        "priceValidUntil": "06/22/2021"
    },
    "302621600": {
        "product_id": 302621600,
        "modelNbr": "JGBS30REKSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "4.8 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/17747b5c-0f40-471a-b259-722f74f40d60/svn/stainless-steel-ge-single-oven-gas-ranges-jgbs30rekss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-4-8-cu-ft-Gas-Range-in-Stainless-Steel-JGBS30REKSS/302621600",
        "Description": "GE Appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical. Color: Stainless Steel.",
        "depth": "46.25",
        "height": "18.5",
        "width": "24",
        "ratingValue": "4.445",
        "reviewCount": "3079",
        "price": 566,
        "priceValidUntil": "06/22/2021"
    },
    "301868361": {
        "product_id": 301868361,
        "modelNbr": "MGT8800FZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Maytag 6.0 cu. ft. Double Oven Gas Range with True Convection Oven in Fingerprint Resistant Stainless Steel, Silver",
        "Brand": "Maytag",
        "ImageUrl": "https://images.homedepot-static.com/productImages/64d3b504-fa8c-4a71-9dee-09a72bbc77b5/svn/stainless-steel-maytag-double-oven-gas-ranges-mgt8800fz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Maytag-6-0-cu-ft-Double-Oven-Gas-Range-with-True-Convection-Oven-in-Fingerprint-Resistant-Stainless-Steel-MGT8800FZ/301868361",
        "Description": "No matter how big the meal, count on this 6.0 total cu. ft. double oven gas stove to get the job done. Power Preheat lets you start cooking sooner, while true convection with a third heating element enables faster baking and roasting. Plus, the Power burner brings the heat for quick searing and an even saute, and the oval burner provides more cooking capabilities with larger pans and griddle plates. Even better, this freestanding oven boasts a 10-year limited parts warranty, is available in fingerprint resistant stainless steel, and is designed, engineered and assembled in the U.S.A. with genuine American Pride.",
        "depth": "46",
        "height": "14.88",
        "width": "25",
        "ratingValue": "4.2348",
        "reviewCount": "132",
        "price": 2099,
        "priceValidUntil": "6/21/2021"
    },
    "206859865": {
        "product_id": 206859865,
        "modelNbr": "NX58K7850SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 30 in. 5.8 cu. ft. Double Oven Gas Range with Self-Cleaning Convection Oven in Stainless, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/fdac60a4-23b4-4256-87e5-60f2bdf1ea63/svn/stainless-steel-samsung-double-oven-gas-ranges-nx58k7850ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-5-8-cu-ft-Double-Oven-Gas-Range-with-Self-Cleaning-Convection-Oven-in-Stainless-NX58K7850SS/206859865",
        "Description": "The Samsung Flex-Duo with dual door gives you the ultimate cooking flexibility, with two independent temperature controls and convection systems, and a removable Smart Divider, so you can cook multiple dishes simultaneously with little to no mixing of odors or flavors. A hinged door gives you access to just the top compartment or the full oven. Soft Close Door gently closes the oven door for peace and quiet by catching it right before it slams. Monitor, adjust, or turn off you oven from anywhere with Wi-Fi connectivity. Color: Stainless Steel.",
        "depth": "25",
        "height": "11",
        "width": "25",
        "ratingValue": "4.149",
        "reviewCount": "208",
        "price": 1698,
        "priceValidUntil": "06/22/2021"
    },
    "311361688": {
        "product_id": 311361688,
        "modelNbr": "WFG515S0JS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Whirlpool 5.0 cu. ft. Gas Range with Self-Cleaning and Speed Heat Burner in Stainless Steel, Silver",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/9f70abf4-95a2-47d7-bff0-ca05517a8255/svn/stainless-steel-whirlpool-single-oven-gas-ranges-wfg515s0js-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-0-cu-ft-Gas-Range-with-Self-Cleaning-and-Speed-Heat-Burner-in-Stainless-Steel-WFG515S0JS/311361688",
        "Description": "This Whirlpool counter depth gas range with a Speed Heat burner allows you to sear and boil quickly. Plus, get even baking with a temperature sensor, and prevent cooked food from getting cold with the Keep Warm setting. Closed door broiling helps keep the kitchen comfortable. Cleanup is easier with a self cleaning oven and dishwasher-safe cast-iron grates. Color: Stainless Steel.",
        "depth": "46.56",
        "height": "18.88",
        "width": "24.5",
        "ratingValue": "4.1522",
        "reviewCount": "46",
        "price": 949,
        "priceValidUntil": "6/21/2021"
    },
    "206943439": {
        "product_id": 206943439,
        "modelNbr": "JGB635REKSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "30 in. 5.0 cu. ft. Gas Range with Self-Cleaning Oven in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/9e6be038-3465-4655-a5c7-92ee168f5516/svn/stainless-steel-ge-single-oven-gas-ranges-jgb635rekss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-5-0-cu-ft-Gas-Range-with-Self-Cleaning-Oven-in-Stainless-Steel-JGB635REKSS/206943439",
        "Description": "Your GE 30 in. 5.0 cu. ft. Gas Range with Self-Cleaning oven in Stainless Steel has a Precise Simmer burner to allow cooking of delicate foods with low, even heat. This 4 burner range with storage drawer gives you not only enough room to cook an entire meal at once, but to store your kitchen items. Sealed cooktop burners contain spills and make cleaning quick and easy. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical.",
        "depth": "46.25",
        "height": "19",
        "width": "24",
        "ratingValue": "4.4347",
        "reviewCount": "957",
        "price": 808,
        "priceValidUntil": "06/22/2021"
    },
    "313903481": {
        "product_id": 313903481,
        "modelNbr": "KNG301-W",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Pro-Style 30 in. 4.2 cu. ft. Natural Gas Range with Sealed Burners and Convection Oven in White Oven Door",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/cc5b7114-bc3b-4398-ad59-0e02534ba4ab/svn/white-kucht-single-oven-gas-ranges-kng301-w-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Pro-Style-30-in-4-2-cu-ft-Natural-Gas-Range-with-Sealed-Burners-and-Convection-Oven-in-White-Oven-Door-KNG301-W/313903481",
        "Description": "Fitting into most standard kitchens, this impressive 30 in. range boasts a 22,000 BTU convection oven, with a 10,000 BTU tube burner broiler. Enjoy cooking with your new Pro-Style range features two 15,000 BTU and two 9,000 BTU burners. The main feature of this series is the ability to the change the look of your kitchen in less than 2-minutes by changing the color of the oven door and the kickplate. You can get a new color set (oven door and kickplate) for really a low price and change it whenever you like. The currently available colors are: Red, Blue, White, Green, Black and Silver. Add a set of color knobs and get the most of it by mixing and matching. Your kitchen decor will be ready in 2-minutes.",
        "depth": "44",
        "height": "15",
        "width": "24",
        "ratingValue": "4.8889",
        "reviewCount": "18",
        "price": 2097,
        "priceValidUntil": "6/21/2021"
    },
    "206215089": {
        "product_id": 206215089,
        "modelNbr": "KRG3080U/LP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Pro-Style 30 in. 4.2 cu. ft. Propane Gas Range with Sealed Burners and Convection Oven in Stainless Steel, Classic Silver",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f1d565c9-c2b2-4c48-b828-2dc8c1844cdb/svn/classic-silver-kucht-single-oven-gas-ranges-krg3080u-lp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Pro-Style-30-in-4-2-cu-ft-Propane-Gas-Range-with-Sealed-Burners-and-Convection-Oven-in-Stainless-Steel-KRG3080U-LP/206215089",
        "Description": "Get ready to start cooking like a pro, because now the home chef can fire up their range with some truly serious heat. Fitting into most standard kitchens, this impressive 30 in. range boasts a 22,000 BTU convection oven, with a 15,000 BTU tube burner broiler. Enjoy more cooking power than ever before because your new Pro-Style range features one 18,000 BTU burner, one 15,000 BTU dual burner with simmer and two 12,000 BTU burners. Unleash your inner chef. Color: Classic Silver.",
        "depth": "44",
        "height": "15",
        "width": "24",
        "ratingValue": "4.7692",
        "reviewCount": "13",
        "price": 2192.87,
        "priceValidUntil": "6/21/2021"
    },
    "315492998": {
        "product_id": 315492998,
        "modelNbr": "NX60A6311SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 6.0 cu. ft. Smart Freestanding Gas Range with 18K BTU Dual Power Burner in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/699bbbbd-43d8-41cb-b922-4c0f5a0db6db/svn/stainless-steel-samsung-single-oven-gas-ranges-nx60a6311ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-6-0-cu-ft-Smart-Freestanding-Gas-Range-with-18K-BTU-Dual-Power-Burner-in-Stainless-Steel-NX60A6311SS/315492998",
        "Description": "Elevate the look of your kitchen with Samsung's new Smart Freestanding Gas Range. This large 6.0 cu. ft. oven can fit multiple dishes at one time, and can easily accommodate big casserole dishes and large roasting pans. Upgraded technology makes cooking simple and fun. Color: Stainless Steel.",
        "depth": "48",
        "height": "21.6",
        "width": "24.8",
        "ratingValue": "4.0",
        "reviewCount": "4",
        "price": 849,
        "priceValidUntil": "06/22/2021"
    },
    "315493149": {
        "product_id": 315493149,
        "modelNbr": "NX60A6711SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 6.0 cu. ft. Smart Freestanding Gas Range with Air Fry and Stainless Cooktop in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/19d90ec8-5682-42c4-8880-6ae2e69cd55a/svn/stainless-steel-samsung-single-oven-gas-ranges-nx60a6711ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-6-0-cu-ft-Smart-Freestanding-Gas-Range-with-Air-Fry-and-Stainless-Cooktop-in-Stainless-Steel-NX60A6711SS/315493149",
        "Description": "Elevate the look of your kitchen with Samsung's new Smart Freestanding Gas Range. Our stainless steel design completely covers all cooktop and backguard surfaces. Upgraded technology makes cooking simple and fun.",
        "depth": "48",
        "height": "21.6",
        "width": "24.8",
        "ratingValue": "4.2",
        "reviewCount": "10",
        "price": 1119,
        "priceValidUntil": "06/22/2021"
    },
    "302844237": {
        "product_id": 302844237,
        "modelNbr": "WFG775H0HZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Whirlpool 5.8 cu. ft. Gas Freestanding Range in Fingerprint Resistant Stainless Steel with FROZEN BAKE Technology",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/7bec71ed-a9e9-40fb-9d7f-d7125ea402ed/svn/fingerprint-resistant-stainless-steel-whirlpool-single-oven-gas-ranges-wfg775h0hz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-8-cu-ft-Gas-Freestanding-Range-in-Fingerprint-Resistant-Stainless-Steel-with-FROZEN-BAKE-Technology-WFG775H0HZ/302844237",
        "Description": "Skip preheating with FROZEN BAKE technology. This freestanding gas range with self-cleaning oven lets you cut out routine steps so you can get dinner items like pizza and lasagna and lasagna from the oven to the table faster. Get quick access to spills, too, with EZ-2-LIFT hinged grates that let you wipe up under them without removing them. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "48",
        "height": "18.13",
        "width": "24.5",
        "ratingValue": "4.4892",
        "reviewCount": "139",
        "price": 1249,
        "priceValidUntil": "6/21/2021"
    },
    "311898337": {
        "product_id": 311898337,
        "modelNbr": "GCRG3060AF",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "FRIGIDAIRE",
        "Title": "FRIGIDAIRE GALLERY 5.0 cu. ft. Gas Range with True Convection Self-Cleaning Oven in Stainless Steel with Air Fry, Smudge-Proof Stainless Steel",
        "Brand": "FRIGIDAIRE GALLERY",
        "ImageUrl": "https://images.homedepot-static.com/productImages/eb258213-e619-4492-a84a-6586e698d83c/svn/smudge-proof-stainless-steel-frigidaire-gallery-single-oven-gas-ranges-gcrg3060af-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/FRIGIDAIRE-GALLERY-5-0-cu-ft-Gas-Range-with-True-Convection-Self-Cleaning-Oven-in-Stainless-Steel-with-Air-Fry-GCRG3060AF/311898337",
        "Description": "Air Fry right in the oven for healthier and delicious meals with the Frigidaire Gallery Range. Get faster, more even baking with True Convection. Powerful gas cooktop has five burners designed to handle all cooking needs and an 18,000 BTU Quick Boil burner. Range also includes a fast steam cleaning option for a 30-minute light oven cleaning that's chemical and odor free, and a one-touch self clean option. Color: Smudge-Proof Stainless Steel.",
        "depth": "46.625",
        "height": "18.625",
        "width": "24.38",
        "ratingValue": "4.5009",
        "reviewCount": "1751",
        "price": 1249,
        "priceValidUntil": "6/21/2021"
    },
    "206195612": {
        "product_id": 206195612,
        "modelNbr": "KRG3080U",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Pro-Style 30 in. 4.2 cu. ft. Natural Gas Range with Sealed Burners and Convection Oven in Stainless Steel, Classic Silver",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/84a38d54-eac5-484d-abc9-7076fd592843/svn/classic-silver-kucht-single-oven-gas-ranges-krg3080u-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Pro-Style-30-in-4-2-cu-ft-Natural-Gas-Range-with-Sealed-Burners-and-Convection-Oven-in-Stainless-Steel-KRG3080U/206195612",
        "Description": "Get ready to start cooking like a pro, because now the home chef can fire up their range with some truly serious heat. Fitting into most standard kitchens, this impressive 30 in. range boasts a 22,000 BTU convection oven, with a 15,000 BTU tube burner broiler. Enjoy more cooking power than ever before because your new Pro-Style range features one 18,000 BTU burner, one 15,000 BTU dual burner with simmer and two 12,000 BTU burners. Unleash your inner chef. Color: Classic Silver.",
        "depth": "44",
        "height": "15",
        "width": "24",
        "ratingValue": "4.2",
        "reviewCount": "25",
        "price": 2116.12,
        "priceValidUntil": "6/21/2021"
    },
    "207175718": {
        "product_id": 207175718,
        "modelNbr": "P30S3402PS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Premier ProSeries 30 in. 3.91 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/31123f1b-baef-4767-bc29-d166077fbf59/svn/stainless-steel-premier-single-oven-gas-ranges-p30s3402ps-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-ProSeries-30-in-3-91-cu-ft-Gas-Range-in-Stainless-Steel-P30S3402PS/207175718",
        "Description": "The Premier 30 in. Freestanding Electronic Spark Ignition Gas Range is everything you want and nothing you don't. Equipped with removable (dishwasher safe) grates and removable oven bottom, this range is a cinch to keep clean. Our Fully Insulated Oven contains a Baffled Oven Burner that disperses heat uniformly and contains 2 Heavy-Duty Oven Racks with 4 Adjustable Positions. Color: Stainless Steel.",
        "depth": "43",
        "height": "15",
        "width": "25",
        "ratingValue": "4.0",
        "reviewCount": "7",
        "price": 1539.99,
        "priceValidUntil": "6/21/2021"
    },
    "314882036": {
        "product_id": 314882036,
        "modelNbr": "RGS-SN-30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "ZLINE Kitchen and Bath 30 in. 4.0 cu.ft. Gas Range with Convection Gas Oven in DuraSnow Stainless Steel Finish (RGS-SN-30)",
        "Brand": "ZLINE Kitchen and Bath",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e5cdb22b-bead-4ec8-b96b-18ec8280609b/svn/durasnow-stainless-steel-zline-kitchen-and-bath-single-oven-gas-ranges-rgs-sn-30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/ZLINE-Kitchen-and-Bath-30-in-4-0-cu-ft-Gas-Range-with-Convection-Gas-Oven-in-DuraSnow-Stainless-Steel-Finish-RGS-SN-30-RGS-SN-30/314882036",
        "Description": "Experience Attainable Luxury with the ZLINE DuraSnow All Gas Professional Range. Combining both professional aesthetics and functionality, this range provides the ultimate luxury experience for a fraction of the cost. Achieve optimal results with cooktop cooking power from 4,200 up to 18,000 BTUs provided with sealed burners. Ignite your culinary experience with an all gas oven, allowing for a faster, more efficient heat and moisture distribution. Enjoy an ultra-deep oven capacity with a three-layered insulated glass oven for even, precise cooking every use. With upgraded premium features such as SmoothSlide ball-bearing oven racks, dual lighting, and adjustable legs, this range is certain to wow both the chef and guests alike. Assembled with the highest quality materials on the market, this range offers a durable, scratch-resistant porcelain cooktop and ZLINE's exclusive single piece cast iron grate. Cook with ease with StayPut Italian hinges, providing a safe baking environment to enjoy for years to come. ZLINE stands by the longevity and durability of their professional ranges, while ensuring further protection and peace of mind with a worry-free warranty. The ZLINE All Gas Range ships next business day when in stock. Color: DuraSnow Stainless Steel.",
        "depth": "39.5",
        "height": "14",
        "width": "26.5",
        "ratingValue": "4.7895",
        "reviewCount": "38",
        "price": 2124.96,
        "priceValidUntil": "06/30/2021"
    },
    "304543054": {
        "product_id": 304543054,
        "modelNbr": "HGR30BSSSLP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 30 in. 3.0 cu. ft. Single Oven Italian Gas Range with True Convection, 5 Burners, LP Gas, Brass Trim in Stainless Steel, Silver",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/fe8030fe-6126-4b4d-8cf5-c00ea83f1102/svn/stainless-steel-hallman-single-oven-gas-ranges-hgr30bssslp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-30-in-3-0-cu-ft-Single-Oven-Italian-Gas-Range-with-True-Convection-5-Burners-LP-Gas-Brass-Trim-in-Stainless-Steel-HGR30BSSSLP/304543054",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The five sealed Italian brass burners provide a perfect blend of power and precision, with infinite heat setting capability ranging from a searing 15,500 BTU, down to simmering 1260 BTU. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie hardware and triple-pane glass window for added safety that can easily be removed for cleaning. Beneath the oven there is a full-width drawer designed to keep dishes warm between 125 - 200 before serving. Traditional manual controls and durable components minimize costly service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to suit your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy, our classic European design will create an elegant focal point to every kitchen they adorn. Color: Stainless Steel.",
        "depth": "37",
        "height": "14",
        "width": "21.2598",
        "ratingValue": "2.3333",
        "reviewCount": "3",
        "price": 3299,
        "priceValidUntil": "6/21/2021"
    },
    "302848111": {
        "product_id": 302848111,
        "modelNbr": "WFG975H0HZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Whirlpool 5.8 cu. ft. Smart Gas Freestanding Range in Fingerprint Resistant Stainless Steel with EZ-2-LIFT Grates",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/8a91d142-d819-44f8-bb4f-6d8d4f8b66f3/svn/fingerprint-resistant-stainless-steel-whirlpool-single-oven-gas-ranges-wfg975h0hz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-8-cu-ft-Smart-Gas-Freestanding-Range-in-Fingerprint-Resistant-Stainless-Steel-with-EZ-2-LIFT-Grates-WFG975H0HZ/302848111",
        "Description": "Cut out routine steps and get the right settings every time with this smart oven. Scan-to-Cook technology lets you send recommended or customized cooking instructions straight to the oven. This freestanding gas range with self-cleaning oven also has EZ-2-LIFT hinged grates to give you quick access to cooktop spills for easy cleanup. (Wi-Fi and App required. Features subject to change. For details and privacy statement, visit Whirlpool.com/connect.). Color: Fingerprint Resistant Stainless Steel.",
        "depth": "48",
        "height": "20",
        "width": "24.38",
        "ratingValue": "4.2566",
        "reviewCount": "113",
        "price": 1399,
        "priceValidUntil": "6/21/2021"
    },
    "314114523": {
        "product_id": 314114523,
        "modelNbr": "EMP-30GR03",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Empava Pro-Style Freestanding 30 in. 4.2 cu.ft. Single Oven Gas Range with 4 Sealed Burners in Stainless Steel, Silver",
        "Brand": "Empava",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c3e6bb2c-e526-4fb0-ad75-26f5a6d4f009/svn/stainless-steel-empava-single-oven-gas-ranges-emp-30gr03-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Empava-Pro-Style-Freestanding-30-in-4-2-cu-ft-Single-Oven-Gas-Range-with-4-Sealed-Burners-in-Stainless-Steel-EMP-30GR03/314114523",
        "Description": "Next high-end US & Canada CSA certified 30 in. gas range (single oven and 4 Burners combination) by Empava Appliances Inc., it's the real \"secret weapon\" behind many great meals. Let this gas operated ultimate appliance give you the utmost in cooking flexibility and help you cook like a professional chef in your own home. Color: Stainless Steel.",
        "depth": "44.5",
        "height": "15.25",
        "width": "24",
        "ratingValue": "5.0",
        "reviewCount": "3",
        "price": 2199.99,
        "priceValidUntil": "6/21/2021"
    },
    "306757811": {
        "product_id": 306757811,
        "modelNbr": "FFGH3054US",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "SLIDE IN GAS",
        "Type2": "ELECTROLUX",
        "Title": "Frigidaire 30 in. 5.0 cu. ft. Single Oven Gas Range with Self-Cleaning Oven in Stainless Steel, Silver",
        "Brand": "Frigidaire",
        "ImageUrl": "https://images.homedepot-static.com/productImages/07f84a92-eabf-49fc-9439-f82c598d3c78/svn/stainless-steel-frigidaire-single-oven-gas-ranges-ffgh3054us-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Frigidaire-30-in-5-0-cu-ft-Single-Oven-Gas-Range-with-Self-Cleaning-Oven-in-Stainless-Steel-FFGH3054US/306757811",
        "Description": "The Frigidaire 30 in. Freestanding Front-Control Gas Range offers a 5.0 cu. ft. capacity oven and 5-burner gas cook top so you can cook more at once. Get meals on the table faster with our 17,000 BTU burner that boils faster than the traditional setting. Continuous grates make it easy to move heavy pots and pans between burners without lifting. Upgrade your kitchen and get the look of a built-in range, with the fit of a traditional freestanding range. The Frigidaire front-control freestanding range easily fits into 30 in. cutouts. Color: Stainless Steel.",
        "depth": "45",
        "height": "18.625",
        "width": "24.38",
        "ratingValue": "4.4318",
        "reviewCount": "850",
        "price": 1299,
        "priceValidUntil": "6/21/2021"
    },
    "313241905": {
        "product_id": 313241905,
        "modelNbr": "JGBS61RPSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 4.8 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/47010ba5-8df7-40b9-8e10-88e29c05c0a2/svn/stainless-steel-ge-single-oven-gas-ranges-jgbs61rpss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-4-8-cu-ft-Gas-Range-in-Stainless-Steel-JGBS61RPSS/313241905",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: Stainless Steel.",
        "depth": "46.25",
        "height": "18.5",
        "width": "24",
        "ratingValue": "4.4887",
        "reviewCount": "309",
        "price": 674,
        "priceValidUntil": "06/22/2021"
    },
    "311373984": {
        "product_id": 311373984,
        "modelNbr": "WFG535S0JS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "WHIRLPOOL",
        "Title": "Whirlpool 30 in. 5.0 cu. ft. Gas Range with Fan Convection Cooking in Stainless Steel, Silver",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/89861075-be73-42b1-b6e4-ea971641bedd/svn/stainless-steel-whirlpool-single-oven-gas-ranges-wfg535s0js-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-30-in-5-0-cu-ft-Gas-Range-with-Fan-Convection-Cooking-in-Stainless-Steel-WFG535S0JS/311373984",
        "Description": "This Whirlpool gas convection oven with fan convection cooking, SpeedHeat burner and center oval burner helps get dinner to the table. This self cleaning oven also prevents cooked food from getting cold with a Warm Zone element. Plus, its easy to keep the cooktop clean with dishwasher-safe cast-iron grates. Color: Stainless Steel.",
        "depth": "46.56",
        "height": "18.88",
        "width": "24.5",
        "ratingValue": "4.5735",
        "reviewCount": "136",
        "price": 999,
        "priceValidUntil": "6/21/2021"
    },
    "304517916": {
        "product_id": 304517916,
        "modelNbr": "HGR30BZWT",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Hallman 30 in. 3.0 cu. ft. Single Oven Italian Gas Range with True Convection, 5 Burners, Bronze Trim in White, Whtie",
        "Brand": "Hallman",
        "ImageUrl": "https://images.homedepot-static.com/productImages/a27c8b34-d414-48f5-892b-1126225724c3/svn/whtie-hallman-single-oven-gas-ranges-hgr30bzwt-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Hallman-30-in-3-0-cu-ft-Single-Oven-Italian-Gas-Range-with-True-Convection-5-Burners-Bronze-Trim-in-White-HGR30BZWT/304517916",
        "Description": "Hallman Professional Ranges marry elegant design with impeccable cooking performance. The five sealed Italian brass burners provide a perfect blend of power and precision, with infinite heat setting capability ranging from a searing 15,500 BTU, down to simmering 1260 BTU. Heavy-duty cast-iron grates provide a single continuous cooking surface, making it easy and safe to maneuver cookware from one burner to another. The 3 cu. ft. true European convection oven provides even heat distribution for perfect results, complete with convection bake, convection broil, grill baking, and standard bake functions. In addition, the oven includes electric rotisserie hardware and triple-pane glass window for added safety that can easily be removed for cleaning. Beneath the oven there is a full-width drawer designed to keep dishes warm between 125 - 200 before serving. Traditional manual controls and durable components minimize costly service repairs over the lifespan of the product. Hallman ranges are available in an array of colors and configurations with unique options and accessories, allowing the ability to customize to suit your taste. Hallman is the premium brand engineered for those who are passionate about cooking with the finest quality. Decades of proven craftsmanship ensure every Hallman range will be in service and style for generations. Handmade in Italy, our classic European design will create an elegant focal point to every kitchen they adorn. Color: Whtie.",
        "depth": "37",
        "height": "14",
        "width": "21.2598",
        "ratingValue": "5.0",
        "reviewCount": "2",
        "price": 3499,
        "priceValidUntil": "6/21/2021"
    },
    "206290120": {
        "product_id": 206290120,
        "modelNbr": "LDG4313ST",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "LG",
        "Title": "LG Electronics 6.9 cu. ft. Double Oven Gas Range with ProBake Convection Oven, Self Clean and EasyClean in Stainless Steel, Silver",
        "Brand": "LG Electronics",
        "ImageUrl": "https://images.homedepot-static.com/productImages/607ba95e-0767-435a-934a-41a81e2cf816/svn/stainless-steel-lg-electronics-double-oven-gas-ranges-ldg4313st-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/LG-Electronics-6-9-cu-ft-Double-Oven-Gas-Range-with-ProBake-Convection-Oven-Self-Clean-and-EasyClean-in-Stainless-Steel-LDG4313ST/206290120",
        "Description": "The huge, 6.9 cu. ft. combined capacity gives you the freedom to create the ultimate meal, cooking multiple dishes at different temperatures. And never mind babysitting or rotating pans-LG ProBake Convection ensures no dish gets left behind with even cooking on every rack, every time. This range's pro-style looks are easy to maintain with 10-minute EasyClean Express, so you can spend more time enjoying meals, less time scrubbing. Color: Stainless Steel.",
        "depth": "40.93",
        "height": "14.25",
        "width": "24.81",
        "ratingValue": "4.4027",
        "reviewCount": "730",
        "price": 1699,
        "priceValidUntil": "6/21/2021"
    },
    "207173043": {
        "product_id": 207173043,
        "modelNbr": "P24B3102PS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Premier ProSeries 24 in. 2.97 cu. ft. Freestanding Gas Range with Sealed Burners in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/bd8d25a7-d3f6-4b0c-b545-9a9b051bb697/svn/stainless-steel-premier-single-oven-gas-ranges-p24b3102ps-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-ProSeries-24-in-2-97-cu-ft-Freestanding-Gas-Range-with-Sealed-Burners-in-Stainless-Steel-P24B3102PS/207173043",
        "Description": "The Premier 24 in. Freestanding Battery Spark Ignition Gas Range brings you the features you need while accommodating a smaller kitchen space, and requires NO electricity to operate. Equipped with removable (dishwasher safe) grates and removable oven bottom, this range is a cinch to keep clean. Our Fully Insulated Oven contains a Baffled Oven Burner that disperses heat uniformly and contains 2 Heavy-Duty Oven Racks with 4 Adjustable Positions. Color: Stainless Steel.",
        "depth": "43",
        "height": "15",
        "width": "19",
        "ratingValue": "2.5",
        "reviewCount": "4",
        "price": 1449,
        "priceValidUntil": "6/21/2021"
    },
    "308797875": {
        "product_id": 308797875,
        "modelNbr": "RG30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "ZLINE Kitchen and Bath ZLINE 30 in. 4.0 cu. ft. Range with Gas Stove and Gas Oven in Stainless Steel (RG30), Silver",
        "Brand": "ZLINE Kitchen and Bath",
        "ImageUrl": "https://images.homedepot-static.com/productImages/86332878-10b1-41c6-9d6c-88bcfb8f45fc/svn/stainless-steel-zline-kitchen-and-bath-single-oven-gas-ranges-rg30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/ZLINE-Kitchen-and-Bath-ZLINE-30-in-4-0-cu-ft-Range-with-Gas-Stove-and-Gas-Oven-in-Stainless-Steel-RG30-RG30/308797875",
        "Description": "Experience Attainable Luxury with the ZLINE All Gas Professional Range. Combining both professional aesthetics and functionality, this range provides the ultimate luxury experience for a fraction of the cost. Achieve optimal results with cooktop cooking power from 4,200 up to 18,000 BTUs provided with sealed burners. Ignite your culinary experience with an all gas oven, allowing for a faster, more efficient heat and moisture distribution. Enjoy an ultra-deep oven capacity with a three-layered insulated glass oven for even, precise cooking every use. With upgraded premium features such as SmoothSlide ball-bearing oven racks, dual lighting, and adjustable legs, this range is certain to wow both the chef and guests alike. Assembled with the highest quality materials on the market, this range offers a durable, scratch-resistant porcelain cooktop and ZLINE's exclusive single piece cast iron grate. Cook with ease with StayPut Italian hinges, providing a safe baking environment to enjoy for years to come. ZLINE stands by the longevity and durability of their professional ranges, while ensuring further protection and peace of mind with a worry-free warranty. The ZLINE All Gas Range ships next business day when in stock. Color: Stainless Steel.",
        "depth": "45.5",
        "height": "15",
        "width": "26.5",
        "ratingValue": "4.0446",
        "reviewCount": "112",
        "price": 1954.96,
        "priceValidUntil": "06/30/2021"
    },
    "206943135": {
        "product_id": 206943135,
        "modelNbr": "JGBS66REKSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 5.0 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c146bc45-9799-4e56-8a26-e967cc0b4790/svn/stainless-steel-ge-single-oven-gas-ranges-jgbs66rekss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-5-0-cu-ft-Gas-Range-in-Stainless-Steel-JGBS66REKSS/206943135",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: Stainless Steel.",
        "depth": "46.25",
        "height": "19",
        "width": "24",
        "ratingValue": "4.6592",
        "reviewCount": "11805",
        "price": 764,
        "priceValidUntil": "06/22/2021"
    },
    "205078350": {
        "product_id": 205078350,
        "modelNbr": "AGR5330BAS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "AMANA",
        "Title": "Amana 5.1 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "Amana",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d69b0f18-a770-4931-b78c-05a9d54019ef/svn/stainless-steel-amana-single-oven-gas-ranges-agr5330bas-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Amana-5-1-cu-ft-Gas-Range-in-Stainless-Steel-AGR5330BAS/205078350",
        "Description": "With this Amana 5.1 cu. ft. gas range you can enjoy having the room to cook everything from weekday meals to family feasts. The SpillSaver upswept cooktop contains messy spills. And the sealed burners make cleanup simple. Plus, thanks to the large oven window and oven light, you can monitor cooking progress without opening the door and disturbing the oven temperature. Color: Stainless Steel.",
        "depth": "45.21",
        "height": "18.38",
        "width": "19",
        "ratingValue": "3.9604",
        "reviewCount": "1187",
        "price": 749,
        "priceValidUntil": "6/21/2021"
    },
    "207173057": {
        "product_id": 207173057,
        "modelNbr": "P24S3102PS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Premier ProSeries 24 in. 2.97 cu. ft. Freestanding Gas Range with Sealed Burners in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f67dddc8-375e-4d41-beca-0979adc31731/svn/stainless-steel-premier-single-oven-gas-ranges-p24s3102ps-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-ProSeries-24-in-2-97-cu-ft-Freestanding-Gas-Range-with-Sealed-Burners-in-Stainless-Steel-P24S3102PS/207173057",
        "Description": "The Premier 24 in. Freestanding Electronic Spark Ignition Gas Range brings you the features you need while accommodating a smaller kitchen space. Equipped with removable (dishwasher safe) grates and removable oven bottom, this range is a cinch to keep clean. Our Fully Insulated Oven contains a Baffled Oven Burner that disperses heat uniformly and contains 2 Heavy-Duty Oven Racks with 4 Adjustable Positions. Color: Stainless Steel.",
        "depth": "43",
        "height": "15",
        "width": "19",
        "ratingValue": "3.4",
        "reviewCount": "5",
        "price": 1534.49,
        "priceValidUntil": "6/21/2021"
    },
    "313882300": {
        "product_id": 313882300,
        "modelNbr": "HGS8055UC",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Bosch 30 in. 3.7 cu. ft. Industrial Style Gas Range with 5-Burners in Stainless Steel, Silver",
        "Brand": "Bosch",
        "ImageUrl": "https://images.homedepot-static.com/productImages/eb905d7e-e597-4d90-8566-37e13fd1641f/svn/stainless-steel-bosch-single-oven-gas-ranges-hgs8055uc-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Bosch-30-in-3-7-cu-ft-Industrial-Style-Gas-Range-with-5-Burners-in-Stainless-Steel-HGS8055UC/313882300",
        "Description": "The new 800 series Industrial-style, 30 in. stainless steel gas range offers a stunning design with the versatility to fit any kitchen style. This freestanding range with pedestal-style feet makes a beautiful focal point. And high performance features that are engineered for precision and reliability, bring ease to every day cooking.",
        "depth": "0",
        "height": "15.94",
        "width": "24.19",
        "ratingValue": "4.1429",
        "reviewCount": "7",
        "price": 3399,
        "priceValidUntil": "6/21/2021"
    },
    "315781219": {
        "product_id": 315781219,
        "modelNbr": "KFX300/LP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Professional 30 in. 4.2 cu. ft. Propane Gas Range with Power Burner and Convection Oven in Stainless Steel, Silver",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e3bdf4fc-a011-4642-9232-2f10b97d0949/svn/stainless-steel-kucht-single-oven-gas-ranges-kfx300-lp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Professional-30-in-4-2-cu-ft-Propane-Gas-Range-with-Power-Burner-and-Convection-Oven-in-Stainless-Steel-KFX300-LP/315781219",
        "Description": "Introducing the new KFX series: Combining design, high performance and safety. Resistant, intuitive, modern and elegant, the 30 in. model provides amazing capacity for its size. Our new KFX300 is a gorgeous focal point for your kitchen and allows a combination of burners, one with high BTUs for fast stir-frying and one with super-low BTUs for simmering, to help you get that perfect flavor. One of the featured burners is a heavy duty 21,000 BTU rocket power burner that provides evenly distributed heat and plenty of power to use a home WOK or medium paella pan with professional results. The oven interior is covered with fine blue porcelain and the heavy duty stainless steel racks are adjustable and telescopic, creating ease of use and even easy to clean. This high powered model was designed to function with Kucht's ignition, using an auto-reignition system that ignites every time with ease and automatically reignites any time a flame burns out. The range top's continuous grates covers the 4 burners and allows you to move your kitchen utensils safely and with ease. You can slide the heaviest pots and pans on the rails without even having to lift them. The new KFX300 gas range offers massive power and flexibility in a small size design to bring the most elaborated recipes to life at your own kitchen. This extremely powerful and easy to use gas range will allow you to cook any recipe with the same quality, precision and speed of a chef.",
        "depth": "44.25",
        "height": "15",
        "width": "24",
        "ratingValue": "5.0",
        "reviewCount": "3",
        "price": 2720.25,
        "priceValidUntil": "06/30/2021"
    },
    "300144108": {
        "product_id": 300144108,
        "modelNbr": "AGR6603SFS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Amana 5.0 cu. ft. Gas Range in Stainless Steel, Silver",
        "Brand": "Amana",
        "ImageUrl": "https://images.homedepot-static.com/productImages/1dfe63ff-0279-49a3-9147-3a54660b7e20/svn/stainless-steel-amana-single-oven-gas-ranges-agr6603sfs-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Amana-5-0-cu-ft-Gas-Range-in-Stainless-Steel-AGR6603SFS/300144108",
        "Description": "This 30 in. Amana Gas Range with 5.0 cu. ft. Capacity lets you melt, boil and simmer all at once with a Versatile Cooktop. Use Bake Assist Temps to take care of dessert at the same time. Simply pick a preset temperature setting to get started. And when it's time for cleanup, use the Self-Clean Option to let the oven do the dirty work for you. Color: Stainless Steel.",
        "depth": "46.56",
        "height": "18.13",
        "width": "24.5",
        "ratingValue": "4.4471",
        "reviewCount": "170",
        "price": 899,
        "priceValidUntil": "6/21/2021"
    },
    "313246979": {
        "product_id": 313246979,
        "modelNbr": "JGBS86SPSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 6.8 cu. ft. Double Oven Gas Range with Steam-Cleaning Convection Oven in Stainless Steel, Silver",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/89371482-f572-4056-bab1-248860ee593d/svn/stainless-steel-ge-double-oven-gas-ranges-jgbs86spss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-6-8-cu-ft-Double-Oven-Gas-Range-with-Steam-Cleaning-Convection-Oven-in-Stainless-Steel-JGBS86SPSS/313246979",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: Stainless Steel.",
        "depth": "43.5",
        "height": "15",
        "width": "24",
        "ratingValue": "4.6089",
        "reviewCount": "381",
        "price": 1438,
        "priceValidUntil": "06/22/2021"
    },
    "206942967": {
        "product_id": 206942967,
        "modelNbr": "JGBS60DEKWW",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 4.8 cu. ft. Gas Range in White",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d6dd9aab-f44b-407a-9d99-5e0a913f286e/svn/white-ge-single-oven-gas-ranges-jgbs60dekww-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-4-8-cu-ft-Gas-Range-in-White-JGBS60DEKWW/206942967",
        "Description": "Your GE 30 in. 4.8 cu. ft. Gas Range in White has a Precise Simmer burner to allow cooking of delicate foods with low, even heat. This four-burner range with Broiler Drawer gives you enough room to cook an entire meal at once. Electronic Touch oven controls let you to set temperatures easily for any baking/roasting functions. The one-piece upswept cooktop makes cleanups easy. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances adds allure and functionality to any kitchen.",
        "depth": "46.25",
        "height": "18.5",
        "width": "24",
        "ratingValue": "4.4423",
        "reviewCount": "1578",
        "price": 584,
        "priceValidUntil": "06/22/2021"
    },
    "315491750": {
        "product_id": 315491750,
        "modelNbr": "NX60A6111SS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "SAMSUNG",
        "Title": "Samsung 6.0 cu. ft. Smart Freestanding Gas Range with Integrated Griddle in Stainless Steel, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/7a38d738-879c-40c4-801e-5775f199a081/svn/stainless-steel-samsung-single-oven-gas-ranges-nx60a6111ss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-6-0-cu-ft-Smart-Freestanding-Gas-Range-with-Integrated-Griddle-in-Stainless-Steel-NX60A6111SS/315491750",
        "Description": "Elevate the look of your kitchen with Samsung's new Smart Freestanding Gas Range. This large 6.0 cu. ft. oven can fit multiple dishes at one time, and can easily accommodate big casserole dishes and large roasting pans. Upgraded technology makes cooking simple and fun. Color: Stainless Steel.",
        "depth": "48",
        "height": "21.6",
        "width": "24.8",
        "ratingValue": "4.8889",
        "reviewCount": "9",
        "price": 718,
        "priceValidUntil": "06/22/2021"
    },
    "314138054": {
        "product_id": 314138054,
        "modelNbr": "JGB735DPWW",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "GE",
        "Title": "30 in. 5.0 cu. ft. Gas Range with Self-Cleaning Convection Oven and Air Fry in White",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/25a74e38-e9ea-40d6-8cae-872139c3d5c0/svn/white-ge-single-oven-gas-ranges-jgb735dpww-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-30-in-5-0-cu-ft-Gas-Range-with-Self-Cleaning-Convection-Oven-and-Air-Fry-in-White-JGB735DPWW/314138054",
        "Description": "At GE Appliances, we bring good things to life, by designing and building the world's best appliances. Our goal is to help people improve their lives at home by providing quality appliances that were made for real life. Whether it's enjoying the tradition of making meals from scratch or tackling a mountain of muddy jeans and soccer jerseys, GE Appliances are crafted to support any and every task in the home. Color: White.",
        "depth": "46.25",
        "height": "19",
        "width": "24",
        "ratingValue": "4.6843",
        "reviewCount": "2319",
        "price": 1149,
        "priceValidUntil": "6/21/2021"
    },
    "302863073": {
        "product_id": 302863073,
        "modelNbr": "WFG550S0HZ",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "MAYTAG",
        "Title": "Whirlpool 5 cu. ft. Gas Range with Fan Convection Cooking in Fingerprint Resistant Stainless Steel",
        "Brand": "Whirlpool",
        "ImageUrl": "https://images.homedepot-static.com/productImages/b849c5cb-f9ab-4132-b4b2-6c6ad07f26f7/svn/fingerprint-resistant-stainless-steel-whirlpool-single-oven-gas-ranges-wfg550s0hz-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Whirlpool-5-cu-ft-Gas-Range-with-Fan-Convection-Cooking-in-Fingerprint-Resistant-Stainless-Steel-WFG550S0HZ/302863073",
        "Description": "Cook for the family, even on a hectic schedule with this Whirlpool brand gas range. Skip preheating and cook frozen foods faster with FROZEN BAKE technology. Fan convection cooking on this Whirlpool brand gas range helps eliminate cold spots so you can bake on any rack, while the Keep Warm setting helps finished dishes stay ready to serve in the self-cleaning oven. Color: Fingerprint Resistant Stainless Steel.",
        "depth": "46.63",
        "height": "18.88",
        "width": "24.5",
        "ratingValue": "4.4924",
        "reviewCount": "591",
        "price": 1099,
        "priceValidUntil": "6/21/2021"
    },
    "315781215": {
        "product_id": 315781215,
        "modelNbr": "KFX300",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "OTHER",
        "Title": "Kucht Professional 30 in. 4.2 cu. ft. Natural Gas Range with Power Burner and Convection Oven in Stainless Steel, Silver",
        "Brand": "Kucht",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e3bdf4fc-a011-4642-9232-2f10b97d0949/svn/stainless-steel-kucht-single-oven-gas-ranges-kfx300-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Kucht-Professional-30-in-4-2-cu-ft-Natural-Gas-Range-with-Power-Burner-and-Convection-Oven-in-Stainless-Steel-KFX300/315781215",
        "Description": "Introducing the new KFX series: Combining design, high performance, and safety. Resistant, intuitive, modern, and elegant, the 30 in. model provides amazing capacity for its size. Our new KFX300 is a gorgeous focal point for your kitchen and allows a combination of burners, one with high BTUs for fast stir-frying, and one with super-low BTUs for simmering, to help you get that perfect flavor. One of the featured burners is a heavy duty 21,000 BTU Rocket Power Burner that provides evenly distributed heat and plenty of power to use a home WOK or medium Paella Pan with professional results. The oven interior is covered with fine blue porcelain, and the heavy duty stainless steel racks are adjustable and telescopic, creating ease of use and even easy to clean. This high powered model was designed to function with Kucht's Ignition, using an auto-reignition system that ignites every time with ease, and automatically reignites any time a flame burns out. The range top's continuous grates covers the 4 burners and allows you to move your kitchen utensils safely and with ease. You can slide the heaviest pots and pans on the rails without even having to lift them. The new KFX300 Gas Range offers massive power and flexibility in a small size design to bring the most elaborated recipes to life at your own kitchen. This extremely powerful and easy to use Gas Range will allow you to cook any recipe with the same quality, precision, and speed of a chef.",
        "depth": "44.25",
        "height": "15",
        "width": "24",
        "ratingValue": "5.0",
        "reviewCount": "4",
        "price": 2557.5,
        "priceValidUntil": "06/30/2021"
    },
    "311780769": {
        "product_id": 311780769,
        "modelNbr": "KFGC500JSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING GAS",
        "Type2": "KITCHENAID",
        "Title": "KitchenAid 30 in. 4.1 cu. ft. Smart Commercial-Style Gas Range with Self-Cleaning and True Convection in Stainless Steel, Silver",
        "Brand": "KitchenAid",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3cc5bab4-cd09-483c-8c13-6602bedfcdfa/svn/stainless-steel-kitchenaid-single-oven-gas-ranges-kfgc500jss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/KitchenAid-30-in-4-1-cu-ft-Smart-Commercial-Style-Gas-Range-with-Self-Cleaning-and-True-Convection-in-Stainless-Steel-KFGC500JSS/311780769",
        "Description": "Empower your creativity with a 30 in. KitchenAid Commercial Style Range with 4-burners. This gas range features two versatile 20,000 BTU Ultra Power Dual-Flame Burners with the power and precision needed to successfully sear, simmer, stir-fry and saut. Even-Heat True Convection helps you achieve more consistent baking and roasting. Color: Stainless Steel.",
        "depth": "46.5",
        "height": "14.3",
        "width": "24",
        "ratingValue": "4.2222",
        "reviewCount": "36",
        "price": 4299,
        "priceValidUntil": "6/21/2021"
    }
}