{
    "204489380": {
        "product_id": 204489380,
        "modelNbr": "TEM110BRWY",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKING S/O",
        "Type2": "OTHER",
        "Title": "Summit Appliance 20 in. 2.5 cu. ft. Slide-In Electric Range in Stainless Steel, Silver",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/c4835397-a40f-4cf1-87ef-e0acf769d2c2/svn/stainless-steel-summit-appliance-single-oven-electric-ranges-tem110brwy-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-20-in-2-5-cu-ft-Slide-In-Electric-Range-in-Stainless-Steel-TEM110BRWY/204489380",
        "Description": "Summit Professional brings luxury to apartment sized ranges with our exclusive line of 'slide-in' look ovens. The TEM110BRWY electric range is conveniently sized at just 20 in. wide to fit into even the tightest of kitchen spaces. Elegant stainless steel doors on the oven and lower storage compartment are matched with solid towel bar style handles. Our 'slide-in' units have a low stainless top frame that lets you customize the wall behind your range without planning around a backguard. A stainless steel manifold completes the modern look. Solidly constructed from black porcelain and steel, the TEM110BRWY is easy to clean and striking to view. The oven has a clear window and light so you can keep a watch on your cooking. Enjoy the best meals in unique style with lasting durability.",
        "depth": "40",
        "height": "14",
        "width": "16",
        "ratingValue": "3.6667",
        "reviewCount": "12",
        "price": 968.75,
        "priceValidUntil": "7/4/2021"
    },
    "316697226": {
        "product_id": 316697226,
        "modelNbr": "REX2071SSRT1",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING ELECTRIC",
        "Type2": "OTHER",
        "Title": "Summit Appliance 20 in. 2.3 cu. ft. Slide-In Electric Range in Stainless Steel, Silver",
        "ImageUrl": "https://images.homedepot-static.com/productImages/4ecaf711-5a17-4cf3-b2d1-f56f965df852/svn/stainless-steel-summit-appliance-single-oven-electric-ranges-rex2071ssrt1-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-20-in-2-3-cu-ft-Slide-In-Electric-Range-in-Stainless-Steel-REX2071SSRT1/316697226",
        "Description": "Summit's slim-fitting ranges bring true efficiency to smaller kitchens. Model REX2071SSRT1 is a 20 in. wide 220-Volt electric range with a smooth ceramic glass cooking surface complete with 4 1200-Watt elements. Sized just over 24 in. deep, it's ideal for apartments, tiny homes, hotels, and other kitchens with limited space. It ships with a short stainless steel back guard that can be removed to create a more traditional slide-in look. The large oven includes 2 adjustable racks and a waist-high broiler that allows you to switch from bake to broil without moving your dishes. The large oven window and interior light let you monitor your cooking without opening the door to release heat and disrupt the baking process. Upfront push-to-turn controls ensure you won't have to reach over the hot surface to adjust, helping to comply with ADA guidelines for accessibility. Indicator lights on the control panel show when a burner or the oven is on and if the surface is still hot. The stainless steel doors with black accents bring a modern look ideal for any kitchen. This unit is constructed from porcelain and steel for lasting durability. It does not include a power cord but is compatible with standard 40 amp range cords (3 or 4-wire). Additional slim-fitting ranges and matching range hoods are available. Note: this unit does not include a lower storage compartment.",
        "depth": "44.25",
        "height": "15.25",
        "width": "15",
        "ratingValue": "4.6667",
        "reviewCount": "3",
        "price": 1230,
        "priceValidUntil": "7/4/2021"
    },
    "300052107": {
        "product_id": 300052107,
        "modelNbr": "EAS7X0BP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING ELECTRIC",
        "Type2": "OTHER",
        "Title": "Premier 20 in. 2.42 cu. ft. Freestanding Smooth Top Electric Range in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/589b6a26-7cc5-41fb-a5bd-5de0d65001be/svn/stainless-steel-premier-single-oven-electric-ranges-eas7x0bp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-20-in-2-42-cu-ft-Freestanding-Smooth-Top-Electric-Range-in-Stainless-Steel-EAS7X0BP/300052107",
        "Description": "The Premier 20 in. Freestanding Smooth Top Electric Range puts all the features and convenience of a full-size range into a unit that will accommodate even the most intimate of kitchen spaces. All Premier ranges come with an Exclusive Lifetime Warranty on all Top Burner Elements - Your assurance that you are purchasing a top quality product. Color: Stainless Steel.",
        "depth": "41",
        "height": "14.5",
        "width": "16",
        "ratingValue": "3.0",
        "reviewCount": "10",
        "price": 1139.99,
        "priceValidUntil": "7/4/2021"
    },
    "202694702": {
        "product_id": 202694702,
        "modelNbr": "TEM130BKWY",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKING S/O",
        "Type2": "OTHER",
        "Title": "Summit Appliance 20 in. 2.46 cu. ft. Electric Range in Stainless Steel, Silver",
        "Brand": "SUMMIT APPLIANCE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/f2a13d74-d8ac-415b-8f58-dedef8544cc8/svn/stainless-steel-summit-appliance-single-oven-electric-ranges-tem130bkwy-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Summit-Appliance-20-in-2-46-cu-ft-Electric-Range-in-Stainless-Steel-TEM130BKWY/202694702",
        "Description": "SUMMIT PROFESSIONAL brings pure luxury to apartment sized ranges with durable stainless steel in refined style. The TEM130BKWY electric range has a slim width of just 20 in. to fit into space conscious kitchens. Stainless steel doors dress the deep oven, with solid towel bar handles adding a modern touch to the exterior. A stainless steel toe plate and black porcelain surface simplify clean-up while maximizing beauty. Full features include coil elements and a digital clock with timer. The oven window has a light for the most precise baking. Black manifold, stainless steel knobs, and deluxe backguard make this model the ideal in function and elegance.",
        "depth": "40",
        "height": "14",
        "width": "16",
        "ratingValue": "2.8571",
        "reviewCount": "14",
        "price": 889,
        "priceValidUntil": "7/4/2021"
    },
    "311571219": {
        "product_id": 311571219,
        "modelNbr": "ERU200P3S",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING ELECTRIC",
        "Type2": "OTHER",
        "Title": "Avanti 20 in. 2.1 cu. ft. Single Oven Electric Range in Stainless Steel, Silver",
        "Brand": "Avanti",
        "ImageUrl": "https://images.homedepot-static.com/productImages/a6db5abd-b3b6-4ea4-b7de-345a882b1ed6/svn/stainless-steel-avanti-single-oven-electric-ranges-eru200p3s-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Avanti-20-in-2-1-cu-ft-Single-Oven-Electric-Range-in-Stainless-Steel-ERU200P3S/311571219",
        "Description": "This Avanti 20 in. Electric Range Comes with a Backsplash and Storage Drawer. It features 4 coil burners, 2.1 cu. ft. capacity, deluxe see-thru glass oven door, oven cavity light, a backsplash and leveling legs. Color: Stainless Steel.",
        "depth": "39",
        "height": "25",
        "width": "18",
        "ratingValue": "3.75",
        "reviewCount": "8",
        "price": 666.07,
        "priceValidUntil": "7/4/2021"
    },
    "202988062": {
        "product_id": 202988062,
        "modelNbr": "EAK600BP",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "FREE STANDING ELECTRIC",
        "Type2": "OTHER",
        "Title": "Premier 20 in. 2.42 cu. ft. Electric Range in Stainless Steel, Silver",
        "Brand": "PREMIER",
        "ImageUrl": "https://images.homedepot-static.com/productImages/6ac0fea0-beec-4b47-bf03-a718e4579c41/svn/stainless-steel-premier-single-oven-electric-ranges-eak600bp-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Premier-20-in-2-42-cu-ft-Electric-Range-in-Stainless-Steel-EAK600BP/202988062",
        "Description": "The Premier 20 in. Freestanding Electric Range puts all the features and convenience of a full-size range into a unit that will accommodate even the most intimate of kitchen spaces. All Premier ranges come with an Exclusive Lifetime Warranty on all Top Burner Elements - Your assurance that you are purchasing a top quality product. Equipped with a lift-up cook top and support rod, this range is a cinch to keep clean. Safety features like the Surface Indicator Light, will let you know at a glance if cooktop burners are on. Our \"Keep Warm\" Thermostat enables you to set your range to 150°, keeping your food warm without continuing to cook until ready to eat and the Fully Insulated Oven comes with 2 Heavy-Duty Oven Racks with 4 Adjustable Positions. Color: Stainless Steel.",
        "depth": "41",
        "height": "14.5",
        "width": "16",
        "ratingValue": "4.2",
        "reviewCount": "5",
        "price": 1009.65,
        "priceValidUntil": "7/4/2021"
    }
}