{
    "300762437": {
        "product_id": 300762437,
        "modelNbr": "NZ30K7880US",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKTOPS ELECTRIC",
        "Type2": "ELECTRIC COOKTOP",
        "Title": "Samsung 30 in. Induction Cooktop with Stainless Steel Trim with 5 Elements and Flex Zone Element, Silver",
        "Brand": "Samsung",
        "ImageUrl": "https://images.homedepot-static.com/productImages/d98b8504-1f33-4e7e-8115-45790986528d/svn/stainless-steel-samsung-induction-cooktops-nz30k7880us-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Samsung-30-in-Induction-Cooktop-with-Stainless-Steel-Trim-with-5-Elements-and-Flex-Zone-Element-NZ30K7880US/300762437",
        "Description": "The Samsung Induction Cooktop is the most advanced cooking technology, with an always cool cooking surface. The flexible cooktop accommodates a variety of pot and pan sizes. Enjoy the comfort of Analog-Knobs combined with the advanced technology of digital touch display. Virtual Flame LED lights shine onto pans to give the visual of gas cooking, with the precision of induction. Color: Stainless Steel.",
        "depth": "19.428",
        "height": "4",
        "width": "28.5",
        "ratingValue": "4.0515",
        "reviewCount": "97",
        "price": 1888,
        "priceValidUntil": "07/14/2021"
    },
    "306368174": {
        "product_id": 306368174,
        "modelNbr": "CHP95302MSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKTOPS ELECTRIC",
        "Type2": "ELECTRIC COOKTOP",
        "Title": "Cafe 30 in. Smart Induction Cooktop in Stainless Steel with 5 Elements including Sync-Burners, Silver",
        "Brand": "Cafe",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3200bcc0-263e-47a4-8c4d-b29adc496a16/svn/stainless-steel-cafe-induction-cooktops-chp95302mss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/Cafe-30-in-Smart-Induction-Cooktop-in-Stainless-Steel-with-5-Elements-including-Sync-Burners-CHP95302MSS/306368174",
        "Description": "One look at the GE Cafe kitchen and you'll feel as if you've been transported behind the scenes of your favorite casual dining experience. Each appliance has been meticulously designed to create an atmosphere where people like to gather and love to cook. Tough stainless steel and powerful elements complement their robust appearance.",
        "depth": "28.5",
        "height": "4.63",
        "width": "19.625",
        "ratingValue": "4.5492",
        "reviewCount": "193",
        "price": 2198,
        "priceValidUntil": "07/14/2021"
    },
    "312583055": {
        "product_id": 312583055,
        "modelNbr": "RCIND-30",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKTOPS ELECTRIC",
        "Type2": "OTHER",
        "Title": "ZLINE Kitchen and Bath ZLINE 30 in. Induction Cooktop with 4 burners (RCIND-30), Stainless Steel Body with Glass Cooktop",
        "Brand": "ZLINE Kitchen and Bath",
        "ImageUrl": "https://images.homedepot-static.com/productImages/e1811b63-85d5-403a-bad6-8e049a8aa8b7/svn/stainless-steel-body-with-glass-cooktop-zline-kitchen-and-bath-induction-cooktops-rcind-30-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/ZLINE-Kitchen-and-Bath-ZLINE-30-in-Induction-Cooktop-with-4-burners-RCIND-30-RCIND-30/312583055",
        "Description": "Innovation meets luxury: ZLINE's RCIND Induction Cooktop Series blends consistent precision and speed with its innovative technology and sleek, glass surface. Achieve incredibly fast heat and a quick boil with induction technology that heats 50% faster than comparable cooktops. ZLINE induction cooktops utilize superior electromagnetic technology to efficiently heat up magnetic stainless or cast iron cookware, while saving more energy compared to gas or electric cooking. The LED lit touch display and glossy, glass surface both come together to create an effortless clean while maintaining a contemporary, high-end aesthetic. Enhance your kitchen experience with versatile cooking features including Power Boost and Power Sharing, which maximize power and heat with the touch of a button. Ensure your meals stay ready to serve with the Keep Warm Mode, designed to add convenience to your cooking. Experience peace of mind with carefully curated and tested safety features, including manual or automatic locking technology and a residual heat sensor. Professional cooking elements paired with modern technology provide top-notch, controlled performance that is unsurpassed in the industry. Prepare with complete confidence and control with ZLINE products. All products ship next business day when in stock. Color: Stainless Steel Body with Glass Cooktop.",
        "depth": "20",
        "height": "4.5",
        "width": "30",
        "ratingValue": "4.7429",
        "reviewCount": "35",
        "price": 899.95,
        "priceValidUntil": "7/4/2021"
    },
    "205974866": {
        "product_id": 205974866,
        "modelNbr": "PHP9030DJBB",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKTOPS ELECTRIC",
        "Type2": "ELECTRIC COOKTOP",
        "Title": "GE Profile 30 in. Electric Induction Cooktop in Black with 4 Elements and Exact Fit",
        "Brand": "GE",
        "ImageUrl": "https://images.homedepot-static.com/productImages/983e32b2-3ed6-407a-8e4e-3867cee9e2be/svn/black-ge-induction-cooktops-php9030djbb-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/GE-Profile-30-in-Electric-Induction-Cooktop-in-Black-with-4-Elements-and-Exact-Fit-PHP9030DJBB/205974866",
        "Description": "Your GE Profile 30 in. Electric Induction Cooktop in Black has 4 induction cooking elements that cook foods quickly and evenly on this sleek, glass surface. The induction heating elements ensure even heat and fast warm-up times. Digital Touch controls for all elements, including the 11 in. 3700-Watt for rapidly boiling water, lets you choose quickly. Pan Presence and size sensor allows you to cook efficiently. GE Profile products offer the best in contemporary design matched with the latest in appliance technologies to transform the way you live. Sporting a bold, dramatic look and state of the art features, this collection provides the perfect combination of style and innovation throughout your kitchen.",
        "depth": "19.63",
        "height": "4.63",
        "width": "28.5",
        "ratingValue": "4.5345",
        "reviewCount": "608",
        "price": 1498,
        "priceValidUntil": "07/14/2021"
    },
    "205488595": {
        "product_id": 205488595,
        "modelNbr": "KICU509XSS",
        "Category": "APPLIANCES",
        "ApplType": "COOKING",
        "Type1": "COOKTOPS ELECTRIC",
        "Type2": "ELECTRIC COOKTOP",
        "Title": "KitchenAid Architect Series II 30 in. Smooth Surface Induction Cooktop in Stainless Steel with 4 Elements Including Bridge Element, Silver",
        "Brand": "KitchenAid",
        "ImageUrl": "https://images.homedepot-static.com/productImages/3fd7b9b2-d409-46cb-840c-8b45dc549f68/svn/stainless-steel-kitchenaid-induction-cooktops-kicu509xss-64_1000.jpg",
        "ProductPageUrl": "https://www.homedepot.com/p/KitchenAid-Architect-Series-II-30-in-Smooth-Surface-Induction-Cooktop-in-Stainless-Steel-with-4-Elements-Including-Bridge-Element-KICU509XSS/205488595",
        "Description": "This 30 in. KitchenAid Architect Series II 4 element induction cooktop combines precision and speed. Electromagnetic induction technology directly heats the pan while keeping the cooktop surface cool to the touch. Twelve power levels give you the power to rapidly bring water to a boil and sear scallops to perfection. A bridge function lets you combine the power of two elements into one large cooking zone for specialty cookware such as a griddle or oval pan. Color: Stainless Steel.",
        "depth": "19.31",
        "height": "3.13",
        "width": "29.5",
        "ratingValue": "4.082",
        "reviewCount": "244",
        "price": 1934,
        "priceValidUntil": "07/14/2021"
    }
}